--- crates/rdlt-cli/src/main.rs
+++ replace <impl From<RdltError> for CliError>::from -> Self with Default::default()
@@ -98,17 +98,17 @@
 
 enum CliError {
     Usage(String),
     Run(RdltError),
 }
 
 impl From<RdltError> for CliError {
     fn from(e: RdltError) -> Self {
-        CliError::Run(e)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 async fn run(spec_path: PathBuf, report_path: Option<PathBuf>) -> Result<(), CliError> {
     let raw = std::fs::read_to_string(&spec_path)
         .map_err(|e| CliError::Usage(format!("reading {}: {e}", spec_path.display())))?;
     let spec: Spec =
         toml::from_str(&raw).map_err(|e| CliError::Usage(format!("parsing spec: {e}")))?;
