--- crates/rdlt-cli/src/main.rs
+++ replace run -> Result<(), CliError> with Ok(())
@@ -103,73 +103,17 @@
 
 impl From<RdltError> for CliError {
     fn from(e: RdltError) -> Self {
         CliError::Run(e)
     }
 }
 
 async fn run(spec_path: PathBuf, report_path: Option<PathBuf>) -> Result<(), CliError> {
-    let raw = std::fs::read_to_string(&spec_path)
-        .map_err(|e| CliError::Usage(format!("reading {}: {e}", spec_path.display())))?;
-    let spec: Spec =
-        toml::from_str(&raw).map_err(|e| CliError::Usage(format!("parsing spec: {e}")))?;
-
-    // The source and destination arms each fix the builder's generic type, so the
-    // whole tail expands per combination via a macro (typestate-friendly).
-    macro_rules! run_with {
-        ($source:expr) => {{
-            let builder = Pipeline::builder(spec.pipeline.as_str()).source($source);
-            let builder = match &spec.write_mode {
-                None | Some(WriteModeSpec::Append) => builder.write_mode(WriteMode::Append),
-                Some(WriteModeSpec::Replace) => builder.write_mode(WriteMode::Replace),
-                Some(WriteModeSpec::Merge { key }) => {
-                    builder.write_mode(WriteMode::Merge { key: key.clone() })
-                }
-            };
-            let builder = match &spec.workdir {
-                Some(dir) => builder.workdir(dir),
-                None => builder.workdir(".rdlt"),
-            };
-            let mut pipeline = match &spec.destination {
-                DestSpec::Duckdb { path } => {
-                    let dest = rdlt::duckdb::DuckDb::open(path)
-                        .map_err(|e| CliError::Usage(format!("opening duckdb: {e}")))?;
-                    builder.destination(dest).build()?
-                }
-                DestSpec::Postgres { conn, dataset } => {
-                    let dest = rdlt::postgres::Postgres::connect(conn).dataset(dataset);
-                    builder.destination(dest).build()?
-                }
-                DestSpec::Parquet { path } => {
-                    let dest = rdlt::parquet::ParquetDir::open(path)
-                        .map_err(|e| CliError::Usage(format!("opening parquet dir: {e}")))?;
-                    builder.destination(dest).build()?
-                }
-            };
-            drive(&mut pipeline, report_path).await
-        }};
-    }
-
-    match &spec.source {
-        SourceSpec::Rest { config } => {
-            let yaml = std::fs::read_to_string(config)
-                .map_err(|e| CliError::Usage(format!("reading {}: {e}", config.display())))?;
-            let source = rdlt::rest::RestSource::from_yaml(&yaml)
-                .map_err(|e| CliError::Usage(e.to_string()))?;
-            run_with!(source)
-        }
-        SourceSpec::File { config } => {
-            let yaml = std::fs::read_to_string(config)
-                .map_err(|e| CliError::Usage(format!("reading {}: {e}", config.display())))?;
-            let source = rdlt::file::FileSource::from_yaml(&yaml)
-                .map_err(|e| CliError::Usage(e.to_string()))?;
-            run_with!(source)
-        }
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Event feed + run + report emission (shared tail after the pipeline is built).
 async fn drive(
     pipeline: &mut rdlt::Pipeline,
     report_path: Option<PathBuf>,
 ) -> Result<(), CliError> {
     let mut events = pipeline.events().expect("events available before run");
