--- crates/rdlt-engine/src/fuzzing.rs
+++ replace shred_slab with ()
@@ -9,45 +9,17 @@
 /// hang, or blow memory — errors are the only acceptable failure.
 pub fn parse_slab(bytes: &[u8]) {
     let _ = crate::shred::nest::parse_rows(bytes);
 }
 
 /// The FULL shred path over arbitrary bytes: parse, observe, resolve, build.
 /// Asserts the cheap invariants inline (system columns first, unique names).
 pub fn shred_slab(bytes: &[u8]) {
-    let caps = DestCapabilities::default();
-    let mut shredder = crate::shred::StreamShredder::new(
-        StreamSpec::new("fuzz"),
-        caps,
-        TableName::new("fuzz"),
-    );
-    if shredder.push_bytes(bytes).is_err() {
-        return; // malformed JSON: typed error is the correct outcome
-    }
-    let mut registry = crate::schema::registry::SchemaRegistry::default();
-    let items = shredder.drain_batch(
-        &mut registry,
-        &LoadId::new("fuzz-load"),
-        &WriteMode::Append,
-        &SchemaPolicy::evolve(),
-    );
-    let Ok(items) = items else { return };
-    for item in items {
-        if let crate::load::LoadItem::Delta { schema, .. } = item {
-            let mut seen = std::collections::BTreeSet::new();
-            for column in &schema.columns {
-                assert!(
-                    seen.insert(column.name.clone()),
-                    "duplicate column `{}` from fuzzed input",
-                    column.name
-                );
-            }
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Arrow type mapping (clause E7): every `DataType` either maps or returns a
 /// typed error — never panics, never silently coerces.
 pub fn map_arrow_type(dt: &arrow::datatypes::DataType) {
     let _ = crate::shred::passthrough::column_type_from_arrow(dt);
 }
 
