--- crates/rdlt-engine/src/fuzzing.rs
+++ replace map_arrow_type with ()
@@ -43,17 +43,17 @@
             }
         }
     }
 }
 
 /// Arrow type mapping (clause E7): every `DataType` either maps or returns a
 /// typed error — never panics, never silently coerces.
 pub fn map_arrow_type(dt: &arrow::datatypes::DataType) {
-    let _ = crate::shred::passthrough::column_type_from_arrow(dt);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 // ---- bench entry points (iai_hotpath / perf gate G1) ----
 
 /// Full shred path over one raw slab; returns emitted row count (anti-DCE).
 pub fn bench_shred_bytes(bytes: &[u8]) -> u64 {
     let caps = DestCapabilities::default();
     let mut shredder = crate::shred::StreamShredder::new(
