--- crates/rdlt-cli/src/main.rs
+++ delete match arm PipelineEvent::StreamStarted{stream} in drive
@@ -171,17 +171,17 @@
 async fn drive(
     pipeline: &mut rdlt::Pipeline,
     report_path: Option<PathBuf>,
 ) -> Result<(), CliError> {
     let mut events = pipeline.events().expect("events available before run");
     let feed = tokio::spawn(async move {
         while let Some(event) = events.recv().await {
             match event {
-                PipelineEvent::StreamStarted { stream } => eprintln!("-> stream {stream} started"),
+                 /* ~ changed by cargo-mutants ~ */
                 PipelineEvent::BatchLoaded { table, rows, .. } => {
                     eprintln!("  {table}: +{rows} rows")
                 }
                 PipelineEvent::SchemaEvolved { delta } => {
                     eprintln!(
                         "  schema: {} -> {} changes",
                         delta.table,
                         delta.changes.len()
