--- crates/rdlt-engine/src/fuzzing.rs
+++ replace bench_shred_bytes -> u64 with 0
@@ -50,39 +50,17 @@
 pub fn map_arrow_type(dt: &arrow::datatypes::DataType) {
     let _ = crate::shred::passthrough::column_type_from_arrow(dt);
 }
 
 // ---- bench entry points (iai_hotpath / perf gate G1) ----
 
 /// Full shred path over one raw slab; returns emitted row count (anti-DCE).
 pub fn bench_shred_bytes(bytes: &[u8]) -> u64 {
-    let caps = DestCapabilities::default();
-    let mut shredder = crate::shred::StreamShredder::new(
-        StreamSpec::new("bench"),
-        caps,
-        TableName::new("bench"),
-    );
-    shredder.push_bytes(bytes).expect("valid bench input");
-    let mut registry = crate::schema::registry::SchemaRegistry::default();
-    let items = shredder
-        .drain_batch(
-            &mut registry,
-            &LoadId::new("bench-load"),
-            &WriteMode::Append,
-            &SchemaPolicy::evolve(),
-        )
-        .expect("bench shred succeeds");
-    items
-        .iter()
-        .map(|item| match item {
-            crate::load::LoadItem::Batch { batch, .. } => batch.num_rows() as u64,
-            _ => 0,
-        })
-        .sum()
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Passthrough over one structured batch; returns emitted row count.
 pub fn bench_passthrough(batch: &arrow::record_batch::RecordBatch) -> u64 {
     let mut registry = crate::schema::registry::SchemaRegistry::default();
     let items = crate::shred::passthrough::passthrough_items(
         batch,
         &TableName::new("bench"),
