--- crates/rdlt-cli/src/main.rs
+++ delete match arm PipelineEvent::SchemaEvolved{delta} in drive
@@ -175,23 +175,17 @@
     let mut events = pipeline.events().expect("events available before run");
     let feed = tokio::spawn(async move {
         while let Some(event) = events.recv().await {
             match event {
                 PipelineEvent::StreamStarted { stream } => eprintln!("-> stream {stream} started"),
                 PipelineEvent::BatchLoaded { table, rows, .. } => {
                     eprintln!("  {table}: +{rows} rows")
                 }
-                PipelineEvent::SchemaEvolved { delta } => {
-                    eprintln!(
-                        "  schema: {} -> {} changes",
-                        delta.table,
-                        delta.changes.len()
-                    )
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 PipelineEvent::Committed { commit_seq, .. } => {
                     eprintln!("commit {commit_seq} ok")
                 }
                 PipelineEvent::Discarded {
                     table,
                     rows,
                     values,
                     ..
