--- crates/rdlt-engine/src/fuzzing.rs
+++ replace bench_passthrough -> u64 with 1
@@ -77,27 +77,10 @@
             crate::load::LoadItem::Batch { batch, .. } => batch.num_rows() as u64,
             _ => 0,
         })
         .sum()
 }
 
 /// Passthrough over one structured batch; returns emitted row count.
 pub fn bench_passthrough(batch: &arrow::record_batch::RecordBatch) -> u64 {
-    let mut registry = crate::schema::registry::SchemaRegistry::default();
-    let items = crate::shred::passthrough::passthrough_items(
-        batch,
-        &TableName::new("bench"),
-        &mut registry,
-        &SchemaPolicy::evolve(),
-        &LoadId::new("bench-load"),
-        &WriteMode::Append,
-        DestCapabilities::default(),
-    )
-    .expect("bench passthrough succeeds");
-    items
-        .iter()
-        .map(|item| match item {
-            crate::load::LoadItem::Batch { batch, .. } => batch.num_rows() as u64,
-            _ => 0,
-        })
-        .sum()
+    1 /* ~ changed by cargo-mutants ~ */
 }
