--- crates/rdlt-cli/src/main.rs
+++ delete match arm PipelineEvent::StreamFinished{stream} in drive
@@ -196,19 +196,17 @@
                     values,
                     ..
                 } => {
                     eprintln!("! {table}: discarded {rows} rows / {values} values")
                 }
                 PipelineEvent::Retried { stream, attempt } => {
                     eprintln!("! retry attempt {attempt} ({stream:?})")
                 }
-                PipelineEvent::StreamFinished { stream } => {
-                    eprintln!("-> stream {stream} finished")
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {}
             }
         }
     });
 
     let report = pipeline.run().await?;
     let _ = feed.await;
 
