--- crates/rdlt-cli/src/main.rs
+++ replace usage -> ExitCode with Default::default()
@@ -49,18 +49,17 @@
 #[serde(rename_all = "snake_case", deny_unknown_fields)]
 enum DestSpec {
     Duckdb { path: PathBuf },
     Postgres { conn: String, dataset: String },
     Parquet { path: PathBuf },
 }
 
 fn usage() -> ExitCode {
-    eprintln!("usage: rdlt run <pipeline.toml> [--report <path>]");
-    ExitCode::from(64)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn main() -> ExitCode {
     let args: Vec<String> = std::env::args().skip(1).collect();
     let (spec_path, report_path) = match args.as_slice() {
         [cmd, spec] if cmd == "run" => (PathBuf::from(spec), None),
         [cmd, spec, flag, report] if cmd == "run" && flag == "--report" => {
             (PathBuf::from(spec), Some(PathBuf::from(report)))
