--- crates/rdlt-cli/src/main.rs
+++ replace main -> ExitCode with Default::default()
@@ -54,51 +54,17 @@
 }
 
 fn usage() -> ExitCode {
     eprintln!("usage: rdlt run <pipeline.toml> [--report <path>]");
     ExitCode::from(64)
 }
 
 fn main() -> ExitCode {
-    let args: Vec<String> = std::env::args().skip(1).collect();
-    let (spec_path, report_path) = match args.as_slice() {
-        [cmd, spec] if cmd == "run" => (PathBuf::from(spec), None),
-        [cmd, spec, flag, report] if cmd == "run" && flag == "--report" => {
-            (PathBuf::from(spec), Some(PathBuf::from(report)))
-        }
-        _ => return usage(),
-    };
-
-    let runtime = match tokio::runtime::Runtime::new() {
-        Ok(rt) => rt,
-        Err(e) => {
-            eprintln!("error: starting runtime: {e}");
-            return ExitCode::from(2);
-        }
-    };
-    match runtime.block_on(run(spec_path, report_path)) {
-        Ok(()) => ExitCode::SUCCESS,
-        Err(CliError::Usage(message)) => {
-            eprintln!("error: {message}");
-            ExitCode::from(2)
-        }
-        Err(CliError::Run(error)) => {
-            eprintln!("error: {error}");
-            ExitCode::from(match error {
-                RdltError::Config { .. } => 2,
-                RdltError::Schema(_) => 3,
-                RdltError::Source { .. } => 4,
-                RdltError::Destination { .. } => 5,
-                RdltError::Wal { .. } => 6,
-                RdltError::Cancelled => 7,
-                _ => 2,
-            })
-        }
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 enum CliError {
     Usage(String),
     Run(RdltError),
 }
 
 impl From<RdltError> for CliError {
