--- crates/rdlt-cli/src/main.rs
+++ replace match guard cmd == "run" with false in main
@@ -56,17 +56,17 @@
 fn usage() -> ExitCode {
     eprintln!("usage: rdlt run <pipeline.toml> [--report <path>]");
     ExitCode::from(64)
 }
 
 fn main() -> ExitCode {
     let args: Vec<String> = std::env::args().skip(1).collect();
     let (spec_path, report_path) = match args.as_slice() {
-        [cmd, spec] if cmd == "run" => (PathBuf::from(spec), None),
+        [cmd, spec] if false /* ~ changed by cargo-mutants ~ */ => (PathBuf::from(spec), None),
         [cmd, spec, flag, report] if cmd == "run" && flag == "--report" => {
             (PathBuf::from(spec), Some(PathBuf::from(report)))
         }
         _ => return usage(),
     };
 
     let runtime = match tokio::runtime::Runtime::new() {
         Ok(rt) => rt,
