--- crates/rdlt-cli/src/main.rs
+++ delete match arm RdltError::Source{..} in main
@@ -81,17 +81,17 @@
             eprintln!("error: {message}");
             ExitCode::from(2)
         }
         Err(CliError::Run(error)) => {
             eprintln!("error: {error}");
             ExitCode::from(match error {
                 RdltError::Config { .. } => 2,
                 RdltError::Schema(_) => 3,
-                RdltError::Source { .. } => 4,
+                 /* ~ changed by cargo-mutants ~ */
                 RdltError::Destination { .. } => 5,
                 RdltError::Wal { .. } => 6,
                 RdltError::Cancelled => 7,
                 _ => 2,
             })
         }
     }
 }
