--- crates/rdlt-cli/src/main.rs
+++ delete match arm RdltError::Destination{..} in main
@@ -82,17 +82,17 @@
             ExitCode::from(2)
         }
         Err(CliError::Run(error)) => {
             eprintln!("error: {error}");
             ExitCode::from(match error {
                 RdltError::Config { .. } => 2,
                 RdltError::Schema(_) => 3,
                 RdltError::Source { .. } => 4,
-                RdltError::Destination { .. } => 5,
+                 /* ~ changed by cargo-mutants ~ */
                 RdltError::Wal { .. } => 6,
                 RdltError::Cancelled => 7,
                 _ => 2,
             })
         }
     }
 }
 
