--- crates/rdlt-cli/src/main.rs
+++ delete match arm RdltError::Cancelled in main
@@ -84,17 +84,17 @@
         Err(CliError::Run(error)) => {
             eprintln!("error: {error}");
             ExitCode::from(match error {
                 RdltError::Config { .. } => 2,
                 RdltError::Schema(_) => 3,
                 RdltError::Source { .. } => 4,
                 RdltError::Destination { .. } => 5,
                 RdltError::Wal { .. } => 6,
-                RdltError::Cancelled => 7,
+                 /* ~ changed by cargo-mutants ~ */
                 _ => 2,
             })
         }
     }
 }
 
 enum CliError {
     Usage(String),
