--- crates/rdlt-connector/src/error.rs
+++ replace DestError::fatal -> Self with Default::default()
@@ -48,11 +48,11 @@
 }
 
 impl DestError {
     pub fn transient(err: impl Into<BoxError>) -> Self {
         DestError::Transient(err.into())
     }
 
     pub fn fatal(err: impl Into<BoxError>) -> Self {
-        DestError::Fatal(err.into())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
