--- crates/rdlt-connector/src/lib.rs
+++ replace RecordsOut::checkpoint -> Result<(), ChannelClosed> with Ok(())
@@ -192,17 +192,17 @@
 
     pub async fn arrow(&mut self, batch: RecordBatch) -> Result<(), ChannelClosed> {
         let size = batch.get_array_memory_size();
         self.send(PushPayload::Arrow(batch), size).await
     }
 
     /// "All rows pushed so far are complete up to `cursor`" (clause S2).
     pub async fn checkpoint(&mut self, cursor: Cursor) -> Result<(), ChannelClosed> {
-        self.send(PushPayload::Checkpoint(cursor), 0).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn send(&mut self, payload: PushPayload, size: usize) -> Result<(), ChannelClosed> {
         // A single oversized message may not exceed the whole budget or it would
         // deadlock; it degrades to "budget fully drained" instead.
         let permits = size.min(self.budget_max).try_into().unwrap_or(u32::MAX);
         let permit = if permits > 0 {
             Some(
