--- crates/rdlt-connector/src/lib.rs
+++ replace RecordsIn::recv -> Option<SourcePush> with Some(Default::default())
@@ -229,17 +229,17 @@
 pub struct RecordsIn {
     rx: mpsc::Receiver<SourcePush>,
     budget: Arc<Semaphore>,
 }
 
 impl RecordsIn {
     /// `None` when the source finished (dropped its `RecordsOut`).
     pub async fn recv(&mut self) -> Option<SourcePush> {
-        self.rx.recv().await
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Closing tells the source to stop at its next push (clause S4).
     pub fn close(&mut self) {
         self.rx.close();
         // Wake any source blocked on the byte budget so it observes the closure.
         self.budget.close();
     }
