--- crates/rdlt-connector/src/lib.rs
+++ replace RecordsIn::close with ()
@@ -234,19 +234,17 @@
 impl RecordsIn {
     /// `None` when the source finished (dropped its `RecordsOut`).
     pub async fn recv(&mut self) -> Option<SourcePush> {
         self.rx.recv().await
     }
 
     /// Closing tells the source to stop at its next push (clause S4).
     pub fn close(&mut self) {
-        self.rx.close();
-        // Wake any source blocked on the byte budget so it observes the closure.
-        self.budget.close();
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Create the push channel between a host and one `Source::read` call.
 /// `byte_budget` bounds in-flight bytes (backpressure); message count is secondary.
 pub fn records_channel(byte_budget: usize) -> (RecordsOut, RecordsIn) {
     let budget = Arc::new(Semaphore::new(byte_budget));
     let (tx, rx) = mpsc::channel(64);
