--- crates/rdlt-connector/src/stream.rs
+++ replace StreamSpec::structured -> Self with Default::default()
@@ -33,18 +33,17 @@
             cursor_field: None,
             type_hints: BTreeMap::new(),
             structured: false,
         }
     }
 
     /// Declare this stream as pushing already-structured Arrow batches (clause S7).
     pub fn structured(mut self) -> Self {
-        self.structured = true;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_primary_key(mut self, key: impl IntoIterator<Item = impl Into<String>>) -> Self {
         self.primary_key = Some(key.into_iter().map(Into::into).collect());
         self
     }
 
     pub fn with_cursor_field(mut self, field: impl Into<String>) -> Self {
