--- crates/rdlt-connector/src/stream.rs
+++ replace StreamSpec::with_cursor_field -> Self with Default::default()
@@ -43,17 +43,16 @@
     }
 
     pub fn with_primary_key(mut self, key: impl IntoIterator<Item = impl Into<String>>) -> Self {
         self.primary_key = Some(key.into_iter().map(Into::into).collect());
         self
     }
 
     pub fn with_cursor_field(mut self, field: impl Into<String>) -> Self {
-        self.cursor_field = Some(field.into());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_type_hint(mut self, column: impl Into<String>, ty: LogicalType) -> Self {
         self.type_hints.insert(column.into(), ty);
         self
     }
 }
