--- crates/rdlt-core/src/error.rs
+++ replace RdltError::source_retryable -> Self with Default::default()
@@ -86,22 +86,17 @@
         }
     }
 
     pub fn source_retryable(
         stream: StreamName,
         message: impl std::fmt::Display,
         retry_after: Option<std::time::Duration>,
     ) -> Self {
-        RdltError::Source {
-            stream,
-            message: message.to_string(),
-            retryable: true,
-            retry_after_ms: retry_after.map(|d| d.as_millis() as u64),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn wal(message: impl std::fmt::Display) -> Self {
         RdltError::Wal {
             message: message.to_string(),
         }
     }
 }
