--- crates/rdlt-core/src/identity.rs
+++ replace RowIdBuilder::update_lp with ()
@@ -54,18 +54,17 @@
                 self.hasher.update(&[1u8]);
                 self.update_lp(bytes);
             }
         }
         self
     }
 
     fn update_lp(&mut self, bytes: &[u8]) {
-        self.hasher.update(&(bytes.len() as u64).to_le_bytes());
-        self.hasher.update(bytes);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn finish(&self) -> RowId {
         RowId::from_bytes(*self.hasher.finalize().as_bytes())
     }
 }
 
 /// Canonical value bytes for identity hashing. The shredder renders values with the
