--- crates/rdlt-core/src/naming.rs
+++ replace short_hash -> String with String::new()
@@ -127,17 +127,17 @@
     let mut out = base.to_owned();
     out.truncate(rules.max_len.saturating_sub(SUFFIX_LEN).min(out.len()));
     out.push('_');
     out.push_str(&short_hash(source));
     out
 }
 
 fn short_hash(source: &str) -> String {
-    ident_hash(source, 8)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Deterministic short hex digest for building bounded-length identifiers (e.g.
 /// destination staging-table names). Stable across runs and machines.
 pub fn ident_hash(input: &str, hex_len: usize) -> String {
     blake3::hash(input.as_bytes()).to_hex()[..hex_len.clamp(4, 64)].to_string()
 }
 
