--- crates/rdlt-core/src/naming.rs
+++ delete match arm 'A'..= 'Z' in normalize_ident
@@ -31,17 +31,17 @@
 /// Normalize a source name into a destination-safe identifier: lowercase,
 /// `[a-z0-9_]` charset, no leading digit, truncated (with a disambiguating hash
 /// suffix) to `rules.max_len`.
 pub fn normalize_ident(source: &str, rules: IdentRules) -> String {
     let mut out = String::with_capacity(source.len());
     for c in source.chars() {
         match c {
             'a'..='z' | '0'..='9' | '_' => out.push(c),
-            'A'..='Z' => out.push(c.to_ascii_lowercase()),
+             /* ~ changed by cargo-mutants ~ */
             _ => out.push('_'),
         }
     }
     if out.is_empty() {
         out.push('_');
     }
     if out.as_bytes()[0].is_ascii_digit() {
         out.insert(0, '_');
