--- crates/rdlt-core/src/naming.rs
+++ replace > with < in normalize_ident
@@ -41,17 +41,17 @@
         }
     }
     if out.is_empty() {
         out.push('_');
     }
     if out.as_bytes()[0].is_ascii_digit() {
         out.insert(0, '_');
     }
-    if out.len() > rules.max_len {
+    if out.len() < /* ~ changed by cargo-mutants ~ */ rules.max_len {
         // Truncation can merge distinct names; the hash of the *source* keeps them apart.
         out.truncate(rules.max_len.saturating_sub(SUFFIX_LEN));
         out.push('_');
         out.push_str(&short_hash(source));
     }
     out
 }
 
