--- crates/rdlt-core/src/naming.rs
+++ replace child_table_name -> String with String::new()
@@ -52,17 +52,17 @@
         out.push('_');
         out.push_str(&short_hash(source));
     }
     out
 }
 
 /// The child-table name for a list-of-objects field.
 pub fn child_table_name(parent: &str, field: &str, rules: IdentRules) -> String {
-    normalize_ident(&format!("{parent}__{field}"), rules)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// The flattened column name for a nested object path (destinations without struct
 /// support).
 pub fn flattened_column_name(path: &[&str], rules: IdentRules) -> String {
     normalize_ident(&path.join("__"), rules)
 }
 
