--- crates/rdlt-core/src/naming.rs
+++ replace UniqueNamer::reserve with ()
@@ -88,18 +88,17 @@
         }
     }
 
     /// Claim `name` so that NO source column may take it verbatim — even a source
     /// column literally named `name` gets a hash suffix. Used for system columns
     /// (`_rdlt_*`): without this, an input field named `_rdlt_id` would alias the
     /// lineage column instead of being suffixed.
     pub fn reserve(&mut self, name: &str) {
-        self.taken
-            .insert(normalize_ident(name, self.rules), RESERVED_OWNER.to_owned());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn name_for(&mut self, source: &str) -> String {
         let base = normalize_ident(source, self.rules);
         match self.taken.get(&base) {
             None => {
                 self.taken.insert(base.clone(), source.to_owned());
                 base
