--- crates/rdlt-core/src/types.rs
+++ replace == with != in widen
@@ -44,17 +44,17 @@
 /// Structure: `Json` is the top; `Utf8` absorbs every textable type (everything except
 /// `Binary` and `Json`); the numeric chains are `Int64 → Float64 → Utf8` and
 /// `Int64 → Decimal → Utf8`, with `Float64 ⊔ Decimal = Utf8`.
 ///
 /// Note this is the *type-level* join. Conversions are additionally value-checked at
 /// shred time (`Int64 → Float64` is exact only within ±2^53); an inexact value
 /// escalates the column further along the lattice. See `int64_fits_in_f64`.
 pub fn widen(a: LogicalType, b: LogicalType) -> LogicalType {
-    if a == b {
+    if a != /* ~ changed by cargo-mutants ~ */ b {
         return a;
     }
     match (a, b) {
         // Top absorbs everything.
         (Json, _) | (_, Json) => Json,
         // Binary is textable only via encodings we refuse to invent silently.
         (Binary, _) | (_, Binary) => Json,
         // Decimal ⊔ Decimal: max integer digits, max scale, bounded by 128-bit precision.
