--- crates/rdlt-core/src/types.rs
+++ replace widen -> LogicalType with Default::default()
@@ -44,43 +44,17 @@
 /// Structure: `Json` is the top; `Utf8` absorbs every textable type (everything except
 /// `Binary` and `Json`); the numeric chains are `Int64 → Float64 → Utf8` and
 /// `Int64 → Decimal → Utf8`, with `Float64 ⊔ Decimal = Utf8`.
 ///
 /// Note this is the *type-level* join. Conversions are additionally value-checked at
 /// shred time (`Int64 → Float64` is exact only within ±2^53); an inexact value
 /// escalates the column further along the lattice. See `int64_fits_in_f64`.
 pub fn widen(a: LogicalType, b: LogicalType) -> LogicalType {
-    if a == b {
-        return a;
-    }
-    match (a, b) {
-        // Top absorbs everything.
-        (Json, _) | (_, Json) => Json,
-        // Binary is textable only via encodings we refuse to invent silently.
-        (Binary, _) | (_, Binary) => Json,
-        // Decimal ⊔ Decimal: max integer digits, max scale, bounded by 128-bit precision.
-        (
-            Decimal {
-                precision: p1,
-                scale: s1,
-            },
-            Decimal {
-                precision: p2,
-                scale: s2,
-            },
-        ) => join_decimals(p1, s1, p2, s2),
-        // Int64 fits Decimal(>=19, 0); widen the decimal to cover it.
-        (Int64, Decimal { precision, scale }) | (Decimal { precision, scale }, Int64) => {
-            join_decimals(precision, scale, 19, 0)
-        }
-        (Int64, Float64) | (Float64, Int64) => Float64,
-        // Everything textable meets at Utf8 (canonical renderings, design doc §5.2).
-        _ => Utf8,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn join_decimals(p1: u8, s1: u8, p2: u8, s2: u8) -> LogicalType {
     let int_digits = (p1.saturating_sub(s1)).max(p2.saturating_sub(s2));
     let scale = s1.max(s2);
     match int_digits.checked_add(scale) {
         Some(precision) if precision <= DECIMAL_MAX_PRECISION => Decimal { precision, scale },
         // A decimal that no longer fits 128 bits widens to canonical text.
