--- crates/rdlt-core/src/types.rs
+++ replace int64_fits_in_f64 -> bool with true
@@ -86,18 +86,17 @@
         // A decimal that no longer fits 128 bits widens to canonical text.
         _ => Utf8,
     }
 }
 
 /// `true` iff `v` converts to `f64` exactly. Values outside ±2^53 do not; the shredder
 /// must escalate the column instead of silently rounding (spec FR-002).
 pub fn int64_fits_in_f64(v: i64) -> bool {
-    const EXACT: i64 = 1 << 53;
-    (-EXACT..=EXACT).contains(&v)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// `a ⊑ b` in the widening order (i.e. `b` can hold everything `a` can).
 pub fn is_widening_of(a: LogicalType, b: LogicalType) -> bool {
     widen(a, b) == b
 }
 
 #[cfg(test)]
