--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace sql_type -> String with String::new()
@@ -115,43 +115,17 @@
         .iter()
         .map(|c| quote(&c.name))
         .collect::<Vec<_>>()
         .join(", ")
 }
 
 /// DuckDB SQL type for a logical column type — struct-native lowering.
 fn sql_type(ty: &ColumnType) -> String {
-    match ty {
-        ColumnType::Scalar { scalar } => match scalar {
-            LogicalType::Bool => "BOOLEAN".into(),
-            LogicalType::Int64 => "BIGINT".into(),
-            LogicalType::Float64 => "DOUBLE".into(),
-            LogicalType::Decimal { precision, scale } => format!("DECIMAL({precision},{scale})"),
-            // Json lowers to text (declared via json_type: false); Uuid as text for
-            // portability with the hex `_rdlt_id` convention.
-            LogicalType::Utf8 | LogicalType::Uuid | LogicalType::Json => "VARCHAR".into(),
-            LogicalType::Binary => "BLOB".into(),
-            LogicalType::TimestampTz => "TIMESTAMP WITH TIME ZONE".into(),
-            LogicalType::TimestampNaive => "TIMESTAMP".into(),
-            LogicalType::Date => "DATE".into(),
-            LogicalType::Time => "TIME".into(),
-        },
-        ColumnType::Struct { fields } => {
-            let inner = fields
-                .iter()
-                .map(|f| format!("{} {}", quote(&f.name), sql_type(&f.ty)))
-                .collect::<Vec<_>>()
-                .join(", ");
-            format!("STRUCT({inner})")
-        }
-        ColumnType::ScalarList { item } => {
-            format!("{}[]", sql_type(&ColumnType::scalar(*item)))
-        }
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn create_table_sql(name: &str, schema: &TableSchema, temp: bool) -> String {
     let columns = schema
         .columns
         .iter()
         .map(|c| format!("{} {}", quote(&c.name), sql_type(&c.ty)))
         .collect::<Vec<_>>()
