--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace <impl Destination for DuckDb>::spec -> ConnectorSpec with Default::default()
@@ -161,17 +161,17 @@
         "CREATE {temp}TABLE IF NOT EXISTS {} ({columns})",
         quote(name)
     )
 }
 
 #[async_trait]
 impl Destination for DuckDb {
     fn spec(&self) -> ConnectorSpec {
-        ConnectorSpec::new("duckdb", env!("CARGO_PKG_VERSION"))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn capabilities(&self) -> DestCapabilities {
         DestCapabilities {
             merge: true,
             structs: true,
             scalar_lists: true,
             json_type: false, // Json lowers to VARCHAR in v1 — declared honestly
