--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace <impl Destination for DuckDb>::capabilities -> DestCapabilities with Default::default()
@@ -165,24 +165,17 @@
 
 #[async_trait]
 impl Destination for DuckDb {
     fn spec(&self) -> ConnectorSpec {
         ConnectorSpec::new("duckdb", env!("CARGO_PKG_VERSION"))
     }
 
     fn capabilities(&self) -> DestCapabilities {
-        DestCapabilities {
-            merge: true,
-            structs: true,
-            scalar_lists: true,
-            json_type: false, // Json lowers to VARCHAR in v1 — declared honestly
-            decimal: true,
-            ident_rules: IdentRules::default(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     async fn open(&self, _ctx: OpenCtx) -> Result<Box<dyn LoadSession>, DestError> {
         // A cloned connection shares the database instance but has its OWN temp-table
         // catalog — a dead session's staged temp tables are unreachable (clause D4).
         let conn = self.clone_conn()?;
         // Meta tables carry the correctness protocol (contracts/persisted-formats §1).
         conn.execute_batch(
