--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace <impl Destination for DuckDb>::open -> Result<Box<dyn LoadSession>, DestError> with Ok(Box::new(Default::default()))
@@ -178,30 +178,17 @@
             decimal: true,
             ident_rules: IdentRules::default(),
         }
     }
 
     async fn open(&self, _ctx: OpenCtx) -> Result<Box<dyn LoadSession>, DestError> {
         // A cloned connection shares the database instance but has its OWN temp-table
         // catalog — a dead session's staged temp tables are unreachable (clause D4).
-        let conn = self.clone_conn()?;
-        // Meta tables carry the correctness protocol (contracts/persisted-formats §1).
-        conn.execute_batch(
-            "CREATE TABLE IF NOT EXISTS _rdlt_state (pipeline VARCHAR PRIMARY KEY, doc VARCHAR);
-             CREATE TABLE IF NOT EXISTS _rdlt_commits (
-                 load_id VARCHAR, commit_seq BIGINT, PRIMARY KEY (load_id, commit_seq));",
-        )
-        .map_err(fatal)?;
-        Ok(Box::new(DuckDbSession {
-            conn: Mutex::new(conn),
-            tables: BTreeMap::new(),
-            replaced: BTreeSet::new(),
-            last_replace_load: None,
-        }))
+        Ok(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 struct DuckDbSession {
     /// DuckDB connections are Send but not Sync; the mutex makes the session Send
     /// while every call still runs on &mut self.
     conn: Mutex<Connection>,
     tables: BTreeMap<TableName, (TableSchema, WriteMode)>,
