--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace DuckDbSession::root_of -> TableName with Default::default()
@@ -214,28 +214,17 @@
         &mut self,
         f: impl FnOnce(&mut Connection) -> Result<T, DestError>,
     ) -> Result<T, DestError> {
         let mut guard = self.conn.lock().map_err(|_| fatal("connection poisoned"))?;
         f(&mut guard)
     }
 
     fn root_of(&self, table: &TableName) -> TableName {
-        let mut current = table.clone();
-        for _ in 0..64 {
-            match self
-                .tables
-                .get(&current)
-                .and_then(|(s, _)| s.parent.as_ref())
-            {
-                Some(link) => current = link.parent.clone(),
-                None => break,
-            }
-        }
-        current
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[async_trait]
 impl LoadSession for DuckDbSession {
     async fn ensure_table(
         &mut self,
         schema: &TableSchema,
