--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace <impl LoadSession for DuckDbSession>::ensure_table -> Result<(), DestError> with Ok(())
@@ -236,56 +236,17 @@
 
 #[async_trait]
 impl LoadSession for DuckDbSession {
     async fn ensure_table(
         &mut self,
         schema: &TableSchema,
         mode: &WriteMode,
     ) -> Result<(), DestError> {
-        let table = schema.table.clone();
-        let stage = stage_name(&table);
-        let previous = self.tables.get(&table).map(|(s, _)| s.clone());
-        {
-            let schema = schema.clone();
-            self.with_conn(move |conn| {
-                conn.execute_batch(&create_table_sql(schema.table.as_str(), &schema, false))
-                    .map_err(fatal)?;
-                conn.execute_batch(&create_table_sql(&stage, &schema, true))
-                    .map_err(fatal)?;
-                // Migrations (clause D5): add new columns; widen changed ones with a
-                // cast — DuckDB's ALTER … SET DATA TYPE migrates existing rows.
-                for target in [schema.table.as_str().to_owned(), stage.clone()] {
-                    for column in &schema.columns {
-                        let add = format!(
-                            "ALTER TABLE {} ADD COLUMN IF NOT EXISTS {} {}",
-                            quote(&target),
-                            quote(&column.name),
-                            sql_type(&column.ty)
-                        );
-                        conn.execute_batch(&add).map_err(fatal)?;
-                        if let Some(prev) = &previous
-                            && let Some(old) = prev.column(&column.name)
-                            && old.ty != column.ty
-                        {
-                            let widen = format!(
-                                "ALTER TABLE {} ALTER COLUMN {} SET DATA TYPE {}",
-                                quote(&target),
-                                quote(&column.name),
-                                sql_type(&column.ty)
-                            );
-                            conn.execute_batch(&widen).map_err(fatal)?;
-                        }
-                    }
-                }
-                Ok(())
-            })?;
-        }
-        self.tables.insert(table, (schema.clone(), mode.clone()));
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn write(&mut self, table: &TableName, batch: RecordBatch) -> Result<(), DestError> {
         crash_point!("duck.append");
         let stage = stage_name(table);
         self.with_conn(move |conn| {
             let mut appender = conn.appender(&stage).map_err(fatal)?;
             appender.append_record_batch(batch).map_err(fatal)?;
