--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace != with == in <impl LoadSession for DuckDbSession>::ensure_table
@@ -259,17 +259,17 @@
                             "ALTER TABLE {} ADD COLUMN IF NOT EXISTS {} {}",
                             quote(&target),
                             quote(&column.name),
                             sql_type(&column.ty)
                         );
                         conn.execute_batch(&add).map_err(fatal)?;
                         if let Some(prev) = &previous
                             && let Some(old) = prev.column(&column.name)
-                            && old.ty != column.ty
+                            && old.ty == /* ~ changed by cargo-mutants ~ */ column.ty
                         {
                             let widen = format!(
                                 "ALTER TABLE {} ALTER COLUMN {} SET DATA TYPE {}",
                                 quote(&target),
                                 quote(&column.name),
                                 sql_type(&column.ty)
                             );
                             conn.execute_batch(&widen).map_err(fatal)?;
