--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace <impl LoadSession for DuckDbSession>::write -> Result<(), DestError> with Ok(())
@@ -279,26 +279,17 @@
                 Ok(())
             })?;
         }
         self.tables.insert(table, (schema.clone(), mode.clone()));
         Ok(())
     }
 
     async fn write(&mut self, table: &TableName, batch: RecordBatch) -> Result<(), DestError> {
-        crash_point!("duck.append");
-        let stage = stage_name(table);
-        self.with_conn(move |conn| {
-            let mut appender = conn.appender(&stage).map_err(fatal)?;
-            appender.append_record_batch(batch).map_err(fatal)?;
-            // Appender drop swallows errors; flush explicitly so failures surface
-            // as DestError instead of silently losing staged rows.
-            appender.flush().map_err(fatal)?;
-            Ok(())
-        })
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn commit(&mut self, meta: CommitMeta) -> Result<CommitReceipt, DestError> {
         crash_point!("duck.tx.commit");
         // Replace bookkeeping is per load.
         if self.last_replace_load.as_ref() != Some(&meta.load_id) {
             self.replaced.clear();
             self.last_replace_load = Some(meta.load_id.clone());
