--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace <impl LoadSession for DuckDbSession>::commit -> Result<CommitReceipt, DestError> with Ok(Default::default())
@@ -292,137 +292,17 @@
             // Appender drop swallows errors; flush explicitly so failures surface
             // as DestError instead of silently losing staged rows.
             appender.flush().map_err(fatal)?;
             Ok(())
         })
     }
 
     async fn commit(&mut self, meta: CommitMeta) -> Result<CommitReceipt, DestError> {
-        crash_point!("duck.tx.commit");
-        // Replace bookkeeping is per load.
-        if self.last_replace_load.as_ref() != Some(&meta.load_id) {
-            self.replaced.clear();
-            self.last_replace_load = Some(meta.load_id.clone());
-        }
-
-        let receipt = CommitReceipt {
-            load_id: meta.load_id.clone(),
-            commit_seq: meta.commit_seq,
-        };
-        let tables = self.tables.clone();
-        let roots: BTreeMap<TableName, TableName> = tables
-            .keys()
-            .map(|t| (t.clone(), self.root_of(t)))
-            .collect();
-        let mut replaced = std::mem::take(&mut self.replaced);
-        let state_json = serde_json::to_string(&meta.state).map_err(fatal)?;
-
-        let result = self.with_conn(move |conn| {
-            let tx = conn.transaction().map_err(fatal)?;
-            // Clause D3: idempotence by (load_id, commit_seq).
-            let already: u64 = tx
-                .query_row(
-                    "SELECT count(*) FROM _rdlt_commits WHERE load_id = ? AND commit_seq = ?",
-                    duckdb::params![meta.load_id.as_str(), meta.commit_seq as i64],
-                    |row| row.get(0),
-                )
-                .map_err(fatal)?;
-            if already > 0 {
-                // Prior receipt: publish nothing, discard the staged span.
-                for table in tables.keys() {
-                    tx.execute_batch(&format!("DELETE FROM {}", quote(&stage_name(table))))
-                        .map_err(fatal)?;
-                }
-                tx.commit().map_err(fatal)?;
-                return Ok((replaced, true));
-            }
-
-            for (table, (schema, mode)) in &tables {
-                let target = quote(table.as_str());
-                let stage = quote(&stage_name(table));
-                // Publishes are ALWAYS by name: the persistent target's column order
-                // is historical while the temp stage uses this run's order, so a
-                // positional `SELECT *` corrupts or breaks on drift (finding #4).
-                let cols = column_list(schema);
-                match mode {
-                    WriteMode::Append => {
-                        tx.execute_batch(&format!(
-                            "INSERT INTO {target} ({cols}) SELECT {cols} FROM {stage}"
-                        ))
-                        .map_err(fatal)?;
-                    }
-                    WriteMode::Replace => {
-                        if replaced.insert(table.clone()) {
-                            tx.execute_batch(&format!("DELETE FROM {target}"))
-                                .map_err(fatal)?;
-                        }
-                        tx.execute_batch(&format!(
-                            "INSERT INTO {target} ({cols}) SELECT {cols} FROM {stage}"
-                        ))
-                        .map_err(fatal)?;
-                    }
-                    WriteMode::Merge { .. } => {
-                        let root = &roots[table];
-                        let root_stage = quote(&stage_name(root));
-                        let id_col = if table == root {
-                            system_columns::ID
-                        } else {
-                            system_columns::ROOT_ID
-                        };
-                        // Subtree replacement by root id (design doc §5.4), then
-                        // insert with DETERMINISTIC in-batch dedup: rowid reflects
-                        // append order in the stage, so "last wins" is real
-                        // (finding #7 — no ORDER BY meant "arbitrary wins").
-                        tx.execute_batch(&format!(
-                            "DELETE FROM {target} WHERE {} IN \
-                             (SELECT {} FROM {root_stage})",
-                            quote(id_col),
-                            quote(system_columns::ID),
-                        ))
-                        .map_err(fatal)?;
-                        tx.execute_batch(&format!(
-                            "INSERT INTO {target} ({cols}) SELECT {cols} FROM {stage} \
-                             QUALIFY row_number() OVER \
-                             (PARTITION BY {} ORDER BY rowid DESC) = 1",
-                            quote(system_columns::ID),
-                        ))
-                        .map_err(fatal)?;
-                    }
-                }
-            }
-            // Truncate stages only after ALL tables published: child-table merges
-            // read the ROOT's stage for their delete-by-root-id subquery.
-            for table in tables.keys() {
-                tx.execute_batch(&format!("DELETE FROM {}", quote(&stage_name(table))))
-                    .map_err(fatal)?;
-            }
-
-            // Clause D2: state persists in the SAME transaction as the data.
-            tx.execute(
-                "INSERT OR REPLACE INTO _rdlt_state VALUES (?, ?)",
-                duckdb::params![meta.state.pipeline.as_str(), state_json],
-            )
-            .map_err(fatal)?;
-            tx.execute(
-                "INSERT INTO _rdlt_commits VALUES (?, ?)",
-                duckdb::params![meta.load_id.as_str(), meta.commit_seq as i64],
-            )
-            .map_err(fatal)?;
-            tx.commit().map_err(fatal)?;
-            Ok((replaced, false))
-        });
-
-        match result {
-            Ok((replaced, _idempotent_hit)) => {
-                self.replaced = replaced;
-                Ok(receipt)
-            }
-            Err(e) => Err(e),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn read_state(&mut self, pipeline: &PipelineId) -> Result<Option<StateDoc>, DestError> {
         let pipeline = pipeline.as_str().to_owned();
         self.with_conn(move |conn| {
             let doc: Option<String> = conn
                 .query_row(
                     "SELECT doc FROM _rdlt_state WHERE pipeline = ?",
