--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace != with == in <impl LoadSession for DuckDbSession>::commit
@@ -294,17 +294,17 @@
             appender.flush().map_err(fatal)?;
             Ok(())
         })
     }
 
     async fn commit(&mut self, meta: CommitMeta) -> Result<CommitReceipt, DestError> {
         crash_point!("duck.tx.commit");
         // Replace bookkeeping is per load.
-        if self.last_replace_load.as_ref() != Some(&meta.load_id) {
+        if self.last_replace_load.as_ref() == /* ~ changed by cargo-mutants ~ */ Some(&meta.load_id) {
             self.replaced.clear();
             self.last_replace_load = Some(meta.load_id.clone());
         }
 
         let receipt = CommitReceipt {
             load_id: meta.load_id.clone(),
             commit_seq: meta.commit_seq,
         };
