--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace <impl LoadSession for DuckDbSession>::read_state -> Result<Option<StateDoc>, DestError> with Ok(Some(Default::default()))
@@ -416,28 +416,11 @@
                 self.replaced = replaced;
                 Ok(receipt)
             }
             Err(e) => Err(e),
         }
     }
 
     async fn read_state(&mut self, pipeline: &PipelineId) -> Result<Option<StateDoc>, DestError> {
-        let pipeline = pipeline.as_str().to_owned();
-        self.with_conn(move |conn| {
-            let doc: Option<String> = conn
-                .query_row(
-                    "SELECT doc FROM _rdlt_state WHERE pipeline = ?",
-                    duckdb::params![pipeline],
-                    |row| row.get(0),
-                )
-                .map(Some)
-                .or_else(|e| match e {
-                    duckdb::Error::QueryReturnedNoRows => Ok(None),
-                    other => Err(fatal(other)),
-                })?;
-            match doc {
-                Some(json) => Ok(Some(serde_json::from_str(&json).map_err(fatal)?)),
-                None => Ok(None),
-            }
-        })
+        Ok(Some(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }
