--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace DuckDb::clone_conn -> Result<Connection, DestError> with Ok(Default::default())
@@ -44,18 +44,17 @@
     pub fn open(path: impl Into<PathBuf>) -> Result<Self, DestError> {
         let conn = Connection::open(path.into()).map_err(fatal)?;
         Ok(Self {
             db: std::sync::Arc::new(Mutex::new(conn)),
         })
     }
 
     fn clone_conn(&self) -> Result<Connection, DestError> {
-        let guard = self.db.lock().map_err(|_| fatal("connection poisoned"))?;
-        guard.try_clone().map_err(fatal)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Test/inspection helper: count reader-visible rows.
     pub fn count_rows(&self, table: &str) -> Result<u64, DestError> {
         let conn = self.clone_conn()?;
         let count: u64 = conn
             .query_row(
                 &format!("SELECT count(*) FROM {}", quote(table)),
