--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace DuckDb::count_rows -> Result<u64, DestError> with Ok(1)
@@ -50,25 +50,17 @@
 
     fn clone_conn(&self) -> Result<Connection, DestError> {
         let guard = self.db.lock().map_err(|_| fatal("connection poisoned"))?;
         guard.try_clone().map_err(fatal)
     }
 
     /// Test/inspection helper: count reader-visible rows.
     pub fn count_rows(&self, table: &str) -> Result<u64, DestError> {
-        let conn = self.clone_conn()?;
-        let count: u64 = conn
-            .query_row(
-                &format!("SELECT count(*) FROM {}", quote(table)),
-                [],
-                |row| row.get(0),
-            )
-            .map_err(fatal)?;
-        Ok(count)
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Test/inspection helper: run a scalar query.
     pub fn query_string(&self, sql: &str) -> Result<String, DestError> {
         let conn = self.clone_conn()?;
         conn.query_row(sql, [], |row| row.get::<_, String>(0))
             .map_err(fatal)
     }
