--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace DuckDb::query_string -> Result<String, DestError> with Ok("xyzzy".into())
@@ -63,19 +63,17 @@
                 |row| row.get(0),
             )
             .map_err(fatal)?;
         Ok(count)
     }
 
     /// Test/inspection helper: run a scalar query.
     pub fn query_string(&self, sql: &str) -> Result<String, DestError> {
-        let conn = self.clone_conn()?;
-        conn.query_row(sql, [], |row| row.get::<_, String>(0))
-            .map_err(fatal)
+        Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn fatal(e: impl std::fmt::Display) -> DestError {
     DestError::fatal(e.to_string())
 }
 
 /// Crash-point injection (feature 003 R20). No-op without the `failpoints`
