--- crates/rdlt-dest-duckdb/src/lib.rs
+++ replace quote -> String with "xyzzy".into()
@@ -89,17 +89,17 @@
     };
 }
 
 #[cfg(feature = "failpoints")]
 #[doc(hidden)]
 pub const FAIL_POINTS: &[&str] = &["duck.append", "duck.tx.commit"];
 
 fn quote(ident: &str) -> String {
-    format!("\"{}\"", ident.replace('"', "\"\""))
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn stage_name(table: &TableName) -> String {
     // Hashed: bounded length regardless of table-name length, collision-safe.
     format!(
         "_rdlt_stage_{}",
         rdlt_connector::core::naming::ident_hash(table.as_str(), 16)
     )
