--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace read_json -> Result<Option<T>, DestError> with Ok(None)
@@ -100,21 +100,17 @@
     std::fs::rename(&tmp, path).map_err(fatal)?;
     if let Some(parent) = path.parent() {
         fsync_dir(parent)?;
     }
     Ok(())
 }
 
 fn read_json<T: for<'de> Deserialize<'de>>(path: &Path) -> Result<Option<T>, DestError> {
-    match std::fs::read(path) {
-        Ok(bytes) => Ok(Some(serde_json::from_slice(&bytes).map_err(fatal)?)),
-        Err(e) if e.kind() == std::io::ErrorKind::NotFound => Ok(None),
-        Err(e) => Err(fatal(e)),
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Debug, Clone)]
 pub struct ParquetDir {
     out: PathBuf,
 }
 
 impl ParquetDir {
