--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace match guard e.kind() == std::io::ErrorKind::NotFound with true in read_json
@@ -102,17 +102,17 @@
         fsync_dir(parent)?;
     }
     Ok(())
 }
 
 fn read_json<T: for<'de> Deserialize<'de>>(path: &Path) -> Result<Option<T>, DestError> {
     match std::fs::read(path) {
         Ok(bytes) => Ok(Some(serde_json::from_slice(&bytes).map_err(fatal)?)),
-        Err(e) if e.kind() == std::io::ErrorKind::NotFound => Ok(None),
+        Err(e) if true /* ~ changed by cargo-mutants ~ */ => Ok(None),
         Err(e) => Err(fatal(e)),
     }
 }
 
 #[derive(Debug, Clone)]
 pub struct ParquetDir {
     out: PathBuf,
 }
