--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace == with != in ParquetDir::count_rows
@@ -127,17 +127,17 @@
 
     /// Test/inspection helper: total published rows of a table (parquet footers).
     pub fn count_rows(&self, table: &str) -> Result<u64, DestError> {
         use parquet::file::reader::{FileReader, SerializedFileReader};
         let dir = self.out.join(table);
         let mut total = 0u64;
         let entries = match std::fs::read_dir(&dir) {
             Ok(entries) => entries,
-            Err(e) if e.kind() == std::io::ErrorKind::NotFound => return Ok(0),
+            Err(e) if e.kind() != /* ~ changed by cargo-mutants ~ */ std::io::ErrorKind::NotFound => return Ok(0),
             Err(e) => return Err(fatal(e)),
         };
         for entry in entries {
             let path = entry.map_err(fatal)?.path();
             if path.extension().is_some_and(|e| e == "parquet") {
                 let file = std::fs::File::open(&path).map_err(fatal)?;
                 let reader = SerializedFileReader::new(file).map_err(fatal)?;
                 total += reader.metadata().file_metadata().num_rows() as u64;
