--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace == with != in ParquetDir::count_rows
@@ -132,17 +132,17 @@
         let mut total = 0u64;
         let entries = match std::fs::read_dir(&dir) {
             Ok(entries) => entries,
             Err(e) if e.kind() == std::io::ErrorKind::NotFound => return Ok(0),
             Err(e) => return Err(fatal(e)),
         };
         for entry in entries {
             let path = entry.map_err(fatal)?.path();
-            if path.extension().is_some_and(|e| e == "parquet") {
+            if path.extension().is_some_and(|e| e != /* ~ changed by cargo-mutants ~ */ "parquet") {
                 let file = std::fs::File::open(&path).map_err(fatal)?;
                 let reader = SerializedFileReader::new(file).map_err(fatal)?;
                 total += reader.metadata().file_metadata().num_rows() as u64;
             }
         }
         Ok(total)
     }
 }
