--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace += with *= in ParquetDir::count_rows
@@ -135,17 +135,17 @@
             Err(e) if e.kind() == std::io::ErrorKind::NotFound => return Ok(0),
             Err(e) => return Err(fatal(e)),
         };
         for entry in entries {
             let path = entry.map_err(fatal)?.path();
             if path.extension().is_some_and(|e| e == "parquet") {
                 let file = std::fs::File::open(&path).map_err(fatal)?;
                 let reader = SerializedFileReader::new(file).map_err(fatal)?;
-                total += reader.metadata().file_metadata().num_rows() as u64;
+                total *= /* ~ changed by cargo-mutants ~ */ reader.metadata().file_metadata().num_rows() as u64;
             }
         }
         Ok(total)
     }
 }
 
 #[async_trait]
 impl Destination for ParquetDir {
