--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace <impl Destination for ParquetDir>::spec -> ConnectorSpec with Default::default()
@@ -145,17 +145,17 @@
         }
         Ok(total)
     }
 }
 
 #[async_trait]
 impl Destination for ParquetDir {
     fn spec(&self) -> ConnectorSpec {
-        ConnectorSpec::new("parquet-dir", env!("CARGO_PKG_VERSION"))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn capabilities(&self) -> DestCapabilities {
         DestCapabilities {
             merge: false, // write-only destination; no per-row identity semantics
             structs: true,
             scalar_lists: true,
             json_type: false,
