--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace <impl Destination for ParquetDir>::capabilities -> DestCapabilities with Default::default()
@@ -149,24 +149,17 @@
 
 #[async_trait]
 impl Destination for ParquetDir {
     fn spec(&self) -> ConnectorSpec {
         ConnectorSpec::new("parquet-dir", env!("CARGO_PKG_VERSION"))
     }
 
     fn capabilities(&self) -> DestCapabilities {
-        DestCapabilities {
-            merge: false, // write-only destination; no per-row identity semantics
-            structs: true,
-            scalar_lists: true,
-            json_type: false,
-            decimal: true,
-            ident_rules: IdentRules::default(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     async fn open(&self, ctx: OpenCtx) -> Result<Box<dyn LoadSession>, DestError> {
         let scope = pipeline_scope(&ctx.pipeline);
         // Clause D4: staged data from THIS PIPELINE's dead sessions becomes
         // invisible/reclaimable. Scoped — another pipeline sharing this output
         // directory keeps its live staged data (the same rule the Postgres
         // destination applies to its stage tables).
