--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace <impl LoadSession for ParquetSession>::ensure_table -> Result<(), DestError> with Ok(())
@@ -199,25 +199,17 @@
 
 #[async_trait]
 impl LoadSession for ParquetSession {
     async fn ensure_table(
         &mut self,
         schema: &TableSchema,
         mode: &WriteMode,
     ) -> Result<(), DestError> {
-        if matches!(mode, WriteMode::Merge { .. }) {
-            return Err(fatal(
-                "parquet destination does not support Merge (capabilities.merge = false)",
-            ));
-        }
-        std::fs::create_dir_all(self.out.join(schema.table.as_str())).map_err(fatal)?;
-        self.tables
-            .insert(schema.table.clone(), (schema.clone(), mode.clone()));
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn write(&mut self, table: &TableName, batch: RecordBatch) -> Result<(), DestError> {
         if !self.tables.contains_key(table) {
             return Err(fatal(format!(
                 "write before ensure_table for `{table}` (clause E1)"
             )));
         }
