--- crates/rdlt-dest-parquet/src/lib.rs
+++ delete ! in <impl LoadSession for ParquetSession>::write
@@ -211,17 +211,17 @@
         }
         std::fs::create_dir_all(self.out.join(schema.table.as_str())).map_err(fatal)?;
         self.tables
             .insert(schema.table.clone(), (schema.clone(), mode.clone()));
         Ok(())
     }
 
     async fn write(&mut self, table: &TableName, batch: RecordBatch) -> Result<(), DestError> {
-        if !self.tables.contains_key(table) {
+        if  /* ~ changed by cargo-mutants ~ */self.tables.contains_key(table) {
             return Err(fatal(format!(
                 "write before ensure_table for `{table}` (clause E1)"
             )));
         }
         // Staged name is deterministic per (table, per-table write index); the FINAL
         // name is assigned at commit (needs commit_seq). Per-table writes arrive in
         // order (clause E1), so recovery replay reproduces both (research R18).
         let n = self.staged.iter().filter(|(t, _)| t == table).count();
