--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace <impl LoadSession for ParquetSession>::write -> Result<(), DestError> with Ok(())
@@ -211,35 +211,17 @@
         }
         std::fs::create_dir_all(self.out.join(schema.table.as_str())).map_err(fatal)?;
         self.tables
             .insert(schema.table.clone(), (schema.clone(), mode.clone()));
         Ok(())
     }
 
     async fn write(&mut self, table: &TableName, batch: RecordBatch) -> Result<(), DestError> {
-        if !self.tables.contains_key(table) {
-            return Err(fatal(format!(
-                "write before ensure_table for `{table}` (clause E1)"
-            )));
-        }
-        // Staged name is deterministic per (table, per-table write index); the FINAL
-        // name is assigned at commit (needs commit_seq). Per-table writes arrive in
-        // order (clause E1), so recovery replay reproduces both (research R18).
-        let n = self.staged.iter().filter(|(t, _)| t == table).count();
-        let name = format!("{}-{}-{n}.parquet", self.load_id, table);
-        let path = self.staging.join(&name);
-        let file = std::fs::File::create(&path).map_err(fatal)?;
-        let mut writer =
-            ArrowWriter::try_new(file, Arc::clone(&batch.schema()), None).map_err(fatal)?;
-        writer.write(&batch).map_err(fatal)?;
-        let file = writer.close().map_err(fatal).map(|_| ())?;
-        let _ = file;
-        self.staged.push((table.clone(), name));
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn commit(&mut self, meta: CommitMeta) -> Result<CommitReceipt, DestError> {
         let receipt = CommitReceipt {
             load_id: meta.load_id.clone(),
             commit_seq: meta.commit_seq,
         };
         let commits_path = self.out.join(commits_file(&self.scope));
