--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace <impl LoadSession for ParquetSession>::commit -> Result<CommitReceipt, DestError> with Ok(Default::default())
@@ -233,99 +233,17 @@
         writer.write(&batch).map_err(fatal)?;
         let file = writer.close().map_err(fatal).map(|_| ())?;
         let _ = file;
         self.staged.push((table.clone(), name));
         Ok(())
     }
 
     async fn commit(&mut self, meta: CommitMeta) -> Result<CommitReceipt, DestError> {
-        let receipt = CommitReceipt {
-            load_id: meta.load_id.clone(),
-            commit_seq: meta.commit_seq,
-        };
-        let commits_path = self.out.join(commits_file(&self.scope));
-        let mut log: CommitLog = read_json(&commits_path)?.unwrap_or_default();
-        let key = (meta.load_id.as_str().to_owned(), meta.commit_seq);
-
-        // Clause D3: idempotent per (load_id, commit_seq) — discard staged, return
-        // the prior receipt.
-        if log.receipts.contains(&key) {
-            for (_, name) in self.staged.drain(..) {
-                let _ = std::fs::remove_file(self.staging.join(name));
-            }
-            return Ok(receipt);
-        }
-
-        // Replace: clear each replace-mode table's data files once per load. The
-        // guard is DURABLE — "has any earlier commit of THIS load landed?" comes
-        // from the receipt log, not session memory, so a crash-recovery session
-        // (fresh state, same load_id) never re-truncates files that a prior commit
-        // of this load already published. If no receipt landed, re-truncating is
-        // convergent: WAL replay re-delivers everything since the last committed
-        // checkpoint.
-        let load_committed_before = log
-            .receipts
-            .iter()
-            .any(|(load, _)| load == meta.load_id.as_str());
-        if !load_committed_before {
-            crash_point!("pq.replace.truncate");
-            for (table, (_, mode)) in &self.tables {
-                if matches!(mode, WriteMode::Replace) {
-                    let dir = self.out.join(table.as_str());
-                    if let Ok(entries) = std::fs::read_dir(&dir) {
-                        for entry in entries.flatten() {
-                            let path = entry.path();
-                            if path.extension().is_some_and(|e| e == "parquet") {
-                                std::fs::remove_file(path).map_err(fatal)?;
-                            }
-                        }
-                    }
-                }
-            }
-        }
-
-        // Publish: rename staged files to their deterministic final names —
-        // (load_id, commit_seq, n) with n counted PER TABLE, inside the table's own
-        // directory. Cross-table arrival order (concurrent streams) cannot change a
-        // name, so a mid-commit crash re-runs this with identical names,
-        // overwriting idempotently (research R18).
-        let mut per_table: BTreeMap<&TableName, u64> = BTreeMap::new();
-        for (table, staged_name) in &self.staged {
-            let n = per_table.entry(table).or_insert(0);
-            let final_name = format!(
-                "part-{}-{}-{n}.parquet",
-                meta.load_id.as_str(),
-                meta.commit_seq
-            );
-            *n += 1;
-            let from = self.staging.join(staged_name);
-            let to = self.out.join(table.as_str()).join(final_name);
-            crash_point!("pq.staged.sync");
-            let file = std::fs::File::open(&from).map_err(fatal)?;
-            file.sync_all().map_err(fatal)?;
-            crash_point!("pq.part.rename");
-            std::fs::rename(&from, &to).map_err(fatal)?;
-        }
-        // Renames are only durable once their directories are — fsync each touched
-        // table dir before the receipt claims the commit happened (clause D2).
-        crash_point!("pq.dir.fsync");
-        for table in per_table.keys() {
-            fsync_dir(&self.out.join(table.as_str()))?;
-        }
-        self.staged.clear();
-
-        // State + receipt land last (write-temp + fsync + rename each).
-        crash_point!("pq.state.write");
-        write_json_atomic(&self.out.join(state_file(&self.scope)), &meta.state)?;
-        log.format_version = LAYOUT_FORMAT_VERSION;
-        log.receipts.push(key);
-        crash_point!("pq.receipt.write");
-        write_json_atomic(&commits_path, &log)?;
-        Ok(receipt)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn read_state(&mut self, pipeline: &PipelineId) -> Result<Option<StateDoc>, DestError> {
         let path = self.out.join(state_file(&pipeline_scope(pipeline)));
         let state: Option<StateDoc> = read_json(&path)?;
         Ok(state.filter(|s| &s.pipeline == pipeline))
     }
 }
