--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace += with -= in <impl LoadSession for ParquetSession>::commit
@@ -291,17 +291,17 @@
         let mut per_table: BTreeMap<&TableName, u64> = BTreeMap::new();
         for (table, staged_name) in &self.staged {
             let n = per_table.entry(table).or_insert(0);
             let final_name = format!(
                 "part-{}-{}-{n}.parquet",
                 meta.load_id.as_str(),
                 meta.commit_seq
             );
-            *n += 1;
+            *n -= /* ~ changed by cargo-mutants ~ */ 1;
             let from = self.staging.join(staged_name);
             let to = self.out.join(table.as_str()).join(final_name);
             crash_point!("pq.staged.sync");
             let file = std::fs::File::open(&from).map_err(fatal)?;
             file.sync_all().map_err(fatal)?;
             crash_point!("pq.part.rename");
             std::fs::rename(&from, &to).map_err(fatal)?;
         }
