--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace == with != in <impl LoadSession for ParquetSession>::read_state
@@ -321,11 +321,11 @@
         crash_point!("pq.receipt.write");
         write_json_atomic(&commits_path, &log)?;
         Ok(receipt)
     }
 
     async fn read_state(&mut self, pipeline: &PipelineId) -> Result<Option<StateDoc>, DestError> {
         let path = self.out.join(state_file(&pipeline_scope(pipeline)));
         let state: Option<StateDoc> = read_json(&path)?;
-        Ok(state.filter(|s| &s.pipeline == pipeline))
+        Ok(state.filter(|s| &s.pipeline != /* ~ changed by cargo-mutants ~ */ pipeline))
     }
 }
