--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace pipeline_scope -> String with String::new()
@@ -55,17 +55,17 @@
     "pq.part.rename",
     "pq.dir.fsync",
     "pq.state.write",
     "pq.receipt.write",
 ];
 
 /// Short stable scope key for one pipeline's files inside a shared output dir.
 fn pipeline_scope(pipeline: &PipelineId) -> String {
-    ident_hash(pipeline.as_str(), 12)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn state_file(scope: &str) -> String {
     format!("_rdlt_state.{scope}.json")
 }
 
 fn commits_file(scope: &str) -> String {
     format!("_rdlt_commits.{scope}.json")
