--- crates/rdlt-dest-parquet/src/lib.rs
+++ replace write_json_atomic -> Result<(), DestError> with Ok(())
@@ -85,28 +85,17 @@
         .and_then(|f| f.sync_all())
         .map_err(fatal)
 }
 
 /// Atomic durable JSON rewrite: write-temp + fsync + rename + parent-dir fsync.
 /// The data-file path fsyncs before rename too — metadata must not be LESS durable
 /// than the parquet parts it describes (clause D2).
 fn write_json_atomic<T: Serialize>(path: &Path, value: &T) -> Result<(), DestError> {
-    use std::io::Write;
-    let tmp = path.with_extension("json.tmp");
-    let bytes = serde_json::to_vec_pretty(value).map_err(fatal)?;
-    let mut file = std::fs::File::create(&tmp).map_err(fatal)?;
-    file.write_all(&bytes).map_err(fatal)?;
-    file.sync_all().map_err(fatal)?;
-    drop(file);
-    std::fs::rename(&tmp, path).map_err(fatal)?;
-    if let Some(parent) = path.parent() {
-        fsync_dir(parent)?;
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn read_json<T: for<'de> Deserialize<'de>>(path: &Path) -> Result<Option<T>, DestError> {
     match std::fs::read(path) {
         Ok(bytes) => Ok(Some(serde_json::from_slice(&bytes).map_err(fatal)?)),
         Err(e) if e.kind() == std::io::ErrorKind::NotFound => Ok(None),
         Err(e) => Err(fatal(e)),
     }
