--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace sql_type -> &'static str with "xyzzy"
@@ -100,34 +100,17 @@
         .iter()
         .map(|c| quote(&c.name))
         .collect::<Vec<_>>()
         .join(", ")
 }
 
 /// Postgres SQL type per (already lowered) column type.
 fn sql_type(ty: &ColumnType) -> &'static str {
-    match ty {
-        ColumnType::Scalar { scalar } => match scalar {
-            LogicalType::Bool => "BOOLEAN",
-            LogicalType::Int64 => "BIGINT",
-            LogicalType::Float64 => "DOUBLE PRECISION",
-            LogicalType::Utf8 | LogicalType::Uuid => "TEXT",
-            LogicalType::Json => "TEXT", // engine ships Json as text; JSONB is follow-up
-            LogicalType::Binary => "BYTEA",
-            LogicalType::TimestampTz => "TIMESTAMPTZ",
-            LogicalType::TimestampNaive => "TIMESTAMP",
-            LogicalType::Date => "DATE",
-            LogicalType::Time => "TIME",
-            // decimal: false — the engine lowers decimals to text before we see them.
-            LogicalType::Decimal { .. } => "TEXT",
-        },
-        // structs/lists never reach a structless destination (engine-lowered).
-        ColumnType::Struct { .. } | ColumnType::ScalarList { .. } => "TEXT",
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 /// Postgres wire type for binary COPY, per arrow column type.
 fn copy_type(dt: &DataType) -> Result<Type, DestError> {
     Ok(match dt {
         DataType::Boolean => Type::BOOL,
         DataType::Int64 => Type::INT8,
         DataType::Float64 => Type::FLOAT8,
