--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace copy_type -> Result<Type, DestError> with Ok(Default::default())
@@ -122,27 +122,17 @@
         },
         // structs/lists never reach a structless destination (engine-lowered).
         ColumnType::Struct { .. } | ColumnType::ScalarList { .. } => "TEXT",
     }
 }
 
 /// Postgres wire type for binary COPY, per arrow column type.
 fn copy_type(dt: &DataType) -> Result<Type, DestError> {
-    Ok(match dt {
-        DataType::Boolean => Type::BOOL,
-        DataType::Int64 => Type::INT8,
-        DataType::Float64 => Type::FLOAT8,
-        DataType::Utf8 => Type::TEXT,
-        DataType::Binary => Type::BYTEA,
-        DataType::Timestamp(TimeUnit::Microsecond, Some(_)) => Type::TIMESTAMPTZ,
-        DataType::Timestamp(TimeUnit::Microsecond, None) => Type::TIMESTAMP,
-        DataType::Date32 => Type::DATE,
-        other => return Err(fatal(format!("unsupported arrow type for COPY: {other}"))),
-    })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[async_trait]
 impl Destination for Postgres {
     fn spec(&self) -> ConnectorSpec {
         ConnectorSpec::new("postgres", env!("CARGO_PKG_VERSION"))
     }
 
