--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace <impl Destination for Postgres>::capabilities -> DestCapabilities with Default::default()
@@ -142,24 +142,17 @@
 
 #[async_trait]
 impl Destination for Postgres {
     fn spec(&self) -> ConnectorSpec {
         ConnectorSpec::new("postgres", env!("CARGO_PKG_VERSION"))
     }
 
     fn capabilities(&self) -> DestCapabilities {
-        DestCapabilities {
-            merge: true,
-            structs: false,      // → engine flattens collision-safely at the seam
-            scalar_lists: false, // → scalar lists become child tables at shred planning
-            json_type: false,
-            decimal: false, // → engine lowers decimals to canonical text
-            ident_rules: IdentRules { max_len: 63 },
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     async fn open(&self, _ctx: OpenCtx) -> Result<Box<dyn LoadSession>, DestError> {
         let client = self.client().await?;
         let schema = quote(&self.schema);
         client
             .batch_execute(&format!(
                 "CREATE SCHEMA IF NOT EXISTS {schema};
