--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace <impl LoadSession for PgSession>::ensure_table -> Result<(), DestError> with Ok(())
@@ -230,71 +230,17 @@
 
 #[async_trait]
 impl LoadSession for PgSession {
     async fn ensure_table(
         &mut self,
         schema: &TableSchema,
         mode: &WriteMode,
     ) -> Result<(), DestError> {
-        let previous = self.tables.get(&schema.table).map(|(s, _)| s.clone());
-        for (name, is_stage) in [
-            (schema.table.as_str().to_owned(), false),
-            (stage_name(&self.pipeline, &schema.table), true),
-        ] {
-            let mut columns = schema
-                .columns
-                .iter()
-                .map(|c| format!("{} {}", quote(&c.name), sql_type(&c.ty)))
-                .collect::<Vec<_>>()
-                .join(", ");
-            if is_stage {
-                // Arrival order for deterministic merge dedup (finding #7).
-                columns.push_str(&format!(", {} BIGSERIAL", quote(ARRIVAL_COL)));
-            }
-            let unlogged = if is_stage { "UNLOGGED " } else { "" };
-            self.client
-                .batch_execute(&format!(
-                    "CREATE {unlogged}TABLE IF NOT EXISTS {} ({columns})",
-                    quote(&name)
-                ))
-                .await
-                .map_err(transient)?;
-            // Migrations (clause D5): add new columns; widen with a USING cast.
-            for column in &schema.columns {
-                self.client
-                    .batch_execute(&format!(
-                        "ALTER TABLE {} ADD COLUMN IF NOT EXISTS {} {}",
-                        quote(&name),
-                        quote(&column.name),
-                        sql_type(&column.ty)
-                    ))
-                    .await
-                    .map_err(transient)?;
-                if let Some(prev) = &previous
-                    && let Some(old) = prev.column(&column.name)
-                    && old.ty != column.ty
-                {
-                    self.client
-                        .batch_execute(&format!(
-                            "ALTER TABLE {} ALTER COLUMN {} TYPE {} USING {}::{}",
-                            quote(&name),
-                            quote(&column.name),
-                            sql_type(&column.ty),
-                            quote(&column.name),
-                            sql_type(&column.ty)
-                        ))
-                        .await
-                        .map_err(transient)?;
-                }
-            }
-        }
-        self.tables
-            .insert(schema.table.clone(), (schema.clone(), mode.clone()));
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn write(&mut self, table: &TableName, batch: RecordBatch) -> Result<(), DestError> {
         let stage = stage_name(&self.pipeline, table);
         let arrow_schema = batch.schema();
         let column_names = arrow_schema
             .fields()
             .iter()
