--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace && with || in <impl LoadSession for PgSession>::ensure_table
@@ -265,17 +265,17 @@
                         "ALTER TABLE {} ADD COLUMN IF NOT EXISTS {} {}",
                         quote(&name),
                         quote(&column.name),
                         sql_type(&column.ty)
                     ))
                     .await
                     .map_err(transient)?;
                 if let Some(prev) = &previous
-                    && let Some(old) = prev.column(&column.name)
+                    || /* ~ changed by cargo-mutants ~ */ let Some(old) = prev.column(&column.name)
                     && old.ty != column.ty
                 {
                     self.client
                         .batch_execute(&format!(
                             "ALTER TABLE {} ALTER COLUMN {} TYPE {} USING {}::{}",
                             quote(&name),
                             quote(&column.name),
                             sql_type(&column.ty),
