--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace <impl LoadSession for PgSession>::write -> Result<(), DestError> with Ok(())
@@ -288,56 +288,17 @@
             }
         }
         self.tables
             .insert(schema.table.clone(), (schema.clone(), mode.clone()));
         Ok(())
     }
 
     async fn write(&mut self, table: &TableName, batch: RecordBatch) -> Result<(), DestError> {
-        let stage = stage_name(&self.pipeline, table);
-        let arrow_schema = batch.schema();
-        let column_names = arrow_schema
-            .fields()
-            .iter()
-            .map(|f| quote(f.name()))
-            .collect::<Vec<_>>()
-            .join(", ");
-        let types: Vec<Type> = arrow_schema
-            .fields()
-            .iter()
-            .map(|f| copy_type(f.data_type()))
-            .collect::<Result<_, _>>()?;
-
-        let sink = self
-            .client
-            .copy_in(&format!(
-                "COPY {} ({column_names}) FROM STDIN BINARY",
-                quote(&stage)
-            ))
-            .await
-            .map_err(transient)?;
-        let writer = BinaryCopyInWriter::new(sink, &types);
-        futures::pin_mut!(writer);
-
-        for row_idx in 0..batch.num_rows() {
-            let mut owned: Vec<Box<dyn ToSql + Sync + Send>> =
-                Vec::with_capacity(batch.num_columns());
-            for (col_idx, field) in arrow_schema.fields().iter().enumerate() {
-                let array = batch.column(col_idx);
-                owned.push(cell_value(field.data_type(), array.as_ref(), row_idx)?);
-            }
-            let refs: Vec<&(dyn ToSql + Sync)> = owned
-                .iter()
-                .map(|b| b.as_ref() as &(dyn ToSql + Sync))
-                .collect();
-            writer.as_mut().write(&refs).await.map_err(transient)?;
-        }
-        writer.finish().await.map_err(transient)?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn commit(&mut self, meta: CommitMeta) -> Result<CommitReceipt, DestError> {
         if self.last_replace_load.as_ref() != Some(&meta.load_id) {
             self.replaced.clear();
             self.last_replace_load = Some(meta.load_id.clone());
         }
         let receipt = CommitReceipt {
