--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace > with < in <impl LoadSession for PgSession>::commit
@@ -355,17 +355,17 @@
         let already = tx
             .query_one(
                 "SELECT count(*) FROM _rdlt_commits WHERE load_id = $1 AND commit_seq = $2",
                 &[&meta.load_id.as_str(), &(meta.commit_seq as i64)],
             )
             .await
             .map_err(transient)?
             .get::<_, i64>(0);
-        if already > 0 {
+        if already < /* ~ changed by cargo-mutants ~ */ 0 {
             for table in self.tables.keys() {
                 tx.batch_execute(&format!(
                     "TRUNCATE TABLE {}",
                     quote(&stage_name(&self.pipeline, table))
                 ))
                 .await
                 .map_err(transient)?;
             }
