--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace Postgres::connect -> Self with Default::default()
@@ -29,20 +29,17 @@
 pub struct Postgres {
     conn_string: String,
     schema: String,
 }
 
 impl Postgres {
     /// `conn_string`: e.g. `host=localhost user=postgres password=pw dbname=raw`.
     pub fn connect(conn_string: impl Into<String>) -> Self {
-        Self {
-            conn_string: conn_string.into(),
-            schema: "public".into(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Target schema (dataset); created if missing.
     pub fn dataset(mut self, schema: impl Into<String>) -> Self {
         self.schema = schema.into();
         self
     }
 
