--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace Postgres::dataset -> Self with Default::default()
@@ -37,18 +37,17 @@
         Self {
             conn_string: conn_string.into(),
             schema: "public".into(),
         }
     }
 
     /// Target schema (dataset); created if missing.
     pub fn dataset(mut self, schema: impl Into<String>) -> Self {
-        self.schema = schema.into();
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     async fn client(&self) -> Result<Client, DestError> {
         let (client, connection) = tokio_postgres::connect(&self.conn_string, NoTls)
             .await
             .map_err(transient)?;
         tokio::spawn(async move {
             let _ = connection.await; // connection task ends with the client
