--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace <impl LoadSession for PgSession>::read_state -> Result<Option<StateDoc>, DestError> with Ok(None)
@@ -456,31 +456,17 @@
         )
         .await
         .map_err(transient)?;
         tx.commit().await.map_err(transient)?;
         Ok(receipt)
     }
 
     async fn read_state(&mut self, pipeline: &PipelineId) -> Result<Option<StateDoc>, DestError> {
-        let row = self
-            .client
-            .query_opt(
-                "SELECT doc FROM _rdlt_state WHERE pipeline = $1",
-                &[&pipeline.as_str()],
-            )
-            .await
-            .map_err(transient)?;
-        match row {
-            Some(row) => {
-                let doc: String = row.get(0);
-                Ok(Some(serde_json::from_str(&doc).map_err(fatal)?))
-            }
-            None => Ok(None),
-        }
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// One cell as an owned ToSql value for binary COPY.
 fn cell_value(
     dt: &DataType,
     array: &dyn Array,
     row: usize,
