--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace Postgres::client -> Result<Client, DestError> with Ok(Default::default())
@@ -42,23 +42,17 @@
 
     /// Target schema (dataset); created if missing.
     pub fn dataset(mut self, schema: impl Into<String>) -> Self {
         self.schema = schema.into();
         self
     }
 
     async fn client(&self) -> Result<Client, DestError> {
-        let (client, connection) = tokio_postgres::connect(&self.conn_string, NoTls)
-            .await
-            .map_err(transient)?;
-        tokio::spawn(async move {
-            let _ = connection.await; // connection task ends with the client
-        });
-        Ok(client)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn transient(e: impl std::fmt::Display) -> DestError {
     DestError::transient(e.to_string())
 }
 
 fn fatal(e: impl std::fmt::Display) -> DestError {
