--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace + with - in cell_value
@@ -531,15 +531,15 @@
                 chrono::DateTime::from_timestamp_micros(micros)
                     .ok_or_else(|| fatal("timestamp out of range"))?
                     .naive_utc(),
             )
         }
         DataType::Date32 => {
             let days = cast!(Date32Array).value(row);
             Box::new(
-                chrono::NaiveDate::from_num_days_from_ce_opt(days + 719_163)
+                chrono::NaiveDate::from_num_days_from_ce_opt(days - /* ~ changed by cargo-mutants ~ */ 719_163)
                     .ok_or_else(|| fatal("date out of range"))?,
             )
         }
         other => return Err(fatal(format!("unsupported arrow type for COPY: {other}"))),
     })
 }
