--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace transient -> DestError with Default::default()
@@ -53,17 +53,17 @@
         tokio::spawn(async move {
             let _ = connection.await; // connection task ends with the client
         });
         Ok(client)
     }
 }
 
 fn transient(e: impl std::fmt::Display) -> DestError {
-    DestError::transient(e.to_string())
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn fatal(e: impl std::fmt::Display) -> DestError {
     DestError::fatal(e.to_string())
 }
 
 fn quote(ident: &str) -> String {
     format!("\"{}\"", ident.replace('"', "\"\""))
