--- crates/rdlt-dest-postgres/src/lib.rs
+++ replace fatal -> DestError with Default::default()
@@ -57,17 +57,17 @@
     }
 }
 
 fn transient(e: impl std::fmt::Display) -> DestError {
     DestError::transient(e.to_string())
 }
 
 fn fatal(e: impl std::fmt::Display) -> DestError {
-    DestError::fatal(e.to_string())
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn quote(ident: &str) -> String {
     format!("\"{}\"", ident.replace('"', "\"\""))
 }
 
 /// Arrival-order column on STAGE tables only: makes merge dedup deterministic
 /// ("last wins" for real — finding #7). Excluded from publish column lists because it
