--- crates/rdlt-engine/src/lib.rs
+++ replace Engine::run -> Result<RunReport, RdltError> with Ok(Default::default())
@@ -123,18 +123,11 @@
     /// recovers identically (recovery invariant 4).
     pub fn cancellation_token(&self) -> CancellationToken {
         self.cancel.clone()
     }
 
     /// Run to completion (resumable, cancel-safe). Consumes the engine — a run is not
     /// restartable in place; construct a new one to run again.
     pub async fn run(self) -> Result<RunReport, RdltError> {
-        runtime::graph::run(
-            self.config,
-            self.source,
-            self.destination,
-            self.cancel,
-            self.events,
-        )
-        .await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
