--- crates/rdlt-engine/src/lib.rs
+++ replace <impl std::fmt::Debug for Engine>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -89,19 +89,17 @@
                 Err(RecvError::Closed) => return None,
             }
         }
     }
 }
 
 impl std::fmt::Debug for Engine {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        f.debug_struct("Engine")
-            .field("pipeline", &self.config.pipeline)
-            .finish_non_exhaustive()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Engine {
     pub fn new(config: EngineConfig, source: impl Source, destination: impl Destination) -> Self {
         Self {
             config,
             source: Arc::new(source),
