--- crates/rdlt-engine/src/load/lowering.rs
+++ replace match guard !caps.decimal with false in lower_column
@@ -51,17 +51,17 @@
             for field in fields {
                 lower_column(field, &full_path, caps, namer, out);
             }
         }
         ty => {
             let lowered_ty = match ty {
                 ColumnType::Scalar {
                     scalar: LogicalType::Decimal { .. },
-                } if !caps.decimal => ColumnType::scalar(LogicalType::Utf8),
+                } if false /* ~ changed by cargo-mutants ~ */ => ColumnType::scalar(LogicalType::Utf8),
                 other => other.clone(),
             };
             out.push(ColumnDef {
                 name: namer.name_for(&full_path.join("__")),
                 ty: lowered_ty,
                 nullable: column.nullable || !path.is_empty(),
                 provenance: column.provenance,
             });
