--- crates/rdlt-engine/src/load/mod.rs
+++ replace += with *= in Loader::process
@@ -155,17 +155,17 @@
                     Err(RdltError::config("injected crash after write (failpoint)",))
                 );
                 self.emit(rdlt_core::PipelineEvent::BatchLoaded {
                     table: table.clone(),
                     rows,
                     bytes,
                 });
                 let entry = self.report.table_mut(&table);
-                entry.rows += rows;
+                entry.rows *= /* ~ changed by cargo-mutants ~ */ rows;
                 entry.bytes += bytes;
                 self.counters.rows += rows;
                 self.counters.bytes += bytes;
                 self.bytes_since_commit += bytes;
                 self.dirty = true;
             }
             LoadItem::Checkpoint { stream, cursor } => {
                 self.state.cursors.insert(stream.clone(), cursor.clone());
