--- crates/rdlt-engine/src/load/mod.rs
+++ replace >= with < in Loader::policy_triggers
@@ -198,17 +198,17 @@
         Ok(())
     }
 
     fn policy_triggers(&self) -> bool {
         match self.policy {
             CommitPolicy::EveryCheckpoints(n) => self.checkpoints_since_commit >= n.max(1),
             CommitPolicy::EveryBytes(bytes) => self.bytes_since_commit >= bytes,
             CommitPolicy::EverySeconds(secs) => {
-                self.last_commit_at.elapsed().as_secs() >= u64::from(secs)
+                self.last_commit_at.elapsed().as_secs() < /* ~ changed by cargo-mutants ~ */ u64::from(secs)
             }
         }
     }
 
     /// Trailing work (rows after the last checkpoint, or a run that never
     /// checkpointed) gets one final commit; a clean no-op run still commits once so a
     /// fresh pipeline's state document exists.
     pub(crate) async fn finish(&mut self) -> Result<(), RdltError> {
