--- crates/rdlt-engine/src/load/mod.rs
+++ replace += with *= in Loader::commit
@@ -214,17 +214,17 @@
     pub(crate) async fn finish(&mut self) -> Result<(), RdltError> {
         if self.dirty || self.commit_seq == 0 {
             self.commit().await?;
         }
         Ok(())
     }
 
     async fn commit(&mut self) -> Result<(), RdltError> {
-        self.commit_seq += 1;
+        self.commit_seq *= /* ~ changed by cargo-mutants ~ */ 1;
         self.state.last_commit = Some(rdlt_core::LastCommit {
             load_id: self.load_id.clone(),
             commit_seq: self.commit_seq,
         });
         // Commit protocol step 1: the WAL span becomes durable BEFORE the
         // destination commit — a crash after this point replays instead of
         // re-extracting (crash-matrix row 2).
         if let Some(wal) = &mut self.wal {
