--- crates/rdlt-engine/src/runtime/channel.rs
+++ replace ByteTx<T>::send -> Result<(), StageClosed> with Ok(())
@@ -50,38 +50,17 @@
 #[derive(Debug, Clone, Copy, PartialEq, Eq, thiserror::Error)]
 #[error("stage channel closed")]
 pub(crate) struct StageClosed;
 
 impl<T: ByteSized> ByteTx<T> {
     pub(crate) async fn send(&self, value: T) -> Result<(), StageClosed> {
         // An item larger than the whole budget degrades to "budget fully drained"
         // rather than deadlocking.
-        let permits = value
-            .byte_size()
-            .min(self.budget_max)
-            .try_into()
-            .unwrap_or(u32::MAX);
-        let permit = if permits > 0 {
-            Some(
-                Arc::clone(&self.budget)
-                    .acquire_many_owned(permits)
-                    .await
-                    .map_err(|_| StageClosed)?,
-            )
-        } else {
-            None
-        };
-        self.tx
-            .send(Item {
-                value,
-                _permit: permit,
-            })
-            .await
-            .map_err(|_| StageClosed)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<T> ByteRx<T> {
     /// `None` once all senders are dropped and the channel is drained.
     pub(crate) async fn recv(&mut self) -> Option<T> {
         self.rx.recv().await.map(|item| item.value)
     }
