--- crates/rdlt-engine/src/runtime/channel.rs
+++ replace > with >= in ByteTx<T>::send
@@ -55,17 +55,17 @@
     pub(crate) async fn send(&self, value: T) -> Result<(), StageClosed> {
         // An item larger than the whole budget degrades to "budget fully drained"
         // rather than deadlocking.
         let permits = value
             .byte_size()
             .min(self.budget_max)
             .try_into()
             .unwrap_or(u32::MAX);
-        let permit = if permits > 0 {
+        let permit = if permits >= /* ~ changed by cargo-mutants ~ */ 0 {
             Some(
                 Arc::clone(&self.budget)
                     .acquire_many_owned(permits)
                     .await
                     .map_err(|_| StageClosed)?,
             )
         } else {
             None
