--- crates/rdlt-engine/src/runtime/channel.rs
+++ replace byte_channel -> (ByteTx<T>, ByteRx<T>) with (ByteTx::new(Default::default()), ByteRx::from(Default::default()))
@@ -83,28 +83,17 @@
 impl<T> ByteRx<T> {
     /// `None` once all senders are dropped and the channel is drained.
     pub(crate) async fn recv(&mut self) -> Option<T> {
         self.rx.recv().await.map(|item| item.value)
     }
 }
 
 pub(crate) fn byte_channel<T>(byte_budget: usize) -> (ByteTx<T>, ByteRx<T>) {
-    let budget = Arc::new(Semaphore::new(byte_budget));
-    // Message-count capacity is a secondary bound so zero-byte items (markers) can't
-    // queue unboundedly.
-    let (tx, rx) = mpsc::channel(256);
-    (
-        ByteTx {
-            tx,
-            budget,
-            budget_max: byte_budget,
-        },
-        ByteRx { rx },
-    )
+    (ByteTx::new(Default::default()), ByteRx::from(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     struct Blob(usize);
     impl ByteSized for Blob {
