--- crates/rdlt-engine/src/runtime/graph.rs
+++ delete ! in run_once
@@ -304,17 +304,17 @@
                             if tx.send(item).await.is_err() {
                                 break;
                             }
                         }
                     }
                     PushPayload::Arrow(batch) => {
                         // Structured fast path (clause E7); undeclared streams are a
                         // contract violation (clause S7).
-                        if !spec.structured {
+                        if  /* ~ changed by cargo-mutants ~ */spec.structured {
                             break Err(RdltError::source(
                                 stream_name.clone(),
                                 "source pushed Arrow batches on a stream not declared \
                                  `structured` (contract clause S7)",
                             ));
                         }
                         // Same blocking-pool ping-pong as the shred arm: the common
                         // path is cheap (schema map + one constant column), but a
