--- crates/rdlt-engine/src/runtime/graph.rs
+++ replace backoff -> std::time::Duration with Default::default()
@@ -44,17 +44,17 @@
     let seq = LOAD_COUNTER.fetch_add(1, Ordering::Relaxed);
     LoadId::new(format!("{millis:x}-{:x}-{seq:x}", std::process::id()))
 }
 
 /// Engine-owned retry ceiling for transient source failures (clause E5).
 const MAX_SOURCE_ATTEMPTS: u32 = 5;
 
 fn backoff(attempt: u32) -> std::time::Duration {
-    std::time::Duration::from_millis(100u64.saturating_mul(1 << attempt.min(6)))
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Retry driver: each attempt is a full run from committed state. A per-attempt
 /// child token keeps internal failure-cancellation from poisoning the next attempt;
 /// only the caller's token (`cancel`) survives across attempts.
 pub(crate) async fn run(
     config: EngineConfig,
     source: Arc<dyn Source>,
