--- crates/rdlt-engine/src/runtime/graph.rs
+++ replace match guard attempt + 1 < MAX_SOURCE_ATTEMPTS && !cancel.is_cancelled() with true in run
@@ -76,17 +76,17 @@
         )
         .await;
         match result {
             Err(RdltError::Source {
                 stream,
                 message,
                 retryable: true,
                 retry_after_ms,
-            }) if attempt + 1 < MAX_SOURCE_ATTEMPTS && !cancel.is_cancelled() => {
+            }) if true /* ~ changed by cargo-mutants ~ */ => {
                 attempt += 1;
                 retries += 1;
                 let delay = retry_after_ms
                     .map(std::time::Duration::from_millis)
                     .unwrap_or_else(|| backoff(attempt));
                 tracing::warn!(
                     stream = %stream, attempt, %message,
                     "transient source failure; restarting run from committed state"
