--- crates/rdlt-engine/src/runtime/lock.rs
+++ replace WorkdirLock::acquire -> Result<Self, RdltError> with Ok(Default::default())
@@ -11,35 +11,17 @@
 
 #[derive(Debug)]
 pub(crate) struct WorkdirLock {
     _file: File,
 }
 
 impl WorkdirLock {
     pub(crate) fn acquire(workdir: &Path) -> Result<Self, RdltError> {
-        std::fs::create_dir_all(workdir)
-            .map_err(|e| RdltError::wal(format!("creating workdir {}: {e}", workdir.display())))?;
-        let path = workdir.join(".lock");
-        let file = OpenOptions::new()
-            .create(true)
-            .truncate(false)
-            .write(true)
-            .open(&path)
-            .map_err(|e| RdltError::wal(format!("opening lock {}: {e}", path.display())))?;
-        if !file
-            .try_lock_exclusive()
-            .map_err(|e| RdltError::wal(format!("locking {}: {e}", path.display())))?
-        {
-            return Err(RdltError::config(format!(
-                "another run holds the workdir lock at {} — one process per pipeline",
-                path.display()
-            )));
-        }
-        Ok(Self { _file: file })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
