--- crates/rdlt-engine/src/schema/contracts.rs
+++ replace scalar_fits -> bool with true
@@ -26,36 +26,17 @@
             let ty = ColumnType::scalar(*item);
             items.iter().all(|i| value_fits(i, &ty))
         }
         _ => false,
     }
 }
 
 fn scalar_fits(value: &Value, scalar: LogicalType) -> bool {
-    match scalar {
-        LogicalType::Json => true, // Json holds anything
-        LogicalType::Bool => value.is_boolean(),
-        LogicalType::Int64 => value.as_i64().is_some(),
-        LogicalType::Float64 => match value {
-            Value::Number(n) => n.as_i64().map(int64_fits_in_f64).unwrap_or(n.is_f64()),
-            _ => false,
-        },
-        // Utf8 absorbs every textable scalar (canonical renderings).
-        LogicalType::Utf8 | LogicalType::Uuid => {
-            matches!(value, Value::String(_) | Value::Number(_) | Value::Bool(_))
-        }
-        LogicalType::TimestampTz => value
-            .as_str()
-            .map(|s| parse_timestamp_tz(s).is_some())
-            .unwrap_or(false),
-        LogicalType::TimestampNaive | LogicalType::Date | LogicalType::Time => value.is_string(),
-        LogicalType::Decimal { .. } => value.as_i64().is_some() || value.is_string(),
-        LogicalType::Binary => false, // not producible from JSON
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Build the typed violation for a frozen change.
 pub(crate) fn violation_for(table: &TableName, change: &SchemaChange) -> ContractViolation {
     match change {
         SchemaChange::CreateTable { .. } => ContractViolation {
             table: table.clone(),
             column: None,
