--- crates/rdlt-engine/src/schema/contracts.rs
+++ replace || with && in scalar_fits
@@ -43,17 +43,17 @@
         LogicalType::Utf8 | LogicalType::Uuid => {
             matches!(value, Value::String(_) | Value::Number(_) | Value::Bool(_))
         }
         LogicalType::TimestampTz => value
             .as_str()
             .map(|s| parse_timestamp_tz(s).is_some())
             .unwrap_or(false),
         LogicalType::TimestampNaive | LogicalType::Date | LogicalType::Time => value.is_string(),
-        LogicalType::Decimal { .. } => value.as_i64().is_some() || value.is_string(),
+        LogicalType::Decimal { .. } => value.as_i64().is_some() && /* ~ changed by cargo-mutants ~ */ value.is_string(),
         LogicalType::Binary => false, // not producible from JSON
     }
 }
 
 /// Build the typed violation for a frozen change.
 pub(crate) fn violation_for(table: &TableName, change: &SchemaChange) -> ContractViolation {
     match change {
         SchemaChange::CreateTable { .. } => ContractViolation {
