--- crates/rdlt-engine/src/schema/registry.rs
+++ delete match arm (ColumnType::Scalar{scalar:a}, ColumnType::Scalar{scalar:b}) in is_widening
@@ -96,19 +96,17 @@
     use rdlt_core::types::is_widening_of;
     match (from, to) {
         (
             _,
             ColumnType::Scalar {
                 scalar: rdlt_core::LogicalType::Json,
             },
         ) => true,
-        (ColumnType::Scalar { scalar: a }, ColumnType::Scalar { scalar: b }) => {
-            is_widening_of(*a, *b)
-        }
+         /* ~ changed by cargo-mutants ~ */
         (ColumnType::ScalarList { item: a }, ColumnType::ScalarList { item: b }) => {
             is_widening_of(*a, *b)
         }
         (
             ColumnType::Struct {
                 fields: from_fields,
             },
             ColumnType::Struct { fields: to_fields },
