--- crates/rdlt-engine/src/schema/registry.rs
+++ replace == with != in is_widening
@@ -111,13 +111,13 @@
             ColumnType::Struct {
                 fields: from_fields,
             },
             ColumnType::Struct { fields: to_fields },
         ) => from_fields.iter().all(|f| {
             to_fields
                 .iter()
                 .find(|t| t.name == f.name)
-                .is_some_and(|t| f.ty == t.ty || is_widening(&f.ty, &t.ty))
+                .is_some_and(|t| f.ty != /* ~ changed by cargo-mutants ~ */ t.ty || is_widening(&f.ty, &t.ty))
         }),
         _ => false,
     }
 }
