--- crates/rdlt-engine/src/schema/registry.rs
+++ replace SchemaRegistry::get -> Option<&TableSchema> with Some(Box::leak(Box::new(Default::default())))
@@ -8,17 +8,17 @@
 
 #[derive(Debug, Default)]
 pub(crate) struct SchemaRegistry {
     tables: BTreeMap<TableName, TableSchema>,
 }
 
 impl SchemaRegistry {
     pub(crate) fn get(&self, table: &TableName) -> Option<&TableSchema> {
-        self.tables.get(table)
+        Some(Box::leak(Box::new(Default::default()))) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Store `observed` as current, described by pre-computed `changes` (usually from
     /// [`Self::diff`], possibly policy-filtered). No-op when nothing changed.
     pub(crate) fn apply(
         &mut self,
         observed: TableSchema,
         changes: Vec<SchemaChange>,
