--- crates/rdlt-engine/src/schema/registry.rs
+++ replace is_widening -> bool with true
@@ -88,36 +88,10 @@
         }
         changes
     }
 }
 
 /// Structural widening check (used in debug assertions): scalar-lattice order,
 /// struct fields append/widen, anything → Json.
 fn is_widening(from: &ColumnType, to: &ColumnType) -> bool {
-    use rdlt_core::types::is_widening_of;
-    match (from, to) {
-        (
-            _,
-            ColumnType::Scalar {
-                scalar: rdlt_core::LogicalType::Json,
-            },
-        ) => true,
-        (ColumnType::Scalar { scalar: a }, ColumnType::Scalar { scalar: b }) => {
-            is_widening_of(*a, *b)
-        }
-        (ColumnType::ScalarList { item: a }, ColumnType::ScalarList { item: b }) => {
-            is_widening_of(*a, *b)
-        }
-        (
-            ColumnType::Struct {
-                fields: from_fields,
-            },
-            ColumnType::Struct { fields: to_fields },
-        ) => from_fields.iter().all(|f| {
-            to_fields
-                .iter()
-                .find(|t| t.name == f.name)
-                .is_some_and(|t| f.ty == t.ty || is_widening(&f.ty, &t.ty))
-        }),
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
