--- crates/rdlt-engine/src/schema/registry.rs
+++ delete match arm (_, ColumnType::Scalar{scalar:rdlt_core::LogicalType::Json,},) in is_widening
@@ -90,22 +90,17 @@
     }
 }
 
 /// Structural widening check (used in debug assertions): scalar-lattice order,
 /// struct fields append/widen, anything → Json.
 fn is_widening(from: &ColumnType, to: &ColumnType) -> bool {
     use rdlt_core::types::is_widening_of;
     match (from, to) {
-        (
-            _,
-            ColumnType::Scalar {
-                scalar: rdlt_core::LogicalType::Json,
-            },
-        ) => true,
+         /* ~ changed by cargo-mutants ~ */
         (ColumnType::Scalar { scalar: a }, ColumnType::Scalar { scalar: b }) => {
             is_widening_of(*a, *b)
         }
         (ColumnType::ScalarList { item: a }, ColumnType::ScalarList { item: b }) => {
             is_widening_of(*a, *b)
         }
         (
             ColumnType::Struct {
