--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm system_columns::POS in build_batch
@@ -99,26 +99,17 @@
                 for row in rows {
                     match &row.root_id {
                         Some(id) => b.append_value(id.to_hex()),
                         None => b.append_null(),
                     }
                 }
                 Arc::new(b.finish())
             }
-            system_columns::POS => {
-                let mut b = Int64Builder::new();
-                for row in rows {
-                    match row.pos {
-                        Some(pos) => b.append_value(pos as i64),
-                        None => b.append_null(),
-                    }
-                }
-                Arc::new(b.finish())
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {
                 let source_key = name_map
                     .iter()
                     .find(|(_, normalized)| normalized == &column.name)
                     .map(|(source, _)| source.as_str())
                     .unwrap_or(column.name.as_str());
                 let values: Vec<Option<&Value>> =
                     rows.iter().map(|row| row.value.get(source_key)).collect();
