--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm Value::String(s) in parse_decimal
@@ -311,17 +311,17 @@
 fn parse_decimal(value: &Value, scale: u8) -> Option<i128> {
     let text = match value {
         Value::Number(n) => {
             if let Some(i) = n.as_i64() {
                 return (i as i128).checked_mul(10i128.checked_pow(scale as u32)?);
             }
             return None; // floats: refused
         }
-        Value::String(s) => s.trim(),
+         /* ~ changed by cargo-mutants ~ */
         _ => return None,
     };
     let (sign, digits) = match text.strip_prefix('-') {
         Some(rest) => (-1i128, rest),
         None => (1i128, text),
     };
     let (int_part, frac_part) = match digits.split_once('.') {
         Some((i, f)) => (i, f),
