--- crates/rdlt-engine/src/shred/build.rs
+++ replace arrow_column_type -> DataType with Default::default()
@@ -34,23 +34,17 @@
         }
         LogicalType::TimestampNaive => DataType::Timestamp(TimeUnit::Microsecond, None),
         LogicalType::Date => DataType::Date32,
         LogicalType::Time => DataType::Time64(TimeUnit::Microsecond),
     }
 }
 
 pub(crate) fn arrow_column_type(ty: &ColumnType) -> DataType {
-    match ty {
-        ColumnType::Scalar { scalar } => arrow_scalar_type(*scalar),
-        ColumnType::Struct { fields } => DataType::Struct(arrow_fields(fields)),
-        ColumnType::ScalarList { item } => {
-            DataType::List(Arc::new(Field::new("item", arrow_scalar_type(*item), true)))
-        }
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn arrow_fields(columns: &[ColumnDef]) -> Fields {
     columns
         .iter()
         .map(|c| Field::new(&c.name, arrow_column_type(&c.ty), c.nullable))
         .collect()
 }
