--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm system_columns::LOAD_ID in build_batch
@@ -65,23 +65,17 @@
     schema: &TableSchema,
     name_map: &[(String, String)],
     rows: &[BufferedRow],
     load_id: &LoadId,
 ) -> Result<RecordBatch, ArrowError> {
     let mut arrays: Vec<ArrayRef> = Vec::with_capacity(schema.columns.len());
     for column in &schema.columns {
         let array: ArrayRef = match column.name.as_str() {
-            system_columns::LOAD_ID => {
-                let mut b = StringBuilder::new();
-                for _ in rows {
-                    b.append_value(load_id.as_str());
-                }
-                Arc::new(b.finish())
-            }
+             /* ~ changed by cargo-mutants ~ */
             system_columns::ID => {
                 let mut b = StringBuilder::new();
                 for row in rows {
                     b.append_value(row.id.to_hex());
                 }
                 Arc::new(b.finish())
             }
             system_columns::PARENT_ID => {
