--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm system_columns::ID in build_batch
@@ -72,23 +72,17 @@
         let array: ArrayRef = match column.name.as_str() {
             system_columns::LOAD_ID => {
                 let mut b = StringBuilder::new();
                 for _ in rows {
                     b.append_value(load_id.as_str());
                 }
                 Arc::new(b.finish())
             }
-            system_columns::ID => {
-                let mut b = StringBuilder::new();
-                for row in rows {
-                    b.append_value(row.id.to_hex());
-                }
-                Arc::new(b.finish())
-            }
+             /* ~ changed by cargo-mutants ~ */
             system_columns::PARENT_ID => {
                 let mut b = StringBuilder::new();
                 for row in rows {
                     match &row.parent_id {
                         Some(id) => b.append_value(id.to_hex()),
                         None => b.append_null(),
                     }
                 }
