--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm system_columns::PARENT_ID in build_batch
@@ -79,26 +79,17 @@
             }
             system_columns::ID => {
                 let mut b = StringBuilder::new();
                 for row in rows {
                     b.append_value(row.id.to_hex());
                 }
                 Arc::new(b.finish())
             }
-            system_columns::PARENT_ID => {
-                let mut b = StringBuilder::new();
-                for row in rows {
-                    match &row.parent_id {
-                        Some(id) => b.append_value(id.to_hex()),
-                        None => b.append_null(),
-                    }
-                }
-                Arc::new(b.finish())
-            }
+             /* ~ changed by cargo-mutants ~ */
             system_columns::ROOT_ID => {
                 let mut b = StringBuilder::new();
                 for row in rows {
                     match &row.root_id {
                         Some(id) => b.append_value(id.to_hex()),
                         None => b.append_null(),
                     }
                 }
