--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm system_columns::ROOT_ID in build_batch
@@ -89,26 +89,17 @@
                 for row in rows {
                     match &row.parent_id {
                         Some(id) => b.append_value(id.to_hex()),
                         None => b.append_null(),
                     }
                 }
                 Arc::new(b.finish())
             }
-            system_columns::ROOT_ID => {
-                let mut b = StringBuilder::new();
-                for row in rows {
-                    match &row.root_id {
-                        Some(id) => b.append_value(id.to_hex()),
-                        None => b.append_null(),
-                    }
-                }
-                Arc::new(b.finish())
-            }
+             /* ~ changed by cargo-mutants ~ */
             system_columns::POS => {
                 let mut b = Int64Builder::new();
                 for row in rows {
                     match row.pos {
                         Some(pos) => b.append_value(pos as i64),
                         None => b.append_null(),
                     }
                 }
