--- crates/rdlt-engine/src/shred/canon.rs
+++ replace canonical_json_bytes with ()
@@ -25,44 +25,17 @@
         }
     }
 }
 
 /// Canonical JSON bytes: object keys sorted recursively, no whitespace. Used for
 /// content hashing (`_rdlt_id` keyless) — two semantically identical rows always hash
 /// identically regardless of key order in the source payload.
 pub(crate) fn canonical_json_bytes(value: &Value, out: &mut Vec<u8>) {
-    match value {
-        Value::Object(map) => {
-            out.push(b'{');
-            let mut keys: Vec<&String> = map.keys().collect();
-            keys.sort_unstable();
-            for (i, key) in keys.iter().enumerate() {
-                if i > 0 {
-                    out.push(b',');
-                }
-                // Key serialization via serde_json for correct escaping.
-                serde_json::to_writer(&mut *out, key).expect("string serialization");
-                out.push(b':');
-                canonical_json_bytes(&map[*key], out);
-            }
-            out.push(b'}');
-        }
-        Value::Array(items) => {
-            out.push(b'[');
-            for (i, item) in items.iter().enumerate() {
-                if i > 0 {
-                    out.push(b',');
-                }
-                canonical_json_bytes(item, out);
-            }
-            out.push(b']');
-        }
-        scalar => serde_json::to_writer(out, scalar).expect("scalar serialization"),
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Strict timestamp detection: RFC 3339 / ISO-8601 **with explicit offset** only
 /// (design doc §5.2 — unambiguous, timezone-carrying strings; everything else stays
 /// text).
 pub(crate) fn parse_timestamp_tz(s: &str) -> Option<chrono::DateTime<chrono::FixedOffset>> {
     chrono::DateTime::parse_from_rfc3339(s).ok()
 }
