--- crates/rdlt-engine/src/shred/canon.rs
+++ replace > with < in canonical_json_bytes
@@ -44,17 +44,17 @@
                 out.push(b':');
                 canonical_json_bytes(&map[*key], out);
             }
             out.push(b'}');
         }
         Value::Array(items) => {
             out.push(b'[');
             for (i, item) in items.iter().enumerate() {
-                if i > 0 {
+                if i < /* ~ changed by cargo-mutants ~ */ 0 {
                     out.push(b',');
                 }
                 canonical_json_bytes(item, out);
             }
             out.push(b']');
         }
         scalar => serde_json::to_writer(out, scalar).expect("scalar serialization"),
     }
