--- crates/rdlt-engine/src/shred/infer.rs
+++ replace ColState::observe with ()
@@ -93,73 +93,17 @@
     /// List of objects — rows live in a child table; the column itself vanishes.
     ChildTable,
     /// Irreconcilable shapes; values preserved verbatim.
     Json,
 }
 
 impl ColState {
     pub(crate) fn observe(&mut self, value: &Value, lists_as_columns: bool) {
-        if matches!(value, Value::Null) {
-            return;
-        }
-        match self {
-            ColState::Json => {}
-            ColState::Unknown => {
-                *self = Self::fresh(value, lists_as_columns);
-            }
-            ColState::Scalar(state) => match value {
-                Value::Object(_) | Value::Array(_) => *self = ColState::Json,
-                scalar => state.observe(scalar),
-            },
-            ColState::Struct(fields) => match value {
-                Value::Object(map) => {
-                    for (key, item) in map {
-                        match fields.iter_mut().find(|(name, _)| name == key) {
-                            Some((_, state)) => state.observe(item, lists_as_columns),
-                            None => {
-                                let mut state = ColState::Unknown;
-                                state.observe(item, lists_as_columns);
-                                fields.push((key.clone(), state));
-                            }
-                        }
-                    }
-                }
-                _ => *self = ColState::Json,
-            },
-            ColState::ScalarList(item_state) => match value {
-                Value::Array(items) => {
-                    if items.iter().any(Value::is_object) {
-                        // scalars-then-objects in the same list position: irreconcilable
-                        *self = ColState::Json;
-                    } else {
-                        for item in items {
-                            if item.is_array() {
-                                *self = ColState::Json; // nested lists: v1 escape hatch
-                                return;
-                            }
-                            item_state.observe(item);
-                        }
-                    }
-                }
-                _ => *self = ColState::Json,
-            },
-            ColState::ChildTable => {
-                // Empty lists and further lists (of objects or scalars — scalar items
-                // become {"value": …} child rows) are fine. A non-array or a mixed
-                // list is a shape conflict: the column becomes Json for conflicting
-                // values; the child table stops growing.
-                if !matches!(
-                    array_shape(value),
-                    ArrayShape::Objects | ArrayShape::Scalars | ArrayShape::Empty
-                ) {
-                    *self = ColState::Json;
-                }
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn fresh(value: &Value, lists_as_columns: bool) -> Self {
         match value {
             Value::Null => ColState::Unknown,
             Value::Object(map) => {
                 let mut fields = Vec::with_capacity(map.len());
                 for (key, item) in map {
