--- crates/rdlt-engine/src/shred/infer.rs
+++ replace array_shape -> ArrayShape with Default::default()
@@ -233,31 +233,17 @@
 enum ArrayShape {
     Empty,
     Objects,
     Scalars,
     Mixed,
 }
 
 fn array_shape(value: &Value) -> ArrayShape {
-    let Value::Array(items) = value else {
-        return ArrayShape::Mixed;
-    };
-    let non_null: Vec<&Value> = items.iter().filter(|v| !v.is_null()).collect();
-    if non_null.is_empty() {
-        return ArrayShape::Empty;
-    }
-    let objects = non_null.iter().filter(|v| v.is_object()).count();
-    if objects == non_null.len() {
-        ArrayShape::Objects
-    } else if objects == 0 {
-        ArrayShape::Scalars
-    } else {
-        ArrayShape::Mixed
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use serde_json::json;
 
     fn observe_all(values: &[Value]) -> ColState {
