--- crates/rdlt-engine/src/shred/infer.rs
+++ delete ! in array_shape
@@ -236,17 +236,17 @@
     Scalars,
     Mixed,
 }
 
 fn array_shape(value: &Value) -> ArrayShape {
     let Value::Array(items) = value else {
         return ArrayShape::Mixed;
     };
-    let non_null: Vec<&Value> = items.iter().filter(|v| !v.is_null()).collect();
+    let non_null: Vec<&Value> = items.iter().filter(|v|  /* ~ changed by cargo-mutants ~ */v.is_null()).collect();
     if non_null.is_empty() {
         return ArrayShape::Empty;
     }
     let objects = non_null.iter().filter(|v| v.is_object()).count();
     if objects == non_null.len() {
         ArrayShape::Objects
     } else if objects == 0 {
         ArrayShape::Scalars
