--- crates/rdlt-engine/src/shred/mod.rs
+++ delete ! in StreamShredder::drain_batch
@@ -116,17 +116,17 @@
                 items.push(LoadItem::Delta {
                     schema: current,
                     delta,
                     mode: mode.clone(),
                 });
             }
 
             let buffer = &mut self.tables[idx];
-            if !buffer.rows.is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */buffer.rows.is_empty() {
                 let schema = registry
                     .get(&buffer.table)
                     .expect("schema registered before building")
                     .clone();
                 let names = buffer.name_map().to_vec();
                 let batch = build::build_batch(&schema, &names, &buffer.rows, load_id)
                     .map_err(|e| RdltError::config(format!("arrow build: {e}")))?;
                 buffer.rows.clear();
