--- crates/rdlt-engine/src/shred/mod.rs
+++ replace StreamShredder::enforce_discards -> Result<(), RdltError> with Ok(())
@@ -145,88 +145,11 @@
     fn enforce_discards(
         &mut self,
         idx: usize,
         registry: &SchemaRegistry,
         discard: &[(SchemaChange, PolicyAction)],
         discarded_ids: &mut BTreeSet<RowId>,
         items: &mut Vec<LoadItem>,
     ) -> Result<(), RdltError> {
-        let snapshot = self.pre_batch.get(idx).map(Vec::as_slice);
-        let table_name = self.tables[idx].table.clone();
-
-        // Resolve, per offending change: (source key, offense test input).
-        struct Offense {
-            source_key: String,
-            /// `None` = new column (any non-null value offends);
-            /// `Some(ty)` = must fit this (the pre-change) type.
-            must_fit: Option<rdlt_core::ColumnType>,
-            action: PolicyAction,
-        }
-        let mut offenses: Vec<Offense> = Vec::new();
-        {
-            let buffer = &mut self.tables[idx];
-            for (change, action) in discard {
-                let Some(normalized) = change_column(change) else {
-                    continue;
-                };
-                let source_key = buffer
-                    .source_key_for(normalized)
-                    .unwrap_or(normalized)
-                    .to_owned();
-                buffer.revert_column(&source_key, snapshot);
-                let must_fit = match change {
-                    SchemaChange::WidenColumn { from, .. } => Some(from.clone()),
-                    _ => None,
-                };
-                offenses.push(Offense {
-                    source_key,
-                    must_fit,
-                    action: *action,
-                });
-            }
-        }
-        let _ = registry; // registry types already captured in `must_fit`
-
-        let mut dropped_rows = 0u64;
-        let mut nulled_values = 0u64;
-        let buffer = &mut self.tables[idx];
-        buffer.rows.retain_mut(|row| {
-            let mut keep = true;
-            for offense in &offenses {
-                let value = row.value.get(&offense.source_key);
-                let offends = match (&value, &offense.must_fit) {
-                    (None, _) => false,
-                    (Some(v), None) => !v.is_null(),
-                    (Some(v), Some(ty)) => !value_fits(v, ty),
-                };
-                if !offends {
-                    continue;
-                }
-                match offense.action {
-                    PolicyAction::DiscardRow => {
-                        dropped_rows += 1;
-                        discarded_ids.insert(row.id);
-                        keep = false;
-                        break;
-                    }
-                    PolicyAction::DiscardValue => {
-                        if let Some(slot) = row.value.get_mut(&offense.source_key) {
-                            *slot = serde_json::Value::Null;
-                            nulled_values += 1;
-                        }
-                    }
-                    PolicyAction::Evolve | PolicyAction::Freeze => unreachable!("filtered above"),
-                }
-            }
-            keep
-        });
-
-        if dropped_rows > 0 || nulled_values > 0 {
-            items.push(LoadItem::Discarded {
-                table: table_name,
-                rows: dropped_rows,
-                values: nulled_values,
-            });
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
