--- crates/rdlt-engine/src/shred/mod.rs
+++ delete ! in StreamShredder::enforce_discards
@@ -191,17 +191,17 @@
         let buffer = &mut self.tables[idx];
         buffer.rows.retain_mut(|row| {
             let mut keep = true;
             for offense in &offenses {
                 let value = row.value.get(&offense.source_key);
                 let offends = match (&value, &offense.must_fit) {
                     (None, _) => false,
                     (Some(v), None) => !v.is_null(),
-                    (Some(v), Some(ty)) => !value_fits(v, ty),
+                    (Some(v), Some(ty)) =>  /* ~ changed by cargo-mutants ~ */value_fits(v, ty),
                 };
                 if !offends {
                     continue;
                 }
                 match offense.action {
                     PolicyAction::DiscardRow => {
                         dropped_rows += 1;
                         discarded_ids.insert(row.id);
