--- crates/rdlt-engine/src/shred/mod.rs
+++ replace > with < in StreamShredder::drain_batch
@@ -52,17 +52,17 @@
                     if doomed {
                         discarded_ids.insert(row.id);
                         cascade_dropped += 1;
                     } else {
                         kept.push(row);
                     }
                 }
                 buffer.rows = kept;
-                if cascade_dropped > 0 {
+                if cascade_dropped < /* ~ changed by cargo-mutants ~ */ 0 {
                     items.push(LoadItem::Discarded {
                         table: buffer.table.clone(),
                         rows: cascade_dropped,
                         values: 0,
                     });
                 }
             }
 
