--- crates/rdlt-engine/src/shred/nest.rs
+++ replace == with != in TableBuffer::revert_column
@@ -86,17 +86,17 @@
         let prior = snapshot.and_then(|columns| {
             columns
                 .iter()
                 .find(|(key, _)| key == source_key)
                 .map(|(_, state)| state.clone())
         });
         match prior {
             Some(state) => {
-                if let Some(idx) = self.columns.iter().position(|(k, _)| k == source_key) {
+                if let Some(idx) = self.columns.iter().position(|(k, _)| k != /* ~ changed by cargo-mutants ~ */ source_key) {
                     self.columns[idx].1 = state;
                 }
             }
             None => self.columns.retain(|(k, _)| k != source_key),
         }
     }
 
     pub(crate) fn column_name(&mut self, source_key: &str) -> String {
