--- crates/rdlt-engine/src/shred/passthrough.rs
+++ replace schema_from_arrow -> Result<(TableSchema, Vec<(String, usize)>), RdltError> with Ok((Default::default(), vec![(String::new(), 1)]))
@@ -152,52 +152,17 @@
 
 /// Logical schema for a structured batch: `_rdlt_load_id` + the batch's fields
 /// (normalized names, mapped types). Also returns normalized-name → column-index.
 fn schema_from_arrow(
     batch: &RecordBatch,
     table: &TableName,
     caps: DestCapabilities,
 ) -> Result<(TableSchema, Vec<(String, usize)>), RdltError> {
-    let mut namer = UniqueNamer::new(caps.ident_rules);
-    namer.reserve(system_columns::LOAD_ID); // even a literal `_rdlt_load_id` input suffixes
-
-    let mut columns = vec![ColumnDef {
-        name: system_columns::LOAD_ID.to_owned(),
-        ty: ColumnType::scalar(LogicalType::Utf8),
-        nullable: false,
-        provenance: Provenance::System,
-    }];
-    let mut name_map = Vec::new();
-    for (idx, field) in batch.schema().fields().iter().enumerate() {
-        let ty = column_type_from_arrow(field.data_type()).map_err(|reason| {
-            RdltError::config(format!(
-                "table `{table}` column `{}`: unmappable arrow type {} ({reason}) — \
-                 never coerced silently (clause E7)",
-                field.name(),
-                field.data_type()
-            ))
-        })?;
-        let name = namer.name_for(field.name());
-        name_map.push((name.clone(), idx));
-        columns.push(ColumnDef {
-            name,
-            ty,
-            nullable: true,
-            provenance: Provenance::Inferred,
-        });
-    }
-    Ok((
-        TableSchema {
-            table: table.clone(),
-            parent: None,
-            columns,
-        },
-        name_map,
-    ))
+    Ok((Default::default(), vec![(String::new(), 1)])) /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn column_type_from_arrow(dt: &DataType) -> Result<ColumnType, String> {
     use LogicalType::*;
     let scalar = |t| Ok(ColumnType::scalar(t));
     match dt {
         DataType::Boolean => scalar(Bool),
         DataType::Int8
