--- crates/rdlt-engine/src/shred/passthrough.rs
+++ replace match guard *scale >= 0 with true in column_type_from_arrow
@@ -212,17 +212,17 @@
         DataType::Utf8 | DataType::LargeUtf8 => scalar(Utf8),
         DataType::Binary | DataType::LargeBinary => scalar(Binary),
         DataType::Timestamp(_, Some(_)) => scalar(TimestampTz),
         DataType::Timestamp(_, None) => scalar(TimestampNaive),
         DataType::Date32 | DataType::Date64 => scalar(Date),
         DataType::Time32(_) | DataType::Time64(TimeUnit::Microsecond | TimeUnit::Nanosecond) => {
             scalar(Time)
         }
-        DataType::Decimal128(precision, scale) if *scale >= 0 => Ok(ColumnType::scalar(Decimal {
+        DataType::Decimal128(precision, scale) if true /* ~ changed by cargo-mutants ~ */ => Ok(ColumnType::scalar(Decimal {
             precision: *precision,
             scale: *scale as u8,
         })),
         DataType::Struct(fields) => {
             let mapped: Result<Vec<ColumnDef>, String> = fields
                 .iter()
                 .map(|f| {
                     Ok(ColumnDef {
