--- crates/rdlt-engine/src/wal/mod.rs
+++ replace Wal::record -> Result<(), RdltError> with Ok(())
@@ -107,53 +107,17 @@
             load_id: load_id.clone(),
             pipeline: pipeline.clone(),
         })?;
         Ok(wal)
     }
 
     /// Record one load item ahead of applying it to the destination.
     pub(crate) fn record(&mut self, item: &LoadItem) -> Result<(), RdltError> {
-        match item {
-            LoadItem::Delta {
-                schema,
-                delta,
-                mode,
-            } => self.append(&WalRecord::Delta {
-                schema: schema.clone(),
-                delta: delta.clone(),
-                mode: mode.clone(),
-            }),
-            LoadItem::Checkpoint { stream, cursor } => self.append(&WalRecord::Checkpoint {
-                stream: stream.clone(),
-                cursor: cursor.clone(),
-            }),
-            LoadItem::Batch { table, batch } => {
-                crash_point!(
-                    "wal.segment.write",
-                    Err(wal_err(
-                        "write segment",
-                        std::io::Error::other("injected crash"),
-                    ))
-                );
-                let file = format!("{}-{:06}.parquet", self.load_id, self.segment_seq);
-                self.segment_seq += 1;
-                let path = self.dir.join(&file);
-                write_segment(&path, batch)?;
-                self.pending_sync.push(path.clone());
-                self.pending_gc.push(path);
-                self.append(&WalRecord::Segment {
-                    table: table.clone(),
-                    file,
-                    rows: batch.num_rows() as u64,
-                })
-            }
-            // Report-only accounting; a replay regenerates nothing from it.
-            LoadItem::Discarded { .. } => Ok(()),
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Step (1) of the commit protocol: make the whole span durable.
     pub(crate) fn sync_for_commit(&mut self) -> Result<(), RdltError> {
         crash_point!(
             "wal.segment.fsync",
             Err(wal_err(
                 "fsync segment",
