--- crates/rdlt-engine/src/wal/mod.rs
+++ replace += with *= in Wal::record
@@ -130,17 +130,17 @@
                 crash_point!(
                     "wal.segment.write",
                     Err(wal_err(
                         "write segment",
                         std::io::Error::other("injected crash"),
                     ))
                 );
                 let file = format!("{}-{:06}.parquet", self.load_id, self.segment_seq);
-                self.segment_seq += 1;
+                self.segment_seq *= /* ~ changed by cargo-mutants ~ */ 1;
                 let path = self.dir.join(&file);
                 write_segment(&path, batch)?;
                 self.pending_sync.push(path.clone());
                 self.pending_gc.push(path);
                 self.append(&WalRecord::Segment {
                     table: table.clone(),
                     file,
                     rows: batch.num_rows() as u64,
