--- crates/rdlt-engine/src/wal/mod.rs
+++ replace Wal::sync_for_commit -> Result<(), RdltError> with Ok(())
@@ -148,42 +148,17 @@
             }
             // Report-only accounting; a replay regenerates nothing from it.
             LoadItem::Discarded { .. } => Ok(()),
         }
     }
 
     /// Step (1) of the commit protocol: make the whole span durable.
     pub(crate) fn sync_for_commit(&mut self) -> Result<(), RdltError> {
-        crash_point!(
-            "wal.segment.fsync",
-            Err(wal_err(
-                "fsync segment",
-                std::io::Error::other("injected crash"),
-            ))
-        );
-        for path in self.pending_sync.drain(..) {
-            File::open(&path)
-                .and_then(|f| f.sync_all())
-                .map_err(|e| wal_err("fsync segment", e))?;
-        }
-        self.manifest
-            .flush()
-            .map_err(|e| wal_err("flush manifest", e))?;
-        crash_point!(
-            "wal.manifest.fsync",
-            Err(wal_err(
-                "fsync manifest",
-                std::io::Error::other("injected crash"),
-            ))
-        );
-        self.manifest
-            .sync_all()
-            .map_err(|e| wal_err("fsync manifest", e))?;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Step (3): the destination acknowledged `commit_seq` — mark and reclaim.
     pub(crate) fn mark_committed(&mut self, commit_seq: u64) -> Result<(), RdltError> {
         self.append(&WalRecord::Committed { commit_seq })?;
         for path in self.pending_gc.drain(..) {
             // Best-effort: a survivor just gets replay-skipped via the Committed record.
             let _ = std::fs::remove_file(path);
