--- crates/rdlt-engine/src/wal/mod.rs
+++ replace clear with ()
@@ -215,10 +215,10 @@
         .write(batch)
         .map_err(|e| wal_err("write segment", e))?;
     writer.close().map_err(|e| wal_err("close segment", e))?;
     Ok(())
 }
 
 /// Remove the whole WAL directory (clean finish, or fresh start after full recovery).
 pub(crate) fn clear(dir: &Path) {
-    let _ = std::fs::remove_dir_all(dir);
+    () /* ~ changed by cargo-mutants ~ */
 }
