--- crates/rdlt-engine/src/wal/mod.rs
+++ replace default_wal_version -> u32 with 0
@@ -26,17 +26,17 @@
 use crate::load::LoadItem;
 
 /// Manifest format version (contracts/persisted-formats.md §3). Bumped on any
 /// record-shape change; a newer-than-supported manifest degrades to re-extraction
 /// rather than being misread.
 pub(crate) const WAL_FORMAT_VERSION: u32 = 1;
 
 fn default_wal_version() -> u32 {
-    1
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// One manifest line. Order on disk IS the replay order.
 #[derive(Debug, Clone, Serialize, Deserialize)]
 #[serde(tag = "rec", rename_all = "snake_case")]
 pub(crate) enum WalRecord {
     /// First record of each run; identifies the load for recovery commits and
     /// carries the manifest format version.
