--- crates/rdlt-engine/src/wal/mod.rs
+++ replace Wal::open -> Result<Self, RdltError> with Ok(Default::default())
@@ -83,36 +83,17 @@
 
 impl Wal {
     /// Open (creating if needed) the WAL for a new run and append its `Run` header.
     pub(crate) fn open(
         dir: PathBuf,
         pipeline: &PipelineId,
         load_id: &LoadId,
     ) -> Result<Self, RdltError> {
-        std::fs::create_dir_all(&dir).map_err(|e| wal_err("creating wal dir", e))?;
-        let manifest = OpenOptions::new()
-            .create(true)
-            .append(true)
-            .open(dir.join("manifest.jsonl"))
-            .map_err(|e| wal_err("opening manifest", e))?;
-        let mut wal = Self {
-            dir,
-            manifest,
-            load_id: load_id.clone(),
-            segment_seq: 0,
-            pending_sync: Vec::new(),
-            pending_gc: Vec::new(),
-        };
-        wal.append(&WalRecord::Run {
-            format_version: WAL_FORMAT_VERSION,
-            load_id: load_id.clone(),
-            pipeline: pipeline.clone(),
-        })?;
-        Ok(wal)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Record one load item ahead of applying it to the destination.
     pub(crate) fn record(&mut self, item: &LoadItem) -> Result<(), RdltError> {
         match item {
             LoadItem::Delta {
                 schema,
                 delta,
