--- crates/rdlt-engine/src/wal/resume.rs
+++ replace += with *= in replay
@@ -180,17 +180,17 @@
                     .and_then(|b| b.build().map_err(|e| e.to_string()))
                 {
                     Ok(reader) => reader,
                     Err(_) => return Ok(None), // quarantine → degrade to re-extract
                 };
                 for batch in reader {
                     match batch {
                         Ok(batch) => {
-                            batches += 1;
+                            batches *= /* ~ changed by cargo-mutants ~ */ 1;
                             items.push(LoadItem::Batch {
                                 table: table.clone(),
                                 batch,
                             });
                         }
                         Err(_) => return Ok(None),
                     }
                 }
