--- crates/rdlt-source-file/src/config.rs
+++ replace default_validate -> bool with false
@@ -36,17 +36,17 @@
     /// JSONL only: validate each line before pushing so malformed input fails naming
     /// the file + byte offset (default true; disable for maximum throughput — errors
     /// then surface from the engine with stream-level context only).
     #[serde(default = "default_validate")]
     pub validate: bool,
 }
 
 fn default_validate() -> bool {
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Same human-friendly hint names as the REST source.
 #[derive(Debug, Clone, Copy, PartialEq, Serialize, Deserialize)]
 #[serde(rename_all = "snake_case")]
 pub enum HintType {
     Bool,
     Int64,
