--- crates/rdlt-source-file/src/config.rs
+++ replace FileConfig::validate -> Result<(), ConfigError> with Ok(())
@@ -78,31 +78,17 @@
 impl FileConfig {
     pub fn from_yaml(yaml: &str) -> Result<Self, ConfigError> {
         let config: FileConfig = serde_yaml::from_str(yaml)?;
         config.validate()?;
         Ok(config)
     }
 
     fn validate(&self) -> Result<(), ConfigError> {
-        if self.streams.is_empty() {
-            return Err(ConfigError::Invalid(
-                "at least one stream is required".into(),
-            ));
-        }
-        for stream in &self.streams {
-            if stream.format == Format::Parquet && stream.primary_key.is_some() {
-                return Err(ConfigError::Invalid(format!(
-                    "stream `{}`: parquet streams are structured and cannot declare \
-                     primary_key (no per-row identity; contract clause S7)",
-                    stream.name
-                )));
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, thiserror::Error)]
 pub enum ConfigError {
     #[error("invalid file source YAML: {0}")]
     Yaml(#[from] serde_yaml::Error),
     #[error("invalid file source config: {0}")]
