--- crates/rdlt-source-file/src/config.rs
+++ replace == with != in FileConfig::validate
@@ -84,17 +84,17 @@
 
     fn validate(&self) -> Result<(), ConfigError> {
         if self.streams.is_empty() {
             return Err(ConfigError::Invalid(
                 "at least one stream is required".into(),
             ));
         }
         for stream in &self.streams {
-            if stream.format == Format::Parquet && stream.primary_key.is_some() {
+            if stream.format != /* ~ changed by cargo-mutants ~ */ Format::Parquet && stream.primary_key.is_some() {
                 return Err(ConfigError::Invalid(format!(
                     "stream `{}`: parquet streams are structured and cannot declare \
                      primary_key (no per-row identity; contract clause S7)",
                     stream.name
                 )));
             }
         }
         Ok(())
