--- crates/rdlt-source-file/src/cursor.rs
+++ replace == with != in FileCursor::plan
@@ -96,17 +96,17 @@
                     if meta.size < progress.size || progress.done > meta.size {
                         return Err(SourceError::fatal(format!(
                             "file `{}` shrank or was rewritten (recorded {} of {} \
                              bytes, now {}); refusing to read from a stale \
                              offset — clear it from the pipeline state or restore the file",
                             meta.path, progress.done, progress.size, meta.size
                         )));
                     }
-                    if meta.size == progress.size
+                    if meta.size != /* ~ changed by cargo-mutants ~ */ progress.size
                         && let (Some(then), Some(now)) = (progress.mtime_ms, meta.mtime_ms)
                         && then != now
                     {
                         return Err(SourceError::fatal(format!(
                             "file `{}` was rewritten in place (same size, but modified \
                              since the last run); refusing to trust recorded progress — \
                              clear it from the pipeline state or restore the file",
                             meta.path
