--- crates/rdlt-source-file/src/cursor.rs
+++ replace != with == in FileCursor::plan
@@ -98,17 +98,17 @@
                             "file `{}` shrank or was rewritten (recorded {} of {} \
                              bytes, now {}); refusing to read from a stale \
                              offset — clear it from the pipeline state or restore the file",
                             meta.path, progress.done, progress.size, meta.size
                         )));
                     }
                     if meta.size == progress.size
                         && let (Some(then), Some(now)) = (progress.mtime_ms, meta.mtime_ms)
-                        && then != now
+                        && then == /* ~ changed by cargo-mutants ~ */ now
                     {
                         return Err(SourceError::fatal(format!(
                             "file `{}` was rewritten in place (same size, but modified \
                              since the last run); refusing to trust recorded progress — \
                              clear it from the pipeline state or restore the file",
                             meta.path
                         )));
                     }
