--- crates/rdlt-source-file/src/cursor.rs
+++ delete ! in FileCursor::plan
@@ -108,17 +108,17 @@
                         return Err(SourceError::fatal(format!(
                             "file `{}` was rewritten in place (same size, but modified \
                              since the last run); refusing to trust recorded progress — \
                              clear it from the pipeline state or restore the file",
                             meta.path
                         )));
                     }
                     if progress.done < meta.size {
-                        if !progress.eol {
+                        if  /* ~ changed by cargo-mutants ~ */progress.eol {
                             return Err(SourceError::fatal(format!(
                                 "file `{}` grew after a run that consumed an unterminated \
                                  final line; the recorded offset {} points mid-record — \
                                  clear it from the pipeline state or restore the file",
                                 meta.path, progress.done
                             )));
                         }
                         tasks.push(FileTask {
