--- crates/rdlt-source-file/src/cursor.rs
+++ replace FileCursor::encode -> Cursor with Default::default()
@@ -73,17 +73,17 @@
                 files: BTreeMap::new(),
             }),
             Some(cursor) => serde_json::from_value(cursor.as_value().clone())
                 .map_err(|e| SourceError::fatal(format!("unreadable file cursor: {e}"))),
         }
     }
 
     pub fn encode(&self) -> Cursor {
-        Cursor::new(serde_json::to_value(self).expect("cursor serialization"))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Plan this run against the matched files (already sorted). Skips
     /// complete-and-unchanged files; fails on shrunk/rewritten ones.
     pub fn plan(&self, matched: &[FileMeta]) -> Result<Vec<FileTask>, SourceError> {
         let mut tasks = Vec::new();
         for meta in matched {
             match self.files.get(&meta.path) {
