--- crates/rdlt-source-file/src/lib.rs
+++ replace <impl Source for FileSource>::read -> Result<(), SourceError> with Ok(())
@@ -112,34 +112,11 @@
                     Format::Parquet => spec = spec.structured(),
                 }
                 spec
             })
             .collect())
     }
 
     async fn read(&self, mut req: ReadRequest) -> Result<(), SourceError> {
-        let stream = self
-            .stream_config(req.stream.name.as_str())
-            .ok_or_else(|| SourceError::fatal(format!("unknown stream {}", req.stream.name)))?;
-
-        let mut cursor = FileCursor::decode(req.since.as_ref())?;
-        // Snapshot the file list once per run (stable list; new files next run).
-        let matched = match stream.format {
-            Format::Jsonl => resolve_files(&stream.path)?,
-            Format::Parquet => parquet::resolve_with_row_groups(&stream.path)?,
-        };
-        let tasks = cursor.plan(&matched)?;
-
-        for task in &tasks {
-            let proceeded = match stream.format {
-                Format::Jsonl => {
-                    jsonl::read_task(task, stream.validate, &mut cursor, &mut req.out).await?
-                }
-                Format::Parquet => parquet::read_task(task, &mut cursor, &mut req.out).await?,
-            };
-            if !proceeded {
-                return Ok(()); // cancellation (clause S4)
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
