--- crates/rdlt-source-file/src/lib.rs
+++ replace <impl Source for FileSource>::spec -> ConnectorSpec with Default::default()
@@ -83,17 +83,17 @@
             })
         })
         .collect()
 }
 
 #[async_trait]
 impl Source for FileSource {
     fn spec(&self) -> ConnectorSpec {
-        ConnectorSpec::new("file", env!("CARGO_PKG_VERSION"))
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     async fn streams(&self) -> Result<Vec<StreamSpec>, SourceError> {
         Ok(self
             .config
             .streams
             .iter()
             .map(|stream| {
