--- crates/rdlt/src/builder.rs
+++ replace PipelineBuilder<S, D>::build -> Result<Pipeline, RdltError> with Ok(Default::default())
@@ -94,54 +94,17 @@
     }
 }
 
 impl<S: Source, D: Destination> PipelineBuilder<S, D> {
     /// Validate configuration against destination capabilities and construct the
     /// pipeline. No network or destination I/O happens here (clause B3); the checks
     /// are capability checks (clause B2).
     pub fn build(self) -> Result<Pipeline, RdltError> {
-        let caps = self.destination.capabilities();
-        let merge_requested = merge_streams(&self.config.write_mode, &self.config.write_modes);
-        if !caps.merge && !merge_requested.is_empty() {
-            return Err(RdltError::config(format!(
-                "destination `{}` does not support Merge (requested {})",
-                self.destination.spec().name,
-                if merge_requested.contains(&None) {
-                    "as the default write mode".to_owned()
-                } else {
-                    format!(
-                        "for streams: {}",
-                        merge_requested
-                            .iter()
-                            .flatten()
-                            .map(|s| s.as_str())
-                            .collect::<Vec<_>>()
-                            .join(", ")
-                    )
-                }
-            )));
-        }
-        for (stream, mode) in &self.config.write_modes {
-            if let WriteMode::Merge { key } = mode
-                && key.is_empty()
-            {
-                return Err(RdltError::config(format!(
-                    "stream `{stream}`: Merge requires at least one key column"
-                )));
-            }
-        }
-        if let WriteMode::Merge { key } = &self.config.write_mode
-            && key.is_empty()
-        {
-            return Err(RdltError::config("Merge requires at least one key column"));
-        }
-        Ok(Pipeline {
-            engine: Some(Engine::new(self.config, self.source, self.destination)),
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Which streams (None = the default mode) request Merge.
 fn merge_streams(
     default: &WriteMode,
     overrides: &BTreeMap<StreamName, WriteMode>,
 ) -> Vec<Option<StreamName>> {
