--- crates/rdlt/src/builder.rs
+++ delete ! in PipelineBuilder<S, D>::build
@@ -96,17 +96,17 @@
 
 impl<S: Source, D: Destination> PipelineBuilder<S, D> {
     /// Validate configuration against destination capabilities and construct the
     /// pipeline. No network or destination I/O happens here (clause B3); the checks
     /// are capability checks (clause B2).
     pub fn build(self) -> Result<Pipeline, RdltError> {
         let caps = self.destination.capabilities();
         let merge_requested = merge_streams(&self.config.write_mode, &self.config.write_modes);
-        if !caps.merge && !merge_requested.is_empty() {
+        if !caps.merge &&  /* ~ changed by cargo-mutants ~ */merge_requested.is_empty() {
             return Err(RdltError::config(format!(
                 "destination `{}` does not support Merge (requested {})",
                 self.destination.spec().name,
                 if merge_requested.contains(&None) {
                     "as the default write mode".to_owned()
                 } else {
                     format!(
                         "for streams: {}",
