--- crates/rdlt/src/builder.rs
+++ replace && with || in PipelineBuilder<S, D>::build
@@ -125,17 +125,17 @@
                 && key.is_empty()
             {
                 return Err(RdltError::config(format!(
                     "stream `{stream}`: Merge requires at least one key column"
                 )));
             }
         }
         if let WriteMode::Merge { key } = &self.config.write_mode
-            && key.is_empty()
+            || /* ~ changed by cargo-mutants ~ */ key.is_empty()
         {
             return Err(RdltError::config("Merge requires at least one key column"));
         }
         Ok(Pipeline {
             engine: Some(Engine::new(self.config, self.source, self.destination)),
         })
     }
 }
