--- crates/rdlt/src/builder.rs
+++ replace merge_streams -> Vec<Option<StreamName>> with vec![Some(Default::default())]
@@ -140,26 +140,17 @@
     }
 }
 
 /// Which streams (None = the default mode) request Merge.
 fn merge_streams(
     default: &WriteMode,
     overrides: &BTreeMap<StreamName, WriteMode>,
 ) -> Vec<Option<StreamName>> {
-    let mut requesting = Vec::new();
-    if matches!(default, WriteMode::Merge { .. }) {
-        requesting.push(None);
-    }
-    for (stream, mode) in overrides {
-        if matches!(mode, WriteMode::Merge { .. }) {
-            requesting.push(Some(stream.clone()));
-        }
-    }
-    requesting
+    vec![Some(Default::default())] /* ~ changed by cargo-mutants ~ */
 }
 
 /// A configured, runnable pipeline.
 #[derive(Debug)]
 pub struct Pipeline {
     engine: Option<Engine>,
 }
 
