--- crates/rdlt/src/builder.rs
+++ replace Pipeline::builder -> PipelineBuilder<Missing, Missing> with Default::default()
@@ -160,17 +160,17 @@
 /// A configured, runnable pipeline.
 #[derive(Debug)]
 pub struct Pipeline {
     engine: Option<Engine>,
 }
 
 impl Pipeline {
     pub fn builder(name: impl Into<rdlt_core::PipelineId>) -> PipelineBuilder<Missing, Missing> {
-        PipelineBuilder::new(name)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Token for cancelling a running pipeline; safe at any instant (cancellation is
     /// recovered exactly like a crash).
     pub fn cancellation_token(&self) -> Option<tokio_util::sync::CancellationToken> {
         self.engine.as_ref().map(Engine::cancellation_token)
     }
 
