--- crates/rdlt/src/builder.rs
+++ replace Pipeline::events -> Option<rdlt_engine::EventStream> with Some(Default::default())
@@ -172,17 +172,17 @@
     /// recovered exactly like a crash).
     pub fn cancellation_token(&self) -> Option<tokio_util::sync::CancellationToken> {
         self.engine.as_ref().map(Engine::cancellation_token)
     }
 
     /// Typed event stream (StreamStarted, BatchLoaded, SchemaEvolved, Committed, …).
     /// Subscribe before calling [`Pipeline::run`]; `None` once the pipeline ran.
     pub fn events(&self) -> Option<rdlt_engine::EventStream> {
-        self.engine.as_ref().map(Engine::events)
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Run to completion. Resumable: after a crash or cancellation, constructing the
     /// same pipeline again and calling `run` continues from committed state.
     pub async fn run(&mut self) -> Result<RunReport, RdltError> {
         let engine = self
             .engine
             .take()
