--- crates/rdlt/src/builder.rs
+++ replace PipelineBuilder<S, D>::source -> PipelineBuilder<NS, D> with Default::default()
@@ -37,21 +37,17 @@
             source: Missing,
             destination: Missing,
         }
     }
 }
 
 impl<S, D> PipelineBuilder<S, D> {
     pub fn source<NS: Source>(self, source: NS) -> PipelineBuilder<NS, D> {
-        PipelineBuilder {
-            config: self.config,
-            source,
-            destination: self.destination,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn destination<ND: Destination>(self, destination: ND) -> PipelineBuilder<S, ND> {
         PipelineBuilder {
             config: self.config,
             source: self.source,
             destination,
         }
