--- crates/rdlt/src/builder.rs
+++ replace PipelineBuilder<S, D>::write_mode -> Self with Default::default()
@@ -54,18 +54,17 @@
             config: self.config,
             source: self.source,
             destination,
         }
     }
 
     /// Default write disposition for every stream (default: `Append`).
     pub fn write_mode(mut self, mode: WriteMode) -> Self {
-        self.config.write_mode = mode;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Per-stream override.
     pub fn write_mode_for(mut self, stream: impl Into<StreamName>, mode: WriteMode) -> Self {
         self.config.write_modes.insert(stream.into(), mode);
         self
     }
 
