--- crates/rdlt/src/builder.rs
+++ replace PipelineBuilder<S, D>::write_mode_for -> Self with Default::default()
@@ -60,18 +60,17 @@
     /// Default write disposition for every stream (default: `Append`).
     pub fn write_mode(mut self, mode: WriteMode) -> Self {
         self.config.write_mode = mode;
         self
     }
 
     /// Per-stream override.
     pub fn write_mode_for(mut self, stream: impl Into<StreamName>, mode: WriteMode) -> Self {
-        self.config.write_modes.insert(stream.into(), mode);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Schema-change policy (default: evolve).
     pub fn schema_policy(mut self, policy: SchemaPolicy) -> Self {
         self.config.schema_policy = policy;
         self
     }
 
