--- crates/rdlt/src/builder.rs
+++ replace PipelineBuilder<S, D>::schema_policy -> Self with Default::default()
@@ -66,18 +66,17 @@
     /// Per-stream override.
     pub fn write_mode_for(mut self, stream: impl Into<StreamName>, mode: WriteMode) -> Self {
         self.config.write_modes.insert(stream.into(), mode);
         self
     }
 
     /// Schema-change policy (default: evolve).
     pub fn schema_policy(mut self, policy: SchemaPolicy) -> Self {
-        self.config.schema_policy = policy;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Commit grouping policy (default: every checkpoint).
     pub fn commit_policy(mut self, policy: CommitPolicy) -> Self {
         self.config.commit_policy = policy;
         self
     }
 
