--- crates/rdlt/src/builder.rs
+++ replace PipelineBuilder<S, D>::byte_budget -> Self with Default::default()
@@ -84,18 +84,17 @@
     /// Local work directory (holds the WAL). Default: `.rdlt`.
     pub fn workdir(mut self, dir: impl Into<PathBuf>) -> Self {
         self.config.workdir = Some(dir.into());
         self
     }
 
     /// Cap on in-flight bytes per stage channel — the memory bound.
     pub fn byte_budget(mut self, bytes: usize) -> Self {
-        self.config.byte_budget = bytes;
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<S: Source, D: Destination> PipelineBuilder<S, D> {
     /// Validate configuration against destination capabilities and construct the
     /// pipeline. No network or destination I/O happens here (clause B3); the checks
     /// are capability checks (clause B2).
     pub fn build(self) -> Result<Pipeline, RdltError> {
