--- crates/rdlt-connector/src/error.rs
+++ replace SourceError::fatal -> Self with Default::default()
@@ -27,17 +27,17 @@
 }
 
 impl SourceError {
     pub fn transient(err: impl Into<BoxError>) -> Self {
         SourceError::Transient(err.into())
     }
 
     pub fn fatal(err: impl Into<BoxError>) -> Self {
-        SourceError::Fatal(err.into())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, thiserror::Error)]
 #[non_exhaustive]
 pub enum DestError {
     /// Engine retries with backoff + jitter.
     #[error("transient destination error: {0}")]
