--- crates/rdlt-connector/src/lib.rs
+++ replace > with >= in RecordsOut::send
@@ -199,17 +199,17 @@
     pub async fn checkpoint(&mut self, cursor: Cursor) -> Result<(), ChannelClosed> {
         self.send(PushPayload::Checkpoint(cursor), 0).await
     }
 
     async fn send(&mut self, payload: PushPayload, size: usize) -> Result<(), ChannelClosed> {
         // A single oversized message may not exceed the whole budget or it would
         // deadlock; it degrades to "budget fully drained" instead.
         let permits = size.min(self.budget_max).try_into().unwrap_or(u32::MAX);
-        let permit = if permits > 0 {
+        let permit = if permits >= /* ~ changed by cargo-mutants ~ */ 0 {
             Some(
                 Arc::clone(&self.budget)
                     .acquire_many_owned(permits)
                     .await
                     .map_err(|_| ChannelClosed)?,
             )
         } else {
             None
