--- crates/rdlt-connector/src/lib.rs
+++ replace records_channel -> (RecordsOut, RecordsIn) with (Default::default(), Default::default())
@@ -243,19 +243,10 @@
         // Wake any source blocked on the byte budget so it observes the closure.
         self.budget.close();
     }
 }
 
 /// Create the push channel between a host and one `Source::read` call.
 /// `byte_budget` bounds in-flight bytes (backpressure); message count is secondary.
 pub fn records_channel(byte_budget: usize) -> (RecordsOut, RecordsIn) {
-    let budget = Arc::new(Semaphore::new(byte_budget));
-    let (tx, rx) = mpsc::channel(64);
-    (
-        RecordsOut {
-            tx,
-            budget: Arc::clone(&budget),
-            budget_max: byte_budget,
-        },
-        RecordsIn { rx, budget },
-    )
+    (Default::default(), Default::default()) /* ~ changed by cargo-mutants ~ */
 }
