--- crates/rdlt-connector/src/stream.rs
+++ replace StreamSpec::with_primary_key -> Self with Default::default()
@@ -38,18 +38,17 @@
 
     /// Declare this stream as pushing already-structured Arrow batches (clause S7).
     pub fn structured(mut self) -> Self {
         self.structured = true;
         self
     }
 
     pub fn with_primary_key(mut self, key: impl IntoIterator<Item = impl Into<String>>) -> Self {
-        self.primary_key = Some(key.into_iter().map(Into::into).collect());
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_cursor_field(mut self, field: impl Into<String>) -> Self {
         self.cursor_field = Some(field.into());
         self
     }
 
     pub fn with_type_hint(mut self, column: impl Into<String>, ty: LogicalType) -> Self {
