--- crates/rdlt-core/src/error.rs
+++ replace RdltError::wal -> Self with Default::default()
@@ -95,13 +95,11 @@
             stream,
             message: message.to_string(),
             retryable: true,
             retry_after_ms: retry_after.map(|d| d.as_millis() as u64),
         }
     }
 
     pub fn wal(message: impl std::fmt::Display) -> Self {
-        RdltError::Wal {
-            message: message.to_string(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
