--- crates/rdlt-core/src/identity.rs
+++ replace RowIdBuilder::keyless -> Self with Default::default()
@@ -21,17 +21,17 @@
     hasher: blake3::Hasher,
 }
 
 impl RowIdBuilder {
     /// Identity for a row with no declared key: hash of full canonical content.
     /// Byte-identical rows collapse to the same id — documented dedup semantics under
     /// `Merge` (design doc §5.4).
     pub fn keyless() -> Self {
-        Self::with_domain(DOMAIN_KEYLESS)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Identity for a keyed row: hash of the declared key fields only, so updates to
     /// non-key fields keep the id stable (what `Merge` merges on).
     pub fn keyed() -> Self {
         Self::with_domain(DOMAIN_KEYED)
     }
 
