--- crates/rdlt-core/src/identity.rs
+++ replace RowIdBuilder::field -> &mut Self with Box::leak(Box::new(Default::default()))
@@ -40,27 +40,17 @@
         hasher.update(domain);
         Self { hasher }
     }
 
     /// Feed one field. `name` and canonical `value` bytes are length-prefixed.
     /// A null field must be recorded too (skipping it would make `{a:1}` and
     /// `{a:1, b:null}` collide only sometimes).
     pub fn field(&mut self, name: &str, value: FieldValue<'_>) -> &mut Self {
-        self.update_lp(name.as_bytes());
-        match value {
-            FieldValue::Null => {
-                self.hasher.update(&[0u8]);
-            }
-            FieldValue::Bytes(bytes) => {
-                self.hasher.update(&[1u8]);
-                self.update_lp(bytes);
-            }
-        }
-        self
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     fn update_lp(&mut self, bytes: &[u8]) {
         self.hasher.update(&(bytes.len() as u64).to_le_bytes());
         self.hasher.update(bytes);
     }
 
     pub fn finish(&self) -> RowId {
