--- crates/rdlt-core/src/ids.rs
+++ replace hex_nibble -> Option<u8> with Some(0)
@@ -130,22 +130,17 @@
 );
 
 /// A string was not a 64-char lowercase/uppercase hex encoding.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, thiserror::Error)]
 #[error("expected a 64-character hex string")]
 pub struct InvalidHexId;
 
 fn hex_nibble(c: u8) -> Option<u8> {
-    match c {
-        b'0'..=b'9' => Some(c - b'0'),
-        b'a'..=b'f' => Some(c - b'a' + 10),
-        b'A'..=b'F' => Some(c - b'A' + 10),
-        _ => None,
-    }
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn hex_round_trip() {
