--- crates/rdlt-core/src/naming.rs
+++ replace UniqueNamer::name_for -> String with String::new()
@@ -93,38 +93,17 @@
     /// (`_rdlt_*`): without this, an input field named `_rdlt_id` would alias the
     /// lineage column instead of being suffixed.
     pub fn reserve(&mut self, name: &str) {
         self.taken
             .insert(normalize_ident(name, self.rules), RESERVED_OWNER.to_owned());
     }
 
     pub fn name_for(&mut self, source: &str) -> String {
-        let base = normalize_ident(source, self.rules);
-        match self.taken.get(&base) {
-            None => {
-                self.taken.insert(base.clone(), source.to_owned());
-                base
-            }
-            Some(owner) if owner == source => base,
-            Some(_) => {
-                let mut candidate = suffixed(&base, source, self.rules);
-                // Suffixes are derived from the source name, so a repeat collision can
-                // only come from a (astronomically unlikely) short-hash clash; extend
-                // deterministically rather than loop forever.
-                while let Some(owner) = self.taken.get(&candidate) {
-                    if owner == source {
-                        return candidate;
-                    }
-                    candidate = suffixed(&candidate, source, self.rules);
-                }
-                self.taken.insert(candidate.clone(), source.to_owned());
-                candidate
-            }
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn suffixed(base: &str, source: &str, rules: IdentRules) -> String {
     let mut out = base.to_owned();
     out.truncate(rules.max_len.saturating_sub(SUFFIX_LEN).min(out.len()));
     out.push('_');
     out.push_str(&short_hash(source));
