--- crates/rdlt-core/src/naming.rs
+++ replace flattened_column_name -> String with String::new()
@@ -58,17 +58,17 @@
 /// The child-table name for a list-of-objects field.
 pub fn child_table_name(parent: &str, field: &str, rules: IdentRules) -> String {
     normalize_ident(&format!("{parent}__{field}"), rules)
 }
 
 /// The flattened column name for a nested object path (destinations without struct
 /// support).
 pub fn flattened_column_name(path: &[&str], rules: IdentRules) -> String {
-    normalize_ident(&path.join("__"), rules)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Assigns each distinct source name a unique normalized identifier, appending a
 /// deterministic hash suffix on collision. First occurrence keeps the plain name;
 /// later colliding names get `_<hash8(source)>`.
 #[derive(Debug, Default)]
 pub struct UniqueNamer {
     rules: IdentRules,
