--- crates/rdlt-core/src/policy.rs
+++ replace SchemaPolicy::with_default -> Self with Default::default()
@@ -41,21 +41,17 @@
         Self::with_default(PolicyAction::Evolve)
     }
 
     pub fn freeze() -> Self {
         Self::with_default(PolicyAction::Freeze)
     }
 
     pub fn with_default(default: PolicyAction) -> Self {
-        Self {
-            default,
-            per_table: BTreeMap::new(),
-            per_column: BTreeMap::new(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn table(mut self, table: impl Into<TableName>, action: PolicyAction) -> Self {
         self.per_table.insert(table.into(), action);
         self
     }
 
     pub fn column(
