--- crates/rdlt-core/src/policy.rs
+++ replace SchemaPolicy::table -> Self with Default::default()
@@ -49,18 +49,17 @@
         Self {
             default,
             per_table: BTreeMap::new(),
             per_column: BTreeMap::new(),
         }
     }
 
     pub fn table(mut self, table: impl Into<TableName>, action: PolicyAction) -> Self {
-        self.per_table.insert(table.into(), action);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn column(
         mut self,
         table: impl Into<TableName>,
         column: impl Into<String>,
         action: PolicyAction,
     ) -> Self {
