--- crates/rdlt-core/src/report.rs
+++ replace RunReport::total_rows -> u64 with 1
@@ -72,11 +72,11 @@
         }
     }
 
     pub fn table_mut(&mut self, table: &TableName) -> &mut TableReport {
         self.tables.entry(table.clone()).or_default()
     }
 
     pub fn total_rows(&self) -> u64 {
-        self.tables.values().map(|t| t.rows).sum()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
