--- crates/rdlt-core/src/schema.rs
+++ replace ColumnType::scalar -> Self with Default::default()
@@ -52,17 +52,17 @@
     /// capability-resolved).
     ScalarList {
         item: LogicalType,
     },
 }
 
 impl ColumnType {
     pub fn scalar(scalar: LogicalType) -> Self {
-        ColumnType::Scalar { scalar }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, PartialEq, Eq, Serialize, Deserialize)]
 pub struct ColumnDef {
     pub name: String,
     #[serde(rename = "type")]
     pub ty: ColumnType,
