--- crates/rdlt-core/src/state.rs
+++ replace StateDoc::check_readable -> Result<(), UnsupportedStateVersion> with Ok(())
@@ -42,23 +42,17 @@
             engine_version: env!("CARGO_PKG_VERSION").to_owned(),
         }
     }
 
     /// A newer on-disk format than this engine knows must be a typed failure, never a
     /// silent reset (a silent reset would re-extract from zero and duplicate under
     /// Append). Persisted-formats contract §1.
     pub fn check_readable(&self) -> Result<(), UnsupportedStateVersion> {
-        if self.format_version > STATE_FORMAT_VERSION {
-            return Err(UnsupportedStateVersion {
-                found: self.format_version,
-                supported: STATE_FORMAT_VERSION,
-            });
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Clone, Copy, PartialEq, Eq, thiserror::Error)]
 #[error(
     "state document format v{found} is newer than this engine supports (v{supported}); \
      upgrade rdlt instead of resetting state"
 )]
