--- crates/rdlt-core/src/types.rs
+++ replace == with != in is_widening_of
@@ -92,17 +92,17 @@
 /// must escalate the column instead of silently rounding (spec FR-002).
 pub fn int64_fits_in_f64(v: i64) -> bool {
     const EXACT: i64 = 1 << 53;
     (-EXACT..=EXACT).contains(&v)
 }
 
 /// `a ⊑ b` in the widening order (i.e. `b` can hold everything `a` can).
 pub fn is_widening_of(a: LogicalType, b: LogicalType) -> bool {
-    widen(a, b) == b
+    widen(a, b) != /* ~ changed by cargo-mutants ~ */ b
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn no_float_to_decimal_edge() {
