--- crates/rdlt-core/src/types.rs
+++ delete match arm (Binary, _) |(_, Binary) in widen
@@ -51,17 +51,17 @@
 pub fn widen(a: LogicalType, b: LogicalType) -> LogicalType {
     if a == b {
         return a;
     }
     match (a, b) {
         // Top absorbs everything.
         (Json, _) | (_, Json) => Json,
         // Binary is textable only via encodings we refuse to invent silently.
-        (Binary, _) | (_, Binary) => Json,
+         /* ~ changed by cargo-mutants ~ */
         // Decimal ⊔ Decimal: max integer digits, max scale, bounded by 128-bit precision.
         (
             Decimal {
                 precision: p1,
                 scale: s1,
             },
             Decimal {
                 precision: p2,
