--- crates/rdlt-core/src/types.rs
+++ delete match arm (Int64, Float64) |(Float64, Int64) in widen
@@ -67,17 +67,17 @@
                 precision: p2,
                 scale: s2,
             },
         ) => join_decimals(p1, s1, p2, s2),
         // Int64 fits Decimal(>=19, 0); widen the decimal to cover it.
         (Int64, Decimal { precision, scale }) | (Decimal { precision, scale }, Int64) => {
             join_decimals(precision, scale, 19, 0)
         }
-        (Int64, Float64) | (Float64, Int64) => Float64,
+         /* ~ changed by cargo-mutants ~ */
         // Everything textable meets at Utf8 (canonical renderings, design doc §5.2).
         _ => Utf8,
     }
 }
 
 fn join_decimals(p1: u8, s1: u8, p2: u8, s2: u8) -> LogicalType {
     let int_digits = (p1.saturating_sub(s1)).max(p2.saturating_sub(s2));
     let scale = s1.max(s2);
