--- crates/rdlt-core/src/types.rs
+++ replace join_decimals -> LogicalType with Default::default()
@@ -74,23 +74,17 @@
         }
         (Int64, Float64) | (Float64, Int64) => Float64,
         // Everything textable meets at Utf8 (canonical renderings, design doc §5.2).
         _ => Utf8,
     }
 }
 
 fn join_decimals(p1: u8, s1: u8, p2: u8, s2: u8) -> LogicalType {
-    let int_digits = (p1.saturating_sub(s1)).max(p2.saturating_sub(s2));
-    let scale = s1.max(s2);
-    match int_digits.checked_add(scale) {
-        Some(precision) if precision <= DECIMAL_MAX_PRECISION => Decimal { precision, scale },
-        // A decimal that no longer fits 128 bits widens to canonical text.
-        _ => Utf8,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// `true` iff `v` converts to `f64` exactly. Values outside ±2^53 do not; the shredder
 /// must escalate the column instead of silently rounding (spec FR-002).
 pub fn int64_fits_in_f64(v: i64) -> bool {
     const EXACT: i64 = 1 << 53;
     (-EXACT..=EXACT).contains(&v)
 }
