--- crates/rdlt-engine/src/lib.rs
+++ replace Engine::cancellation_token -> CancellationToken with Default::default()
@@ -117,17 +117,17 @@
         EventStream {
             rx: self.events.subscribe(),
         }
     }
 
     /// Cancelling is safe at any instant and equivalent to a crash: the next run
     /// recovers identically (recovery invariant 4).
     pub fn cancellation_token(&self) -> CancellationToken {
-        self.cancel.clone()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Run to completion (resumable, cancel-safe). Consumes the engine — a run is not
     /// restartable in place; construct a new one to run again.
     pub async fn run(self) -> Result<RunReport, RdltError> {
         runtime::graph::run(
             self.config,
             self.source,
