--- crates/rdlt-engine/src/lib.rs
+++ replace EventStream::recv -> Option<PipelineEvent> with None
@@ -76,24 +76,17 @@
 #[derive(Debug)]
 pub struct EventStream {
     rx: tokio::sync::broadcast::Receiver<PipelineEvent>,
 }
 
 impl EventStream {
     /// `None` once the run finished and all events were consumed.
     pub async fn recv(&mut self) -> Option<PipelineEvent> {
-        use tokio::sync::broadcast::error::RecvError;
-        loop {
-            match self.rx.recv().await {
-                Ok(event) => return Some(event),
-                Err(RecvError::Lagged(_)) => continue,
-                Err(RecvError::Closed) => return None,
-            }
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::fmt::Debug for Engine {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
         f.debug_struct("Engine")
             .field("pipeline", &self.config.pipeline)
             .finish_non_exhaustive()
