--- crates/rdlt-engine/src/load/lowering.rs
+++ replace flatten_array -> Result<(), RdltError> with Ok(())
@@ -101,60 +101,17 @@
     field: &arrow::datatypes::Field,
     path: &[&str],
     array: ArrayRef,
     caps: &DestCapabilities,
     namer: &mut UniqueNamer,
     fields: &mut Vec<arrow::datatypes::Field>,
     out: &mut Vec<ArrayRef>,
 ) -> Result<(), RdltError> {
-    use arrow::datatypes::DataType;
-    let mut full_path: Vec<&str> = path.to_vec();
-    full_path.push(field.name());
-    match field.data_type() {
-        DataType::Struct(children) if !caps.structs => {
-            let struct_array = array
-                .as_any()
-                .downcast_ref::<StructArray>()
-                .ok_or_else(|| RdltError::config("schema says struct, array is not"))?;
-            let parent_nulls = struct_array.nulls().cloned();
-            for (i, child_field) in children.iter().enumerate() {
-                let child = with_merged_nulls(struct_array.column(i), parent_nulls.as_ref());
-                flatten_array(child_field, &full_path, child, caps, namer, fields, out)?;
-            }
-            Ok(())
-        }
-        DataType::Decimal128(_, scale) if !caps.decimal => {
-            let decimals = array
-                .as_any()
-                .downcast_ref::<Decimal128Array>()
-                .ok_or_else(|| RdltError::config("schema says decimal, array is not"))?;
-            let scale = (*scale).max(0) as u8;
-            let rendered: StringArray = decimals
-                .iter()
-                .map(|v| v.map(|raw| render_decimal(raw, scale)))
-                .collect();
-            fields.push(arrow::datatypes::Field::new(
-                namer.name_for(&full_path.join("__")),
-                DataType::Utf8,
-                true,
-            ));
-            out.push(Arc::new(rendered));
-            Ok(())
-        }
-        other => {
-            fields.push(arrow::datatypes::Field::new(
-                namer.name_for(&full_path.join("__")),
-                other.clone(),
-                field.is_nullable() || !path.is_empty(),
-            ));
-            out.push(array);
-            Ok(())
-        }
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// A struct-null row must null its flattened children too.
 fn with_merged_nulls(child: &ArrayRef, parent: Option<&NullBuffer>) -> ArrayRef {
     let Some(parent) = parent else {
         return Arc::clone(child);
     };
     let merged = match child.nulls() {
