--- crates/rdlt-engine/src/load/lowering.rs
+++ replace match guard !caps.decimal with true in flatten_array
@@ -117,17 +117,17 @@
                 .ok_or_else(|| RdltError::config("schema says struct, array is not"))?;
             let parent_nulls = struct_array.nulls().cloned();
             for (i, child_field) in children.iter().enumerate() {
                 let child = with_merged_nulls(struct_array.column(i), parent_nulls.as_ref());
                 flatten_array(child_field, &full_path, child, caps, namer, fields, out)?;
             }
             Ok(())
         }
-        DataType::Decimal128(_, scale) if !caps.decimal => {
+        DataType::Decimal128(_, scale) if true /* ~ changed by cargo-mutants ~ */ => {
             let decimals = array
                 .as_any()
                 .downcast_ref::<Decimal128Array>()
                 .ok_or_else(|| RdltError::config("schema says decimal, array is not"))?;
             let scale = (*scale).max(0) as u8;
             let rendered: StringArray = decimals
                 .iter()
                 .map(|v| v.map(|raw| render_decimal(raw, scale)))
