--- crates/rdlt-engine/src/load/lowering.rs
+++ replace with_merged_nulls -> ArrayRef with Default::default()
@@ -149,30 +149,17 @@
             out.push(array);
             Ok(())
         }
     }
 }
 
 /// A struct-null row must null its flattened children too.
 fn with_merged_nulls(child: &ArrayRef, parent: Option<&NullBuffer>) -> ArrayRef {
-    let Some(parent) = parent else {
-        return Arc::clone(child);
-    };
-    let merged = match child.nulls() {
-        Some(own) => NullBuffer::union(Some(own), Some(parent)),
-        None => Some(parent.clone()),
-    };
-    let data = child
-        .to_data()
-        .into_builder()
-        .nulls(merged)
-        .build()
-        .expect("null-merge preserves layout");
-    arrow::array::make_array(data)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn render_decimal(raw: i128, scale: u8) -> String {
     if scale == 0 {
         return raw.to_string();
     }
     let negative = raw < 0;
     let digits = raw.unsigned_abs().to_string();
