--- crates/rdlt-engine/src/load/lowering.rs
+++ delete ! in needs_lowering
@@ -12,17 +12,17 @@
 use arrow::array::{Array, ArrayRef, Decimal128Array, StringArray, StructArray};
 use arrow::buffer::NullBuffer;
 use arrow::record_batch::RecordBatch;
 use rdlt_connector::DestCapabilities;
 use rdlt_core::naming::UniqueNamer;
 use rdlt_core::{ColumnDef, ColumnType, LogicalType, RdltError, TableSchema};
 
 pub(crate) fn needs_lowering(caps: &DestCapabilities) -> bool {
-    !caps.structs || !caps.decimal
+     /* ~ changed by cargo-mutants ~ */caps.structs || !caps.decimal
 }
 
 /// Lower a schema for the destination's capabilities.
 pub(crate) fn lower_schema(schema: &TableSchema, caps: &DestCapabilities) -> TableSchema {
     if !needs_lowering(caps) {
         return schema.clone();
     }
     let mut namer = UniqueNamer::new(caps.ident_rules);
