--- crates/rdlt-engine/src/load/lowering.rs
+++ delete ! in lower_schema
@@ -17,17 +17,17 @@
 use rdlt_core::{ColumnDef, ColumnType, LogicalType, RdltError, TableSchema};
 
 pub(crate) fn needs_lowering(caps: &DestCapabilities) -> bool {
     !caps.structs || !caps.decimal
 }
 
 /// Lower a schema for the destination's capabilities.
 pub(crate) fn lower_schema(schema: &TableSchema, caps: &DestCapabilities) -> TableSchema {
-    if !needs_lowering(caps) {
+    if  /* ~ changed by cargo-mutants ~ */needs_lowering(caps) {
         return schema.clone();
     }
     let mut namer = UniqueNamer::new(caps.ident_rules);
     let mut columns: Vec<ColumnDef> = Vec::new();
     for column in &schema.columns {
         lower_column(column, &[], caps, &mut namer, &mut columns);
     }
     TableSchema {
