--- crates/rdlt-engine/src/load/mod.rs
+++ replace += with *= in Loader::process
@@ -156,17 +156,17 @@
                 );
                 self.emit(rdlt_core::PipelineEvent::BatchLoaded {
                     table: table.clone(),
                     rows,
                     bytes,
                 });
                 let entry = self.report.table_mut(&table);
                 entry.rows += rows;
-                entry.bytes += bytes;
+                entry.bytes *= /* ~ changed by cargo-mutants ~ */ bytes;
                 self.counters.rows += rows;
                 self.counters.bytes += bytes;
                 self.bytes_since_commit += bytes;
                 self.dirty = true;
             }
             LoadItem::Checkpoint { stream, cursor } => {
                 self.state.cursors.insert(stream.clone(), cursor.clone());
                 self.report.cursors.insert(stream, cursor);
