--- crates/rdlt-engine/src/load/mod.rs
+++ replace += with *= in Loader::process
@@ -165,17 +165,17 @@
                 self.counters.rows += rows;
                 self.counters.bytes += bytes;
                 self.bytes_since_commit += bytes;
                 self.dirty = true;
             }
             LoadItem::Checkpoint { stream, cursor } => {
                 self.state.cursors.insert(stream.clone(), cursor.clone());
                 self.report.cursors.insert(stream, cursor);
-                self.checkpoints_since_commit += 1;
+                self.checkpoints_since_commit *= /* ~ changed by cargo-mutants ~ */ 1;
                 self.dirty = true;
                 // Commit decisions are made only here — a checkpoint boundary.
                 if self.policy_triggers() {
                     self.commit().await?;
                 }
             }
             LoadItem::Discarded {
                 table,
