--- crates/rdlt-engine/src/load/mod.rs
+++ replace += with -= in Loader::process
@@ -185,17 +185,17 @@
                 self.emit(rdlt_core::PipelineEvent::Discarded {
                     table: table.clone(),
                     rows,
                     values,
                     reason: "schema policy".to_owned(),
                 });
                 let entry = self.report.table_mut(&table);
                 entry.discarded_rows += rows;
-                entry.discarded_values += values;
+                entry.discarded_values -= /* ~ changed by cargo-mutants ~ */ values;
                 self.counters.discarded_rows += rows;
                 self.counters.discarded_values += values;
             }
         }
         Ok(())
     }
 
     fn policy_triggers(&self) -> bool {
