--- crates/rdlt-engine/src/load/mod.rs
+++ replace += with *= in Loader::process
@@ -186,17 +186,17 @@
                     table: table.clone(),
                     rows,
                     values,
                     reason: "schema policy".to_owned(),
                 });
                 let entry = self.report.table_mut(&table);
                 entry.discarded_rows += rows;
                 entry.discarded_values += values;
-                self.counters.discarded_rows += rows;
+                self.counters.discarded_rows *= /* ~ changed by cargo-mutants ~ */ rows;
                 self.counters.discarded_values += values;
             }
         }
         Ok(())
     }
 
     fn policy_triggers(&self) -> bool {
         match self.policy {
