--- crates/rdlt-engine/src/load/mod.rs
+++ replace += with -= in Loader::process
@@ -187,17 +187,17 @@
                     rows,
                     values,
                     reason: "schema policy".to_owned(),
                 });
                 let entry = self.report.table_mut(&table);
                 entry.discarded_rows += rows;
                 entry.discarded_values += values;
                 self.counters.discarded_rows += rows;
-                self.counters.discarded_values += values;
+                self.counters.discarded_values -= /* ~ changed by cargo-mutants ~ */ values;
             }
         }
         Ok(())
     }
 
     fn policy_triggers(&self) -> bool {
         match self.policy {
             CommitPolicy::EveryCheckpoints(n) => self.checkpoints_since_commit >= n.max(1),
