--- crates/rdlt-engine/src/load/mod.rs
+++ replace >= with < in Loader::policy_triggers
@@ -195,17 +195,17 @@
                 self.counters.discarded_values += values;
             }
         }
         Ok(())
     }
 
     fn policy_triggers(&self) -> bool {
         match self.policy {
-            CommitPolicy::EveryCheckpoints(n) => self.checkpoints_since_commit >= n.max(1),
+            CommitPolicy::EveryCheckpoints(n) => self.checkpoints_since_commit < /* ~ changed by cargo-mutants ~ */ n.max(1),
             CommitPolicy::EveryBytes(bytes) => self.bytes_since_commit >= bytes,
             CommitPolicy::EverySeconds(secs) => {
                 self.last_commit_at.elapsed().as_secs() >= u64::from(secs)
             }
         }
     }
 
     /// Trailing work (rows after the last checkpoint, or a run that never
