--- crates/rdlt-engine/src/load/mod.rs
+++ replace >= with < in Loader::policy_triggers
@@ -196,17 +196,17 @@
             }
         }
         Ok(())
     }
 
     fn policy_triggers(&self) -> bool {
         match self.policy {
             CommitPolicy::EveryCheckpoints(n) => self.checkpoints_since_commit >= n.max(1),
-            CommitPolicy::EveryBytes(bytes) => self.bytes_since_commit >= bytes,
+            CommitPolicy::EveryBytes(bytes) => self.bytes_since_commit < /* ~ changed by cargo-mutants ~ */ bytes,
             CommitPolicy::EverySeconds(secs) => {
                 self.last_commit_at.elapsed().as_secs() >= u64::from(secs)
             }
         }
     }
 
     /// Trailing work (rows after the last checkpoint, or a run that never
     /// checkpointed) gets one final commit; a clean no-op run still commits once so a
