--- crates/rdlt-engine/src/load/mod.rs
+++ replace || with && in Loader::finish
@@ -207,17 +207,17 @@
             }
         }
     }
 
     /// Trailing work (rows after the last checkpoint, or a run that never
     /// checkpointed) gets one final commit; a clean no-op run still commits once so a
     /// fresh pipeline's state document exists.
     pub(crate) async fn finish(&mut self) -> Result<(), RdltError> {
-        if self.dirty || self.commit_seq == 0 {
+        if self.dirty && /* ~ changed by cargo-mutants ~ */ self.commit_seq == 0 {
             self.commit().await?;
         }
         Ok(())
     }
 
     async fn commit(&mut self) -> Result<(), RdltError> {
         self.commit_seq += 1;
         self.state.last_commit = Some(rdlt_core::LastCommit {
