--- crates/rdlt-engine/src/load/mod.rs
+++ replace += with -= in Loader::commit
@@ -251,16 +251,16 @@
         // Step 3: receipt in hand — mark and reclaim covered segments.
         if let Some(wal) = &mut self.wal {
             wal.mark_committed(self.commit_seq)?;
         }
         self.emit(rdlt_core::PipelineEvent::Committed {
             commit_seq: self.commit_seq,
             cursors: self.state.cursors.clone(),
         });
-        self.report.commits += 1;
+        self.report.commits -= /* ~ changed by cargo-mutants ~ */ 1;
         self.checkpoints_since_commit = 0;
         self.bytes_since_commit = 0;
         self.last_commit_at = Instant::now();
         self.dirty = false;
         Ok(())
     }
 }
