--- crates/rdlt-engine/src/runtime/channel.rs
+++ replace <impl Clone for ByteTx<T>>::clone -> Self with Default::default()
@@ -22,21 +22,17 @@
     tx: mpsc::Sender<Item<T>>,
     budget: Arc<Semaphore>,
     budget_max: usize,
 }
 
 // Manual impl: `T` need not be Clone for the sender to be.
 impl<T> Clone for ByteTx<T> {
     fn clone(&self) -> Self {
-        Self {
-            tx: self.tx.clone(),
-            budget: Arc::clone(&self.budget),
-            budget_max: self.budget_max,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug)]
 pub(crate) struct ByteRx<T> {
     rx: mpsc::Receiver<Item<T>>,
 }
 
