--- crates/rdlt-engine/src/runtime/graph.rs
+++ delete ! in run_once
@@ -129,17 +129,17 @@
         let table = TableName::new(normalize_ident(spec.name.as_str(), caps.ident_rules));
         if let Some(owner) = root_tables.insert(table.clone(), spec.name.clone()) {
             // Clause E2: exactly one stream owns a table.
             return Err(RdltError::config(format!(
                 "streams `{owner}` and `{}` both map to table `{table}`",
                 spec.name
             )));
         }
-        if matches!(config.mode_for(&spec.name), WriteMode::Merge { .. }) && !caps.merge {
+        if matches!(config.mode_for(&spec.name), WriteMode::Merge { .. }) &&  /* ~ changed by cargo-mutants ~ */caps.merge {
             return Err(RdltError::config(format!(
                 "stream `{}` requests Merge but destination `{}` does not support it",
                 spec.name,
                 destination.spec().name
             )));
         }
         // Clause B4: structured streams carry no per-row identity — Merge cannot
         // deduplicate. Rejected here, at plan time, before the destination opens.
