--- crates/rdlt-engine/src/runtime/graph.rs
+++ replace && with || in run_once
@@ -138,17 +138,17 @@
             return Err(RdltError::config(format!(
                 "stream `{}` requests Merge but destination `{}` does not support it",
                 spec.name,
                 destination.spec().name
             )));
         }
         // Clause B4: structured streams carry no per-row identity — Merge cannot
         // deduplicate. Rejected here, at plan time, before the destination opens.
-        if spec.structured && matches!(config.mode_for(&spec.name), WriteMode::Merge { .. }) {
+        if spec.structured || /* ~ changed by cargo-mutants ~ */ matches!(config.mode_for(&spec.name), WriteMode::Merge { .. }) {
             return Err(RdltError::config(format!(
                 "stream `{}` is structured (Arrow passthrough, no per-row identity) \
                  and cannot use Merge (contract clause B4); use Append or Replace",
                 spec.name
             )));
         }
     }
 
