--- crates/rdlt-engine/src/runtime/graph.rs
+++ replace run -> Result<RunReport, RdltError> with Ok(Default::default())
@@ -57,57 +57,17 @@
 /// only the caller's token (`cancel`) survives across attempts.
 pub(crate) async fn run(
     config: EngineConfig,
     source: Arc<dyn Source>,
     destination: Arc<dyn Destination>,
     cancel: CancellationToken,
     events: tokio::sync::broadcast::Sender<rdlt_core::PipelineEvent>,
 ) -> Result<RunReport, RdltError> {
-    let mut attempt: u32 = 0;
-    let mut retries: u64 = 0;
-    loop {
-        let attempt_cancel = cancel.child_token();
-        let result = run_once(
-            &config,
-            Arc::clone(&source),
-            Arc::clone(&destination),
-            attempt_cancel,
-            events.clone(),
-            retries,
-        )
-        .await;
-        match result {
-            Err(RdltError::Source {
-                stream,
-                message,
-                retryable: true,
-                retry_after_ms,
-            }) if attempt + 1 < MAX_SOURCE_ATTEMPTS && !cancel.is_cancelled() => {
-                attempt += 1;
-                retries += 1;
-                let delay = retry_after_ms
-                    .map(std::time::Duration::from_millis)
-                    .unwrap_or_else(|| backoff(attempt));
-                tracing::warn!(
-                    stream = %stream, attempt, %message,
-                    "transient source failure; restarting run from committed state"
-                );
-                let _ = events.send(rdlt_core::PipelineEvent::Retried {
-                    stream: Some(stream),
-                    attempt,
-                });
-                tokio::select! {
-                    _ = tokio::time::sleep(delay) => {}
-                    _ = cancel.cancelled() => return Err(RdltError::Cancelled),
-                }
-            }
-            other => return other,
-        }
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 async fn run_once(
     config: &EngineConfig,
     source: Arc<dyn Source>,
     destination: Arc<dyn Destination>,
     cancel: CancellationToken,
     events: tokio::sync::broadcast::Sender<rdlt_core::PipelineEvent>,
