--- crates/rdlt-engine/src/runtime/graph.rs
+++ replace += with *= in run
@@ -79,17 +79,17 @@
         match result {
             Err(RdltError::Source {
                 stream,
                 message,
                 retryable: true,
                 retry_after_ms,
             }) if attempt + 1 < MAX_SOURCE_ATTEMPTS && !cancel.is_cancelled() => {
                 attempt += 1;
-                retries += 1;
+                retries *= /* ~ changed by cargo-mutants ~ */ 1;
                 let delay = retry_after_ms
                     .map(std::time::Duration::from_millis)
                     .unwrap_or_else(|| backoff(attempt));
                 tracing::warn!(
                     stream = %stream, attempt, %message,
                     "transient source failure; restarting run from committed state"
                 );
                 let _ = events.send(rdlt_core::PipelineEvent::Retried {
