--- crates/rdlt-engine/src/schema/contracts.rs
+++ replace value_fits -> bool with true
@@ -8,33 +8,17 @@
 use rdlt_core::{ColumnType, ContractViolation, LogicalType, SchemaChange, TableName};
 
 use crate::shred::canon::parse_timestamp_tz;
 use crate::shred::view::{JsonView, Kind};
 
 /// Does `value` conform to `ty` without requiring any schema change?
 /// (`true` = storable as-is; `false` = this value is what forced the widening.)
 pub(crate) fn value_fits<'a, V: JsonView<'a>>(value: V, ty: &ColumnType) -> bool {
-    match (value.kind(), ty) {
-        (Kind::Null, _) => true,
-        (_, ColumnType::Scalar { scalar }) => scalar_fits(value, *scalar),
-        (Kind::Object, ColumnType::Struct { fields }) => {
-            value
-                .obj_entries()
-                .all(|(key, item)| match fields.iter().find(|f| f.name == key) {
-                    Some(field) => value_fits(item, &field.ty),
-                    None => item.is_null(), // a new nested field forced an evolution
-                })
-        }
-        (Kind::Array, ColumnType::ScalarList { item }) => {
-            let ty = ColumnType::scalar(*item);
-            value.arr_items().all(|i| value_fits(i, &ty))
-        }
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn scalar_fits<'a, V: JsonView<'a>>(value: V, scalar: LogicalType) -> bool {
     let kind = value.kind();
     match scalar {
         LogicalType::Json => true, // Json holds anything
         LogicalType::Bool => matches!(kind, Kind::Bool(_)),
         LogicalType::Int64 => matches!(kind, Kind::Int(_)),
