--- crates/rdlt-engine/src/schema/contracts.rs
+++ delete match arm (Kind::Null, _) in value_fits
@@ -9,17 +9,17 @@
 
 use crate::shred::canon::parse_timestamp_tz;
 use crate::shred::view::{JsonView, Kind};
 
 /// Does `value` conform to `ty` without requiring any schema change?
 /// (`true` = storable as-is; `false` = this value is what forced the widening.)
 pub(crate) fn value_fits<'a, V: JsonView<'a>>(value: V, ty: &ColumnType) -> bool {
     match (value.kind(), ty) {
-        (Kind::Null, _) => true,
+         /* ~ changed by cargo-mutants ~ */
         (_, ColumnType::Scalar { scalar }) => scalar_fits(value, *scalar),
         (Kind::Object, ColumnType::Struct { fields }) => {
             value
                 .obj_entries()
                 .all(|(key, item)| match fields.iter().find(|f| f.name == key) {
                     Some(field) => value_fits(item, &field.ty),
                     None => item.is_null(), // a new nested field forced an evolution
                 })
