--- crates/rdlt-engine/src/schema/contracts.rs
+++ delete match arm (Value::Object(map), ColumnType::Struct{fields}) in value_fits
@@ -11,22 +11,17 @@
 use crate::shred::canon::parse_timestamp_tz;
 
 /// Does `value` conform to `ty` without requiring any schema change?
 /// (`true` = storable as-is; `false` = this value is what forced the widening.)
 pub(crate) fn value_fits(value: &Value, ty: &ColumnType) -> bool {
     match (value, ty) {
         (Value::Null, _) => true,
         (_, ColumnType::Scalar { scalar }) => scalar_fits(value, *scalar),
-        (Value::Object(map), ColumnType::Struct { fields }) => map.iter().all(|(key, item)| {
-            match fields.iter().find(|f| &f.name == key) {
-                Some(field) => value_fits(item, &field.ty),
-                None => item.is_null(), // a new nested field forced an evolution
-            }
-        }),
+         /* ~ changed by cargo-mutants ~ */
         (Value::Array(items), ColumnType::ScalarList { item }) => {
             let ty = ColumnType::scalar(*item);
             items.iter().all(|i| value_fits(i, &ty))
         }
         _ => false,
     }
 }
 
