--- crates/rdlt-engine/src/schema/contracts.rs
+++ delete match arm (Value::Array(items), ColumnType::ScalarList{item}) in value_fits
@@ -17,20 +17,17 @@
         (Value::Null, _) => true,
         (_, ColumnType::Scalar { scalar }) => scalar_fits(value, *scalar),
         (Value::Object(map), ColumnType::Struct { fields }) => map.iter().all(|(key, item)| {
             match fields.iter().find(|f| &f.name == key) {
                 Some(field) => value_fits(item, &field.ty),
                 None => item.is_null(), // a new nested field forced an evolution
             }
         }),
-        (Value::Array(items), ColumnType::ScalarList { item }) => {
-            let ty = ColumnType::scalar(*item);
-            items.iter().all(|i| value_fits(i, &ty))
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 fn scalar_fits(value: &Value, scalar: LogicalType) -> bool {
     match scalar {
         LogicalType::Json => true, // Json holds anything
         LogicalType::Bool => value.is_boolean(),
