--- crates/rdlt-engine/src/schema/contracts.rs
+++ replace scalar_fits -> bool with false
@@ -28,41 +28,17 @@
             let ty = ColumnType::scalar(*item);
             value.arr_items().all(|i| value_fits(i, &ty))
         }
         _ => false,
     }
 }
 
 fn scalar_fits<'a, V: JsonView<'a>>(value: V, scalar: LogicalType) -> bool {
-    let kind = value.kind();
-    match scalar {
-        LogicalType::Json => true, // Json holds anything
-        LogicalType::Bool => matches!(kind, Kind::Bool(_)),
-        LogicalType::Int64 => matches!(kind, Kind::Int(_)),
-        LogicalType::Float64 => match kind {
-            Kind::Int(i) => int64_fits_in_f64(i),
-            Kind::Float(_) => true,
-            _ => false,
-        },
-        // Utf8 absorbs every textable scalar (canonical renderings).
-        LogicalType::Utf8 | LogicalType::Uuid => matches!(
-            kind,
-            Kind::Str(_) | Kind::Int(_) | Kind::UInt(_) | Kind::Float(_) | Kind::Bool(_)
-        ),
-        LogicalType::TimestampTz => match kind {
-            Kind::Str(s) => parse_timestamp_tz(s).is_some(),
-            _ => false,
-        },
-        LogicalType::TimestampNaive | LogicalType::Date | LogicalType::Time => {
-            matches!(kind, Kind::Str(_))
-        }
-        LogicalType::Decimal { .. } => matches!(kind, Kind::Int(_) | Kind::Str(_)),
-        LogicalType::Binary => false, // not producible from JSON
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Build the typed violation for a frozen change.
 pub(crate) fn violation_for(table: &TableName, change: &SchemaChange) -> ContractViolation {
     match change {
         SchemaChange::CreateTable { .. } => ContractViolation {
             table: table.clone(),
             column: None,
