--- crates/rdlt-engine/src/schema/contracts.rs
+++ delete match arm Value::Number(n) in scalar_fits
@@ -31,17 +31,17 @@
 }
 
 fn scalar_fits(value: &Value, scalar: LogicalType) -> bool {
     match scalar {
         LogicalType::Json => true, // Json holds anything
         LogicalType::Bool => value.is_boolean(),
         LogicalType::Int64 => value.as_i64().is_some(),
         LogicalType::Float64 => match value {
-            Value::Number(n) => n.as_i64().map(int64_fits_in_f64).unwrap_or(n.is_f64()),
+             /* ~ changed by cargo-mutants ~ */
             _ => false,
         },
         // Utf8 absorbs every textable scalar (canonical renderings).
         LogicalType::Utf8 | LogicalType::Uuid => {
             matches!(value, Value::String(_) | Value::Number(_) | Value::Bool(_))
         }
         LogicalType::TimestampTz => value
             .as_str()
