--- crates/rdlt-engine/src/schema/contracts.rs
+++ delete match arm Kind::Float(_) in scalar_fits
@@ -35,17 +35,17 @@
 fn scalar_fits<'a, V: JsonView<'a>>(value: V, scalar: LogicalType) -> bool {
     let kind = value.kind();
     match scalar {
         LogicalType::Json => true, // Json holds anything
         LogicalType::Bool => matches!(kind, Kind::Bool(_)),
         LogicalType::Int64 => matches!(kind, Kind::Int(_)),
         LogicalType::Float64 => match kind {
             Kind::Int(i) => int64_fits_in_f64(i),
-            Kind::Float(_) => true,
+             /* ~ changed by cargo-mutants ~ */
             _ => false,
         },
         // Utf8 absorbs every textable scalar (canonical renderings).
         LogicalType::Utf8 | LogicalType::Uuid => matches!(
             kind,
             Kind::Str(_) | Kind::Int(_) | Kind::UInt(_) | Kind::Float(_) | Kind::Bool(_)
         ),
         LogicalType::TimestampTz => match kind {
