--- crates/rdlt-engine/src/schema/contracts.rs
+++ delete match arm Kind::Str(s) in scalar_fits
@@ -44,17 +44,17 @@
             _ => false,
         },
         // Utf8 absorbs every textable scalar (canonical renderings).
         LogicalType::Utf8 | LogicalType::Uuid => matches!(
             kind,
             Kind::Str(_) | Kind::Int(_) | Kind::UInt(_) | Kind::Float(_) | Kind::Bool(_)
         ),
         LogicalType::TimestampTz => match kind {
-            Kind::Str(s) => parse_timestamp_tz(s).is_some(),
+             /* ~ changed by cargo-mutants ~ */
             _ => false,
         },
         LogicalType::TimestampNaive | LogicalType::Date | LogicalType::Time => {
             matches!(kind, Kind::Str(_))
         }
         LogicalType::Decimal { .. } => matches!(kind, Kind::Int(_) | Kind::Str(_)),
         LogicalType::Binary => false, // not producible from JSON
     }
