--- crates/rdlt-engine/src/schema/contracts.rs
+++ delete match arm ColumnType::Scalar{scalar} in scalar_of
@@ -84,17 +84,17 @@
             from: scalar_of(from),
             to: scalar_of(to),
         },
     }
 }
 
 fn scalar_of(ty: &ColumnType) -> Option<LogicalType> {
     match ty {
-        ColumnType::Scalar { scalar } => Some(*scalar),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 /// The column a change concerns, for policy resolution (None = table-level).
 pub(crate) fn change_column(change: &SchemaChange) -> Option<&str> {
     match change {
         SchemaChange::CreateTable { .. } => None,
