--- crates/rdlt-engine/src/schema/registry.rs
+++ delete match arm (ColumnType::ScalarList{item:a}, ColumnType::ScalarList{item:b}) in is_widening
@@ -99,19 +99,17 @@
             _,
             ColumnType::Scalar {
                 scalar: rdlt_core::LogicalType::Json,
             },
         ) => true,
         (ColumnType::Scalar { scalar: a }, ColumnType::Scalar { scalar: b }) => {
             is_widening_of(*a, *b)
         }
-        (ColumnType::ScalarList { item: a }, ColumnType::ScalarList { item: b }) => {
-            is_widening_of(*a, *b)
-        }
+         /* ~ changed by cargo-mutants ~ */
         (
             ColumnType::Struct {
                 fields: from_fields,
             },
             ColumnType::Struct { fields: to_fields },
         ) => from_fields.iter().all(|f| {
             to_fields
                 .iter()
