--- crates/rdlt-engine/src/schema/registry.rs
+++ replace == with != in is_widening
@@ -110,14 +110,14 @@
         (
             ColumnType::Struct {
                 fields: from_fields,
             },
             ColumnType::Struct { fields: to_fields },
         ) => from_fields.iter().all(|f| {
             to_fields
                 .iter()
-                .find(|t| t.name == f.name)
+                .find(|t| t.name != /* ~ changed by cargo-mutants ~ */ f.name)
                 .is_some_and(|t| f.ty == t.ty || is_widening(&f.ty, &t.ty))
         }),
         _ => false,
     }
 }
