--- crates/rdlt-engine/src/schema/registry.rs
+++ replace match guard existing.ty != column.ty with true in SchemaRegistry::diff
@@ -52,17 +52,17 @@
         };
 
         let mut changes = Vec::new();
         for column in &observed.columns {
             match current.column(&column.name) {
                 None => changes.push(SchemaChange::AddColumn {
                     column: column.clone(),
                 }),
-                Some(existing) if existing.ty != column.ty => {
+                Some(existing) if true /* ~ changed by cargo-mutants ~ */ => {
                     debug_assert!(
                         is_widening(&existing.ty, &column.ty),
                         "schema regression on {}.{}: {:?} -> {:?}",
                         table,
                         column.name,
                         existing.ty,
                         column.ty
                     );
