--- crates/rdlt-engine/src/shred/arena.rs
+++ replace Node<'a, 's>::id -> NodeId with Default::default()
@@ -103,17 +103,17 @@
 #[derive(Clone, Copy)]
 pub(crate) struct Node<'a, 's> {
     arena: &'a Arena<'s>,
     id: NodeId,
 }
 
 impl<'a, 's> Node<'a, 's> {
     pub(crate) fn id(&self) -> NodeId {
-        self.id
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Debug for Node<'_, '_> {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         write!(f, "Node({})", self.id)
     }
 }
