--- crates/rdlt-engine/src/shred/arena.rs
+++ replace <impl JsonView<'a> for Node<'a, 's>>::kind -> Kind<'a> with Default::default()
@@ -118,26 +118,17 @@
     }
 }
 
 impl<'a, 's: 'a> JsonView<'a> for Node<'a, 's> {
     type ObjIter = ObjIter<'a, 's>;
     type ArrIter = ArrIter<'a, 's>;
 
     fn kind(self) -> Kind<'a> {
-        match &self.arena.nodes[self.id as usize] {
-            ANode::Null => Kind::Null,
-            ANode::Bool(b) => Kind::Bool(*b),
-            ANode::Int(i) => Kind::Int(*i),
-            ANode::UInt(u) => Kind::UInt(*u),
-            ANode::Float(f) => Kind::Float(*f),
-            ANode::Str(s) => Kind::Str(s.as_ref()),
-            ANode::Obj(..) => Kind::Object,
-            ANode::Arr(..) => Kind::Array,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn obj_entries(self) -> Self::ObjIter {
         let (start, end) = match self.arena.nodes[self.id as usize] {
             ANode::Obj(start, end) => (start, end),
             _ => (0, 0),
         };
         ObjIter {
