--- crates/rdlt-engine/src/shred/arena.rs
+++ delete match arm ANode::Obj(start, end) in <impl JsonView<'a> for Node<'a, 's>>::obj_entries
@@ -132,17 +132,17 @@
             ANode::Str(s) => Kind::Str(s.as_ref()),
             ANode::Obj(..) => Kind::Object,
             ANode::Arr(..) => Kind::Array,
         }
     }
 
     fn obj_entries(self) -> Self::ObjIter {
         let (start, end) = match self.arena.nodes[self.id as usize] {
-            ANode::Obj(start, end) => (start, end),
+             /* ~ changed by cargo-mutants ~ */
             _ => (0, 0),
         };
         ObjIter {
             arena: self.arena,
             next: start,
             end,
         }
     }
