--- crates/rdlt-engine/src/shred/arena.rs
+++ replace <impl JsonView<'a> for Node<'a, 's>>::arr_items -> Self::ArrIter with Default::default()
@@ -143,25 +143,17 @@
         ObjIter {
             arena: self.arena,
             next: start,
             end,
         }
     }
 
     fn arr_items(self) -> Self::ArrIter {
-        let (start, end) = match self.arena.nodes[self.id as usize] {
-            ANode::Arr(start, end) => (start, end),
-            _ => (0, 0),
-        };
-        ArrIter {
-            arena: self.arena,
-            next: start,
-            end,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn obj_get(self, key: &str) -> Option<Self> {
         let ANode::Obj(start, end) = self.arena.nodes[self.id as usize] else {
             return None;
         };
         self.arena.obj_entries[start as usize..end as usize]
             .iter()
