--- crates/rdlt-engine/src/shred/arena.rs
+++ replace <impl JsonView<'a> for Node<'a, 's>>::obj_get -> Option<Self> with None
@@ -155,23 +155,17 @@
         ArrIter {
             arena: self.arena,
             next: start,
             end,
         }
     }
 
     fn obj_get(self, key: &str) -> Option<Self> {
-        let ANode::Obj(start, end) = self.arena.nodes[self.id as usize] else {
-            return None;
-        };
-        self.arena.obj_entries[start as usize..end as usize]
-            .iter()
-            .find(|(k, _)| k.as_ref() == key)
-            .map(|(_, id)| self.arena.node(*id))
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(crate) struct ObjIter<'a, 's> {
     arena: &'a Arena<'s>,
     next: u32,
     end: u32,
 }
