--- crates/rdlt-engine/src/shred/arena.rs
+++ replace += with -= in <impl Iterator for ObjIter<'a, 's>>::next
@@ -178,17 +178,17 @@
 
 impl<'a, 's: 'a> Iterator for ObjIter<'a, 's> {
     type Item = (&'a str, Node<'a, 's>);
     fn next(&mut self) -> Option<Self::Item> {
         if self.next >= self.end {
             return None;
         }
         let (key, id) = &self.arena.obj_entries[self.next as usize];
-        self.next += 1;
+        self.next -= /* ~ changed by cargo-mutants ~ */ 1;
         Some((key.as_ref(), self.arena.node(*id)))
     }
 }
 
 pub(crate) struct ArrIter<'a, 's> {
     arena: &'a Arena<'s>,
     next: u32,
     end: u32,
