--- crates/rdlt-engine/src/shred/arena.rs
+++ replace >= with < in <impl Iterator for ArrIter<'a, 's>>::next
@@ -192,17 +192,17 @@
     arena: &'a Arena<'s>,
     next: u32,
     end: u32,
 }
 
 impl<'a, 's: 'a> Iterator for ArrIter<'a, 's> {
     type Item = Node<'a, 's>;
     fn next(&mut self) -> Option<Self::Item> {
-        if self.next >= self.end {
+        if self.next < /* ~ changed by cargo-mutants ~ */ self.end {
             return None;
         }
         let id = self.arena.arr_items[self.next as usize];
         self.next += 1;
         Some(self.arena.node(id))
     }
 }
 
