--- crates/rdlt-engine/src/shred/arena.rs
+++ replace += with *= in <impl Iterator for ArrIter<'a, 's>>::next
@@ -196,17 +196,17 @@
 
 impl<'a, 's: 'a> Iterator for ArrIter<'a, 's> {
     type Item = Node<'a, 's>;
     fn next(&mut self) -> Option<Self::Item> {
         if self.next >= self.end {
             return None;
         }
         let id = self.arena.arr_items[self.next as usize];
-        self.next += 1;
+        self.next *= /* ~ changed by cargo-mutants ~ */ 1;
         Some(self.arena.node(id))
     }
 }
 
 // ---- serde construction ----
 
 struct NodeSeed<'a, 's> {
     arena: &'a mut Arena<'s>,
