--- crates/rdlt-engine/src/shred/arena.rs
+++ replace <impl Visitor<'de> for NodeVisitor<'a, 's>>::visit_borrowed_str -> Result<NodeId, E> with Ok(Default::default())
@@ -261,17 +261,17 @@
         }))
     }
 
     fn visit_f64<E>(self, f: f64) -> Result<NodeId, E> {
         Ok(self.arena.push_node(ANode::Float(f)))
     }
 
     fn visit_borrowed_str<E>(self, s: &'de str) -> Result<NodeId, E> {
-        Ok(self.arena.push_node(ANode::Str(Cow::Borrowed(s))))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn visit_str<E>(self, s: &str) -> Result<NodeId, E> {
         Ok(self.arena.push_node(ANode::Str(Cow::Owned(s.to_owned()))))
     }
 
     fn visit_string<E>(self, s: String) -> Result<NodeId, E> {
         Ok(self.arena.push_node(ANode::Str(Cow::Owned(s))))
