--- crates/rdlt-engine/src/shred/arena.rs
+++ replace <impl Visitor<'de> for NodeVisitor<'a, 's>>::visit_str -> Result<NodeId, E> with Ok(Default::default())
@@ -265,17 +265,17 @@
         Ok(self.arena.push_node(ANode::Float(f)))
     }
 
     fn visit_borrowed_str<E>(self, s: &'de str) -> Result<NodeId, E> {
         Ok(self.arena.push_node(ANode::Str(Cow::Borrowed(s))))
     }
 
     fn visit_str<E>(self, s: &str) -> Result<NodeId, E> {
-        Ok(self.arena.push_node(ANode::Str(Cow::Owned(s.to_owned()))))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn visit_string<E>(self, s: String) -> Result<NodeId, E> {
         Ok(self.arena.push_node(ANode::Str(Cow::Owned(s))))
     }
 
     fn visit_seq<A>(self, mut seq: A) -> Result<NodeId, A::Error>
     where
