--- crates/rdlt-engine/src/shred/arena.rs
+++ replace <impl Visitor<'de> for NodeVisitor<'a, 's>>::visit_map -> Result<NodeId, A::Error> with Ok(Default::default())
@@ -291,28 +291,17 @@
         Ok(self.arena.push_node(ANode::Arr(start, end)))
     }
 
     fn visit_map<A>(self, mut map: A) -> Result<NodeId, A::Error>
     where
         A: MapAccess<'de>,
     {
         // IndexMap insert semantics AT PARSE TIME: first position, last value.
-        let mut entries: Vec<(Cow<'s, str>, NodeId)> = Vec::new();
-        while let Some(key) = map.next_key_seed(KeySeed(PhantomData))? {
-            let value = map.next_value_seed(NodeSeed { arena: self.arena })?;
-            match entries.iter_mut().find(|(k, _)| *k == key) {
-                Some((_, slot)) => *slot = value,
-                None => entries.push((key, value)),
-            }
-        }
-        let start = self.arena.obj_entries.len() as u32;
-        self.arena.obj_entries.extend(entries);
-        let end = self.arena.obj_entries.len() as u32;
-        Ok(self.arena.push_node(ANode::Obj(start, end)))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 struct KeySeed<'s>(PhantomData<&'s ()>);
 
 impl<'de, 's: 'de> DeserializeSeed<'de> for KeySeed<'s>
 where
     'de: 's,
