--- crates/rdlt-engine/src/shred/arena.rs
+++ replace <impl DeserializeSeed<'de> for KeySeed<'s>>::deserialize -> Result<Self::Value, D::Error> with Ok(Default::default())
@@ -318,36 +318,17 @@
     'de: 's,
 {
     type Value = Cow<'s, str>;
 
     fn deserialize<D>(self, deserializer: D) -> Result<Self::Value, D::Error>
     where
         D: serde::Deserializer<'de>,
     {
-        struct V<'s>(PhantomData<&'s ()>);
-        impl<'de, 's: 'de> Visitor<'de> for V<'s>
-        where
-            'de: 's,
-        {
-            type Value = Cow<'s, str>;
-            fn expecting(&self, f: &mut fmt::Formatter) -> fmt::Result {
-                f.write_str("an object key")
-            }
-            fn visit_borrowed_str<E>(self, s: &'de str) -> Result<Self::Value, E> {
-                Ok(Cow::Borrowed(s))
-            }
-            fn visit_str<E>(self, s: &str) -> Result<Self::Value, E> {
-                Ok(Cow::Owned(s.to_owned()))
-            }
-            fn visit_string<E>(self, s: String) -> Result<Self::Value, E> {
-                Ok(Cow::Owned(s))
-            }
-        }
-        deserializer.deserialize_str(V(PhantomData))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::shred::canon::canonical_json_bytes;
     use serde_json::Value;
