--- crates/rdlt-engine/src/shred/arena.rs
+++ replace <impl DeserializeSeed<'de> for KeySeed<'s>>::deserialize::<impl Visitor<'de> for V<'s>>::expecting -> fmt::Result with Ok(Default::default())
@@ -325,17 +325,17 @@
     {
         struct V<'s>(PhantomData<&'s ()>);
         impl<'de, 's: 'de> Visitor<'de> for V<'s>
         where
             'de: 's,
         {
             type Value = Cow<'s, str>;
             fn expecting(&self, f: &mut fmt::Formatter) -> fmt::Result {
-                f.write_str("an object key")
+                Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
             }
             fn visit_borrowed_str<E>(self, s: &'de str) -> Result<Self::Value, E> {
                 Ok(Cow::Borrowed(s))
             }
             fn visit_str<E>(self, s: &str) -> Result<Self::Value, E> {
                 Ok(Cow::Owned(s.to_owned()))
             }
             fn visit_string<E>(self, s: String) -> Result<Self::Value, E> {
