--- crates/rdlt-engine/src/shred/arena.rs
+++ replace Arena<'s>::node -> Node<'_, 's> with Default::default()
@@ -84,17 +84,17 @@
     /// `{"value": <node>}` — for bare-scalar/array rows and scalar child items.
     pub(crate) fn wrap_in_value_obj(&mut self, node: NodeId) -> NodeId {
         let start = self.obj_entries.len() as u32;
         self.obj_entries.push((Cow::Borrowed("value"), node));
         self.push_node(ANode::Obj(start, start + 1))
     }
 
     pub(crate) fn node(&self, id: NodeId) -> Node<'_, 's> {
-        Node { arena: self, id }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn push_node(&mut self, node: ANode<'s>) -> NodeId {
         let id = self.nodes.len() as u32;
         self.nodes.push(node);
         id
     }
 }
