--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm system_columns::ROOT_ID in build_batch
@@ -98,30 +98,17 @@
                             id.write_hex(&mut hex);
                             b.append_value(std::str::from_utf8(&hex).expect("hex is ASCII"));
                         }
                         None => b.append_null(),
                     }
                 }
                 Arc::new(b.finish())
             }
-            system_columns::ROOT_ID => {
-                let mut b = StringBuilder::new();
-                let mut hex = [0u8; 64];
-                for row in rows {
-                    match &row.root_id {
-                        Some(id) => {
-                            id.write_hex(&mut hex);
-                            b.append_value(std::str::from_utf8(&hex).expect("hex is ASCII"));
-                        }
-                        None => b.append_null(),
-                    }
-                }
-                Arc::new(b.finish())
-            }
+             /* ~ changed by cargo-mutants ~ */
             system_columns::POS => {
                 let mut b = Int64Builder::new();
                 for row in rows {
                     match row.pos {
                         Some(pos) => b.append_value(pos as i64),
                         None => b.append_null(),
                     }
                 }
