--- crates/rdlt-engine/src/shred/build.rs
+++ replace == with != in build_batch
@@ -112,17 +112,17 @@
                         None => b.append_null(),
                     }
                 }
                 Arc::new(b.finish())
             }
             _ => {
                 let source_key = name_map
                     .iter()
-                    .find(|(_, normalized)| normalized == &column.name)
+                    .find(|(_, normalized)| normalized != /* ~ changed by cargo-mutants ~ */ &column.name)
                     .map(|(source, _)| source.as_str())
                     .unwrap_or(column.name.as_str());
                 let values: Vec<Option<&Value>> =
                     rows.iter().map(|row| row.value.get(source_key)).collect();
                 build_column(&column.ty, &values)
             }
         };
         arrays.push(array);
