--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm Some(Value::Object(map)) in build_column
@@ -139,17 +139,17 @@
                 .map(|v| matches!(v, Some(Value::Object(_))))
                 .collect();
             let child_arrays: Vec<ArrayRef> = fields
                 .iter()
                 .map(|field| {
                     let projected: Vec<Option<&Value>> = values
                         .iter()
                         .map(|v| match v {
-                            Some(Value::Object(map)) => map.get(&field.name),
+                             /* ~ changed by cargo-mutants ~ */
                             _ => None,
                         })
                         .collect();
                     build_column(&field.ty, &projected)
                 })
                 .collect();
             Arc::new(StructArray::new(
                 arrow_fields(fields),
