--- crates/rdlt-engine/src/shred/build.rs
+++ replace match guard v.is_array() with true in build_column
@@ -172,17 +172,17 @@
         }
         ColumnType::ScalarList { item } => {
             let mut offsets: Vec<i32> = Vec::with_capacity(values.len() + 1);
             offsets.push(0);
             let mut flat: Vec<Option<V>> = Vec::new();
             let mut validity: Vec<bool> = Vec::with_capacity(values.len());
             for value in values {
                 match value {
-                    Some(v) if v.is_array() => {
+                    Some(v) if true /* ~ changed by cargo-mutants ~ */ => {
                         flat.extend(v.arr_items().map(Some));
                         validity.push(true);
                     }
                     _ => validity.push(value.is_some()),
                 }
                 offsets.push(flat.len() as i32);
             }
             let item_array = build_scalar(*item, &flat);
