--- crates/rdlt-engine/src/shred/build.rs
+++ replace build_scalar -> ArrayRef with Default::default()
@@ -179,136 +179,17 @@
                 item_array,
                 Some(NullBuffer::from(validity)),
             ))
         }
     }
 }
 
 fn build_scalar(ty: LogicalType, values: &[Option<&Value>]) -> ArrayRef {
-    match ty {
-        LogicalType::Bool => {
-            let mut b = BooleanBuilder::new();
-            for v in values {
-                b.append_option(v.and_then(|v| v.as_bool()));
-            }
-            Arc::new(b.finish())
-        }
-        LogicalType::Int64 => {
-            let mut b = Int64Builder::new();
-            for v in values {
-                b.append_option(v.and_then(|v| v.as_i64()));
-            }
-            Arc::new(b.finish())
-        }
-        LogicalType::Float64 => {
-            let mut b = Float64Builder::new();
-            for v in values {
-                b.append_option(v.and_then(|v| v.as_f64()));
-            }
-            Arc::new(b.finish())
-        }
-        LogicalType::Utf8 | LogicalType::Uuid => {
-            let mut b = StringBuilder::new();
-            for v in values {
-                match v.and_then(render_scalar) {
-                    Some(text) => b.append_value(text),
-                    None => b.append_null(),
-                }
-            }
-            Arc::new(b.finish())
-        }
-        LogicalType::Json => {
-            let mut b = StringBuilder::new();
-            for v in values {
-                match v {
-                    Some(value) if !value.is_null() => {
-                        b.append_value(serde_json::to_string(value).expect("Value serialization"))
-                    }
-                    _ => b.append_null(),
-                }
-            }
-            Arc::new(b.finish())
-        }
-        LogicalType::TimestampTz => {
-            let mut b = TimestampMicrosecondBuilder::new();
-            for v in values {
-                let micros = v
-                    .and_then(|v| v.as_str())
-                    .and_then(parse_timestamp_tz)
-                    .and_then(|dt| dt.timestamp_micros().into());
-                b.append_option(micros);
-            }
-            Arc::new(b.finish().with_timezone("+00:00"))
-        }
-        LogicalType::TimestampNaive => {
-            let mut b = TimestampMicrosecondBuilder::new();
-            for v in values {
-                let micros = v.and_then(|v| v.as_str()).and_then(|s| {
-                    chrono::NaiveDateTime::parse_from_str(s, "%Y-%m-%dT%H:%M:%S%.f")
-                        .ok()
-                        .map(|dt| dt.and_utc().timestamp_micros())
-                });
-                b.append_option(micros);
-            }
-            Arc::new(b.finish())
-        }
-        LogicalType::Date => {
-            let mut b = Date32Builder::new();
-            for v in values {
-                let days = v.and_then(|v| v.as_str()).and_then(|s| {
-                    chrono::NaiveDate::parse_from_str(s, "%Y-%m-%d")
-                        .ok()
-                        .map(|d| {
-                            d.signed_duration_since(
-                                chrono::NaiveDate::from_ymd_opt(1970, 1, 1).expect("epoch"),
-                            )
-                            .num_days() as i32
-                        })
-                });
-                b.append_option(days);
-            }
-            Arc::new(b.finish())
-        }
-        LogicalType::Time => {
-            let mut b = Time64MicrosecondBuilder::new();
-            for v in values {
-                let micros = v.and_then(|v| v.as_str()).and_then(|s| {
-                    chrono::NaiveTime::parse_from_str(s, "%H:%M:%S%.f")
-                        .ok()
-                        .map(|t| {
-                            i64::from(chrono::Timelike::num_seconds_from_midnight(&t)) * 1_000_000
-                                + i64::from(chrono::Timelike::nanosecond(&t) / 1_000)
-                        })
-                });
-                b.append_option(micros);
-            }
-            Arc::new(b.finish())
-        }
-        LogicalType::Decimal { precision, scale } => {
-            let mut b = Decimal128Builder::new();
-            for v in values {
-                b.append_option(v.and_then(|v| parse_decimal(v, scale)));
-            }
-            Arc::new(
-                b.finish()
-                    .with_precision_and_scale(precision, scale as i8)
-                    .expect("valid decimal precision/scale by lattice construction"),
-            )
-        }
-        LogicalType::Binary => {
-            // Not producible from JSON inference; hinted Binary without an Arrow-native
-            // source yields nulls (never a silent lossy decode).
-            let mut b = BinaryBuilder::new();
-            for _ in values {
-                b.append_null();
-            }
-            Arc::new(b.finish())
-        }
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Exact decimal parsing from integers or decimal strings; `None` (→ null) for
 /// anything inexact — floats are refused by design (no Float64 → Decimal edge).
 fn parse_decimal(value: &Value, scale: u8) -> Option<i128> {
     let text = match value {
         Value::Number(n) => {
             if let Some(i) = n.as_i64() {
