--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm Some(Kind::Int(i)) in build_scalar
@@ -208,17 +208,17 @@
                 });
             }
             Arc::new(b.finish())
         }
         LogicalType::Int64 => {
             let mut b = Int64Builder::new();
             for v in values {
                 b.append_option(match kind_of(v) {
-                    Some(Kind::Int(i)) => Some(i),
+                     /* ~ changed by cargo-mutants ~ */
                     _ => None,
                 });
             }
             Arc::new(b.finish())
         }
         LogicalType::Float64 => {
             let mut b = Float64Builder::new();
             for v in values {
