--- crates/rdlt-engine/src/shred/build.rs
+++ replace arrow_scalar_type -> DataType with Default::default()
@@ -17,30 +17,17 @@
 use rdlt_core::{ColumnDef, ColumnType, LoadId, LogicalType, TableSchema};
 use serde_json::Value;
 
 use super::canon::{parse_timestamp_tz, render_scalar};
 use super::nest::BufferedRow;
 
 /// Arrow physical type for a logical type (design doc §5.1).
 pub(crate) fn arrow_scalar_type(ty: LogicalType) -> DataType {
-    match ty {
-        LogicalType::Bool => DataType::Boolean,
-        LogicalType::Int64 => DataType::Int64,
-        LogicalType::Float64 => DataType::Float64,
-        LogicalType::Decimal { precision, scale } => DataType::Decimal128(precision, scale as i8),
-        LogicalType::Utf8 | LogicalType::Uuid | LogicalType::Json => DataType::Utf8,
-        LogicalType::Binary => DataType::Binary,
-        LogicalType::TimestampTz => {
-            DataType::Timestamp(TimeUnit::Microsecond, Some("+00:00".into()))
-        }
-        LogicalType::TimestampNaive => DataType::Timestamp(TimeUnit::Microsecond, None),
-        LogicalType::Date => DataType::Date32,
-        LogicalType::Time => DataType::Time64(TimeUnit::Microsecond),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn arrow_column_type(ty: &ColumnType) -> DataType {
     match ty {
         ColumnType::Scalar { scalar } => arrow_scalar_type(*scalar),
         ColumnType::Struct { fields } => DataType::Struct(arrow_fields(fields)),
         ColumnType::ScalarList { item } => {
             DataType::List(Arc::new(Field::new("item", arrow_scalar_type(*item), true)))
