--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm Some(Kind::Str(s)) in build_scalar
@@ -305,24 +305,17 @@
                 b.append_option(micros);
             }
             Arc::new(b.finish())
         }
         LogicalType::Date => {
             let mut b = Date32Builder::new();
             for v in values {
                 let days = match kind_of(v) {
-                    Some(Kind::Str(s)) => chrono::NaiveDate::parse_from_str(s, "%Y-%m-%d")
-                        .ok()
-                        .map(|d| {
-                            d.signed_duration_since(
-                                chrono::NaiveDate::from_ymd_opt(1970, 1, 1).expect("epoch"),
-                            )
-                            .num_days() as i32
-                        }),
+                     /* ~ changed by cargo-mutants ~ */
                     _ => None,
                 };
                 b.append_option(days);
             }
             Arc::new(b.finish())
         }
         LogicalType::Time => {
             let mut b = Time64MicrosecondBuilder::new();
