--- crates/rdlt-engine/src/shred/build.rs
+++ delete - in parse_decimal
@@ -315,17 +315,17 @@
                 return (i as i128).checked_mul(10i128.checked_pow(scale as u32)?);
             }
             return None; // floats: refused
         }
         Value::String(s) => s.trim(),
         _ => return None,
     };
     let (sign, digits) = match text.strip_prefix('-') {
-        Some(rest) => (-1i128, rest),
+        Some(rest) => ( /* ~ changed by cargo-mutants ~ */1i128, rest),
         None => (1i128, text),
     };
     let (int_part, frac_part) = match digits.split_once('.') {
         Some((i, f)) => (i, f),
         None => (digits, ""),
     };
     if frac_part.len() > scale as usize {
         return None; // would truncate — inexact
