--- crates/rdlt-engine/src/shred/build.rs
+++ replace write_compact_json with ()
@@ -362,52 +362,17 @@
         }
     }
 }
 
 /// Compact JSON serialization in NATIVE entry order — byte-identical to
 /// `serde_json::to_string(&Value)` (preserve_order semantics, serde escaping,
 /// itoa/ryu numbers). Used for the `Json` column type's verbatim subtrees.
 fn write_compact_json<'v, V: JsonView<'v>>(value: V, out: &mut Vec<u8>) {
-    match value.kind() {
-        Kind::Object => {
-            out.push(b'{');
-            for (i, (key, item)) in value.obj_entries().enumerate() {
-                if i > 0 {
-                    out.push(b',');
-                }
-                serde_json::to_writer(&mut *out, key).expect("string serialization");
-                out.push(b':');
-                write_compact_json(item, out);
-            }
-            out.push(b'}');
-        }
-        Kind::Array => {
-            out.push(b'[');
-            for (i, item) in value.arr_items().enumerate() {
-                if i > 0 {
-                    out.push(b',');
-                }
-                write_compact_json(item, out);
-            }
-            out.push(b']');
-        }
-        Kind::Null => out.extend_from_slice(b"null"),
-        Kind::Bool(b) => out.extend_from_slice(if b { b"true" } else { b"false" }),
-        Kind::Str(s) => serde_json::to_writer(&mut *out, s).expect("string serialization"),
-        Kind::Int(i) => serde_json::to_writer(&mut *out, &serde_json::Number::from(i))
-            .expect("number serialization"),
-        Kind::UInt(u) => serde_json::to_writer(&mut *out, &serde_json::Number::from(u))
-            .expect("number serialization"),
-        Kind::Float(f) => serde_json::to_writer(
-            &mut *out,
-            &serde_json::Number::from_f64(f).expect("finite by JSON grammar"),
-        )
-        .expect("number serialization"),
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Exact decimal parsing from integers or decimal strings; `None` (→ null) for
 /// anything inexact — floats are refused by design (no Float64 → Decimal edge).
 fn parse_decimal<'v, V: JsonView<'v>>(value: V, scale: u8) -> Option<i128> {
     let owned;
     let text = match value.kind() {
         Kind::Int(i) => {
