--- crates/rdlt-engine/src/shred/build.rs
+++ replace parse_decimal -> Option<i128> with None
@@ -403,52 +403,10 @@
         )
         .expect("number serialization"),
     }
 }
 
 /// Exact decimal parsing from integers or decimal strings; `None` (→ null) for
 /// anything inexact — floats are refused by design (no Float64 → Decimal edge).
 fn parse_decimal<'v, V: JsonView<'v>>(value: V, scale: u8) -> Option<i128> {
-    let owned;
-    let text = match value.kind() {
-        Kind::Int(i) => {
-            return (i as i128).checked_mul(10i128.checked_pow(scale as u32)?);
-        }
-        // u64 beyond i64 and floats: refused (matches Number::as_i64 semantics).
-        Kind::UInt(_) | Kind::Float(_) => return None,
-        Kind::Str(s) => {
-            owned = s;
-            owned.trim()
-        }
-        _ => return None,
-    };
-    let (sign, digits) = match text.strip_prefix('-') {
-        Some(rest) => (-1i128, rest),
-        None => (1i128, text),
-    };
-    let (int_part, frac_part) = match digits.split_once('.') {
-        Some((i, f)) => (i, f),
-        None => (digits, ""),
-    };
-    if frac_part.len() > scale as usize {
-        return None; // would truncate — inexact
-    }
-    if !int_part.chars().all(|c| c.is_ascii_digit())
-        || !frac_part.chars().all(|c| c.is_ascii_digit())
-        || int_part.is_empty() && frac_part.is_empty()
-    {
-        return None;
-    }
-    let mut result: i128 = if int_part.is_empty() {
-        0
-    } else {
-        int_part.parse().ok()?
-    };
-    result = result.checked_mul(10i128.checked_pow(scale as u32)?)?;
-    if !frac_part.is_empty() {
-        let frac: i128 = frac_part.parse().ok()?;
-        result = result.checked_add(
-            frac.checked_mul(10i128.checked_pow((scale as usize - frac_part.len()) as u32)?)?,
-        )?;
-    }
-    Some(sign * result)
+    None /* ~ changed by cargo-mutants ~ */
 }
