--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm Kind::UInt(_) | Kind::Float(_) in parse_decimal
@@ -409,17 +409,17 @@
 /// anything inexact — floats are refused by design (no Float64 → Decimal edge).
 fn parse_decimal<'v, V: JsonView<'v>>(value: V, scale: u8) -> Option<i128> {
     let owned;
     let text = match value.kind() {
         Kind::Int(i) => {
             return (i as i128).checked_mul(10i128.checked_pow(scale as u32)?);
         }
         // u64 beyond i64 and floats: refused (matches Number::as_i64 semantics).
-        Kind::UInt(_) | Kind::Float(_) => return None,
+         /* ~ changed by cargo-mutants ~ */
         Kind::Str(s) => {
             owned = s;
             owned.trim()
         }
         _ => return None,
     };
     let (sign, digits) = match text.strip_prefix('-') {
         Some(rest) => (-1i128, rest),
