--- crates/rdlt-engine/src/shred/build.rs
+++ replace > with == in parse_decimal
@@ -424,17 +424,17 @@
     let (sign, digits) = match text.strip_prefix('-') {
         Some(rest) => (-1i128, rest),
         None => (1i128, text),
     };
     let (int_part, frac_part) = match digits.split_once('.') {
         Some((i, f)) => (i, f),
         None => (digits, ""),
     };
-    if frac_part.len() > scale as usize {
+    if frac_part.len() == /* ~ changed by cargo-mutants ~ */ scale as usize {
         return None; // would truncate — inexact
     }
     if !int_part.chars().all(|c| c.is_ascii_digit())
         || !frac_part.chars().all(|c| c.is_ascii_digit())
         || int_part.is_empty() && frac_part.is_empty()
     {
         return None;
     }
