--- crates/rdlt-engine/src/shred/build.rs
+++ delete ! in parse_decimal
@@ -427,17 +427,17 @@
     };
     let (int_part, frac_part) = match digits.split_once('.') {
         Some((i, f)) => (i, f),
         None => (digits, ""),
     };
     if frac_part.len() > scale as usize {
         return None; // would truncate — inexact
     }
-    if !int_part.chars().all(|c| c.is_ascii_digit())
+    if  /* ~ changed by cargo-mutants ~ */int_part.chars().all(|c| c.is_ascii_digit())
         || !frac_part.chars().all(|c| c.is_ascii_digit())
         || int_part.is_empty() && frac_part.is_empty()
     {
         return None;
     }
     let mut result: i128 = if int_part.is_empty() {
         0
     } else {
