--- crates/rdlt-engine/src/shred/build.rs
+++ delete ! in parse_decimal
@@ -439,16 +439,16 @@
         return None;
     }
     let mut result: i128 = if int_part.is_empty() {
         0
     } else {
         int_part.parse().ok()?
     };
     result = result.checked_mul(10i128.checked_pow(scale as u32)?)?;
-    if !frac_part.is_empty() {
+    if  /* ~ changed by cargo-mutants ~ */frac_part.is_empty() {
         let frac: i128 = frac_part.parse().ok()?;
         result = result.checked_add(
             frac.checked_mul(10i128.checked_pow((scale as usize - frac_part.len()) as u32)?)?,
         )?;
     }
     Some(sign * result)
 }
