--- crates/rdlt-engine/src/shred/build.rs
+++ replace - with / in parse_decimal
@@ -442,13 +442,13 @@
         0
     } else {
         int_part.parse().ok()?
     };
     result = result.checked_mul(10i128.checked_pow(scale as u32)?)?;
     if !frac_part.is_empty() {
         let frac: i128 = frac_part.parse().ok()?;
         result = result.checked_add(
-            frac.checked_mul(10i128.checked_pow((scale as usize - frac_part.len()) as u32)?)?,
+            frac.checked_mul(10i128.checked_pow((scale as usize / /* ~ changed by cargo-mutants ~ */ frac_part.len()) as u32)?)?,
         )?;
     }
     Some(sign * result)
 }
