--- crates/rdlt-engine/src/shred/build.rs
+++ delete match arm system_columns::PARENT_ID in build_batch
@@ -84,30 +84,17 @@
                 let mut b = StringBuilder::new();
                 let mut hex = [0u8; 64];
                 for row in rows {
                     row.id.write_hex(&mut hex);
                     b.append_value(std::str::from_utf8(&hex).expect("hex is ASCII"));
                 }
                 Arc::new(b.finish())
             }
-            system_columns::PARENT_ID => {
-                let mut b = StringBuilder::new();
-                let mut hex = [0u8; 64];
-                for row in rows {
-                    match &row.parent_id {
-                        Some(id) => {
-                            id.write_hex(&mut hex);
-                            b.append_value(std::str::from_utf8(&hex).expect("hex is ASCII"));
-                        }
-                        None => b.append_null(),
-                    }
-                }
-                Arc::new(b.finish())
-            }
+             /* ~ changed by cargo-mutants ~ */
             system_columns::ROOT_ID => {
                 let mut b = StringBuilder::new();
                 let mut hex = [0u8; 64];
                 for row in rows {
                     match &row.root_id {
                         Some(id) => {
                             id.write_hex(&mut hex);
                             b.append_value(std::str::from_utf8(&hex).expect("hex is ASCII"));
