--- crates/rdlt-engine/src/shred/canon.rs
+++ replace render_scalar -> Option<String> with Some(String::new())
@@ -5,30 +5,17 @@
 use serde_json::Value;
 
 /// Canonical text of a JSON scalar. `None` for null and for non-scalars.
 /// - strings: verbatim
 /// - integers: decimal digits
 /// - floats: Rust's shortest round-trip rendering
 /// - bools: `true` / `false`
 pub(crate) fn render_scalar(value: &Value) -> Option<String> {
-    match value {
-        Value::Null | Value::Object(_) | Value::Array(_) => None,
-        Value::String(s) => Some(s.clone()),
-        Value::Bool(b) => Some(if *b { "true" } else { "false" }.to_owned()),
-        Value::Number(n) => {
-            if let Some(i) = n.as_i64() {
-                Some(i.to_string())
-            } else if let Some(u) = n.as_u64() {
-                Some(u.to_string())
-            } else {
-                n.as_f64().map(|f| f.to_string())
-            }
-        }
-    }
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Canonical JSON bytes: object keys sorted recursively, no whitespace. Used for
 /// content hashing (`_rdlt_id` keyless) — two semantically identical rows always hash
 /// identically regardless of key order in the source payload.
 pub(crate) fn canonical_json_bytes(value: &Value, out: &mut Vec<u8>) {
     match value {
         Value::Object(map) => {
