--- crates/rdlt-engine/src/shred/canon.rs
+++ replace render_scalar -> Option<String> with Some(String::new())
@@ -13,24 +13,17 @@
 use super::view::{JsonView, Kind};
 
 /// Canonical text of a JSON scalar. `None` for null and for non-scalars.
 /// - strings: verbatim
 /// - integers: decimal digits
 /// - floats: Rust's shortest round-trip rendering
 /// - bools: `true` / `false`
 pub(crate) fn render_scalar<'a, V: JsonView<'a>>(value: V) -> Option<String> {
-    match value.kind() {
-        Kind::Null | Kind::Object | Kind::Array => None,
-        Kind::Str(s) => Some(s.to_owned()),
-        Kind::Bool(b) => Some(if b { "true" } else { "false" }.to_owned()),
-        Kind::Int(i) => Some(i.to_string()),
-        Kind::UInt(u) => Some(u.to_string()),
-        Kind::Float(f) => Some(f.to_string()),
-    }
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Canonical JSON bytes: object keys sorted recursively, no whitespace. Used for
 /// content hashing (`_rdlt_id` keyless) — two semantically identical rows always hash
 /// identically regardless of key order in the source payload.
 ///
 /// Entry order from the view is native (insertion) order — the sort happens
 /// HERE, explicitly, exactly as it always has.
