--- crates/rdlt-engine/src/shred/canon.rs
+++ replace canonical_json_bytes with ()
@@ -30,57 +30,17 @@
 
 /// Canonical JSON bytes: object keys sorted recursively, no whitespace. Used for
 /// content hashing (`_rdlt_id` keyless) — two semantically identical rows always hash
 /// identically regardless of key order in the source payload.
 ///
 /// Entry order from the view is native (insertion) order — the sort happens
 /// HERE, explicitly, exactly as it always has.
 pub(crate) fn canonical_json_bytes<'a, V: JsonView<'a>>(value: V, out: &mut Vec<u8>) {
-    match value.kind() {
-        Kind::Object => {
-            out.push(b'{');
-            let mut entries: Vec<(&str, V)> = value.obj_entries().collect();
-            entries.sort_unstable_by_key(|(key, _)| *key);
-            for (i, (key, item)) in entries.into_iter().enumerate() {
-                if i > 0 {
-                    out.push(b',');
-                }
-                // Key serialization via serde_json for correct escaping.
-                serde_json::to_writer(&mut *out, key).expect("string serialization");
-                out.push(b':');
-                canonical_json_bytes(item, out);
-            }
-            out.push(b'}');
-        }
-        Kind::Array => {
-            out.push(b'[');
-            for (i, item) in value.arr_items().enumerate() {
-                if i > 0 {
-                    out.push(b',');
-                }
-                canonical_json_bytes(item, out);
-            }
-            out.push(b']');
-        }
-        Kind::Null => out.extend_from_slice(b"null"),
-        Kind::Bool(b) => out.extend_from_slice(if b { b"true" } else { b"false" }),
-        Kind::Str(s) => serde_json::to_writer(&mut *out, s).expect("string serialization"),
-        // Numbers reconstruct the exact serde_json::Number a Value would hold, so
-        // the serialized bytes match the tree path digit-for-digit (itoa/ryu).
-        Kind::Int(i) => serde_json::to_writer(&mut *out, &serde_json::Number::from(i))
-            .expect("number serialization"),
-        Kind::UInt(u) => serde_json::to_writer(&mut *out, &serde_json::Number::from(u))
-            .expect("number serialization"),
-        Kind::Float(f) => serde_json::to_writer(
-            &mut *out,
-            &serde_json::Number::from_f64(f).expect("finite by JSON grammar"),
-        )
-        .expect("number serialization"),
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Strict timestamp detection: RFC 3339 / ISO-8601 **with explicit offset** only
 /// (design doc §5.2 — unambiguous, timezone-carrying strings; everything else stays
 /// text).
 ///
 /// The pre-filter encodes only what the RFC 3339 grammar REQUIRES (a
 /// `YYYY-MM-DD` prefix and the minimum 20-byte length with an offset), so it
