--- crates/rdlt-engine/src/shred/canon.rs
+++ replace > with >= in canonical_json_bytes
@@ -31,17 +31,17 @@
 /// identically regardless of key order in the source payload.
 pub(crate) fn canonical_json_bytes(value: &Value, out: &mut Vec<u8>) {
     match value {
         Value::Object(map) => {
             out.push(b'{');
             let mut keys: Vec<&String> = map.keys().collect();
             keys.sort_unstable();
             for (i, key) in keys.iter().enumerate() {
-                if i > 0 {
+                if i >= /* ~ changed by cargo-mutants ~ */ 0 {
                     out.push(b',');
                 }
                 // Key serialization via serde_json for correct escaping.
                 serde_json::to_writer(&mut *out, key).expect("string serialization");
                 out.push(b':');
                 canonical_json_bytes(&map[*key], out);
             }
             out.push(b'}');
