--- crates/rdlt-engine/src/shred/canon.rs
+++ replace > with == in canonical_json_bytes
@@ -36,17 +36,17 @@
 /// HERE, explicitly, exactly as it always has.
 pub(crate) fn canonical_json_bytes<'a, V: JsonView<'a>>(value: V, out: &mut Vec<u8>) {
     match value.kind() {
         Kind::Object => {
             out.push(b'{');
             let mut entries: Vec<(&str, V)> = value.obj_entries().collect();
             entries.sort_unstable_by_key(|(key, _)| *key);
             for (i, (key, item)) in entries.into_iter().enumerate() {
-                if i > 0 {
+                if i == /* ~ changed by cargo-mutants ~ */ 0 {
                     out.push(b',');
                 }
                 // Key serialization via serde_json for correct escaping.
                 serde_json::to_writer(&mut *out, key).expect("string serialization");
                 out.push(b':');
                 canonical_json_bytes(item, out);
             }
             out.push(b'}');
