--- crates/rdlt-engine/src/shred/canon.rs
+++ replace > with < in canonical_json_bytes
@@ -49,17 +49,17 @@
                 out.push(b':');
                 canonical_json_bytes(item, out);
             }
             out.push(b'}');
         }
         Kind::Array => {
             out.push(b'[');
             for (i, item) in value.arr_items().enumerate() {
-                if i > 0 {
+                if i < /* ~ changed by cargo-mutants ~ */ 0 {
                     out.push(b',');
                 }
                 canonical_json_bytes(item, out);
             }
             out.push(b']');
         }
         Kind::Null => out.extend_from_slice(b"null"),
         Kind::Bool(b) => out.extend_from_slice(if b { b"true" } else { b"false" }),
