--- crates/rdlt-engine/src/shred/canon.rs
+++ replace parse_timestamp_tz -> Option<chrono::DateTime<chrono::FixedOffset>> with Some(DateTime::new(Default::default()))
@@ -59,17 +59,17 @@
         scalar => serde_json::to_writer(out, scalar).expect("scalar serialization"),
     }
 }
 
 /// Strict timestamp detection: RFC 3339 / ISO-8601 **with explicit offset** only
 /// (design doc §5.2 — unambiguous, timezone-carrying strings; everything else stays
 /// text).
 pub(crate) fn parse_timestamp_tz(s: &str) -> Option<chrono::DateTime<chrono::FixedOffset>> {
-    chrono::DateTime::parse_from_rfc3339(s).ok()
+    Some(DateTime::new(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use serde_json::json;
 
     #[test]
