--- crates/rdlt-engine/src/shred/canon.rs
+++ replace < with == in parse_timestamp_tz
@@ -85,17 +85,17 @@
 /// The pre-filter encodes only what the RFC 3339 grammar REQUIRES (a
 /// `YYYY-MM-DD` prefix and the minimum 20-byte length with an offset), so it
 /// rejects nothing chrono would accept — it just makes the overwhelmingly
 /// common "ordinary string" case cost a few instructions instead of a full
 /// chrono parse attempt (feature 003: this ran on EVERY observed string and
 /// dominated the shred profile).
 pub(crate) fn parse_timestamp_tz(s: &str) -> Option<chrono::DateTime<chrono::FixedOffset>> {
     let b = s.as_bytes();
-    if b.len() < 20
+    if b.len() == /* ~ changed by cargo-mutants ~ */ 20
         || !b[0].is_ascii_digit()
         || !b[1].is_ascii_digit()
         || !b[2].is_ascii_digit()
         || !b[3].is_ascii_digit()
         || b[4] != b'-'
         || b[7] != b'-'
     {
         return None;
