--- crates/rdlt-engine/src/shred/canon.rs
+++ delete ! in parse_timestamp_tz
@@ -87,17 +87,17 @@
 /// rejects nothing chrono would accept — it just makes the overwhelmingly
 /// common "ordinary string" case cost a few instructions instead of a full
 /// chrono parse attempt (feature 003: this ran on EVERY observed string and
 /// dominated the shred profile).
 pub(crate) fn parse_timestamp_tz(s: &str) -> Option<chrono::DateTime<chrono::FixedOffset>> {
     let b = s.as_bytes();
     if b.len() < 20
         || !b[0].is_ascii_digit()
-        || !b[1].is_ascii_digit()
+        ||  /* ~ changed by cargo-mutants ~ */b[1].is_ascii_digit()
         || !b[2].is_ascii_digit()
         || !b[3].is_ascii_digit()
         || b[4] != b'-'
         || b[7] != b'-'
     {
         return None;
     }
     chrono::DateTime::parse_from_rfc3339(s).ok()
