--- crates/rdlt-engine/src/shred/canon.rs
+++ replace || with && in parse_timestamp_tz
@@ -91,17 +91,17 @@
 pub(crate) fn parse_timestamp_tz(s: &str) -> Option<chrono::DateTime<chrono::FixedOffset>> {
     let b = s.as_bytes();
     if b.len() < 20
         || !b[0].is_ascii_digit()
         || !b[1].is_ascii_digit()
         || !b[2].is_ascii_digit()
         || !b[3].is_ascii_digit()
         || b[4] != b'-'
-        || b[7] != b'-'
+        && /* ~ changed by cargo-mutants ~ */ b[7] != b'-'
     {
         return None;
     }
     chrono::DateTime::parse_from_rfc3339(s).ok()
 }
 
 #[cfg(test)]
 mod tests {
