--- crates/rdlt-engine/src/shred/infer.rs
+++ replace ColState::observe with ()
@@ -96,73 +96,17 @@
     /// List of objects — rows live in a child table; the column itself vanishes.
     ChildTable,
     /// Irreconcilable shapes; values preserved verbatim.
     Json,
 }
 
 impl ColState {
     pub(crate) fn observe<'a, V: JsonView<'a>>(&mut self, value: V, lists_as_columns: bool) {
-        if value.is_null() {
-            return;
-        }
-        match self {
-            ColState::Json => {}
-            ColState::Unknown => {
-                *self = Self::fresh(value, lists_as_columns);
-            }
-            ColState::Scalar(state) => match value.kind() {
-                Kind::Object | Kind::Array => *self = ColState::Json,
-                _ => state.observe(value),
-            },
-            ColState::Struct(fields) => match value.kind() {
-                Kind::Object => {
-                    for (key, item) in value.obj_entries() {
-                        match fields.iter_mut().find(|(name, _)| name == key) {
-                            Some((_, state)) => state.observe(item, lists_as_columns),
-                            None => {
-                                let mut state = ColState::Unknown;
-                                state.observe(item, lists_as_columns);
-                                fields.push((key.to_owned(), state));
-                            }
-                        }
-                    }
-                }
-                _ => *self = ColState::Json,
-            },
-            ColState::ScalarList(item_state) => match value.kind() {
-                Kind::Array => {
-                    if value.arr_items().any(|item| item.is_object()) {
-                        // scalars-then-objects in the same list position: irreconcilable
-                        *self = ColState::Json;
-                    } else {
-                        for item in value.arr_items() {
-                            if item.is_array() {
-                                *self = ColState::Json; // nested lists: v1 escape hatch
-                                return;
-                            }
-                            item_state.observe(item);
-                        }
-                    }
-                }
-                _ => *self = ColState::Json,
-            },
-            ColState::ChildTable => {
-                // Empty lists and further lists (of objects or scalars — scalar items
-                // become {"value": …} child rows) are fine. A non-array or a mixed
-                // list is a shape conflict: the column becomes Json for conflicting
-                // values; the child table stops growing.
-                if !matches!(
-                    array_shape(value),
-                    ArrayShape::Objects | ArrayShape::Scalars | ArrayShape::Empty
-                ) {
-                    *self = ColState::Json;
-                }
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn fresh<'a, V: JsonView<'a>>(value: V, lists_as_columns: bool) -> Self {
         match value.kind() {
             Kind::Null => ColState::Unknown,
             Kind::Object => {
                 let mut fields = Vec::new();
                 for (key, item) in value.obj_entries() {
