--- crates/rdlt-engine/src/shred/infer.rs
+++ delete match arm Value::Object(map) in ColState::observe
@@ -106,28 +106,17 @@
             ColState::Unknown => {
                 *self = Self::fresh(value, lists_as_columns);
             }
             ColState::Scalar(state) => match value {
                 Value::Object(_) | Value::Array(_) => *self = ColState::Json,
                 scalar => state.observe(scalar),
             },
             ColState::Struct(fields) => match value {
-                Value::Object(map) => {
-                    for (key, item) in map {
-                        match fields.iter_mut().find(|(name, _)| name == key) {
-                            Some((_, state)) => state.observe(item, lists_as_columns),
-                            None => {
-                                let mut state = ColState::Unknown;
-                                state.observe(item, lists_as_columns);
-                                fields.push((key.clone(), state));
-                            }
-                        }
-                    }
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => *self = ColState::Json,
             },
             ColState::ScalarList(item_state) => match value {
                 Value::Array(items) => {
                     if items.iter().any(Value::is_object) {
                         // scalars-then-objects in the same list position: irreconcilable
                         *self = ColState::Json;
                     } else {
