--- crates/rdlt-engine/src/shred/infer.rs
+++ delete match arm Value::Array(items) in ColState::observe
@@ -121,30 +121,17 @@
                                 fields.push((key.clone(), state));
                             }
                         }
                     }
                 }
                 _ => *self = ColState::Json,
             },
             ColState::ScalarList(item_state) => match value {
-                Value::Array(items) => {
-                    if items.iter().any(Value::is_object) {
-                        // scalars-then-objects in the same list position: irreconcilable
-                        *self = ColState::Json;
-                    } else {
-                        for item in items {
-                            if item.is_array() {
-                                *self = ColState::Json; // nested lists: v1 escape hatch
-                                return;
-                            }
-                            item_state.observe(item);
-                        }
-                    }
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => *self = ColState::Json,
             },
             ColState::ChildTable => {
                 // Empty lists and further lists (of objects or scalars — scalar items
                 // become {"value": …} child rows) are fine. A non-array or a mixed
                 // list is a shape conflict: the column becomes Json for conflicting
                 // values; the child table stops growing.
                 if !matches!(
