--- crates/rdlt-engine/src/shred/infer.rs
+++ replace ColState::fresh -> Self with Default::default()
@@ -153,49 +153,17 @@
                 ) {
                     *self = ColState::Json;
                 }
             }
         }
     }
 
     fn fresh(value: &Value, lists_as_columns: bool) -> Self {
-        match value {
-            Value::Null => ColState::Unknown,
-            Value::Object(map) => {
-                let mut fields = Vec::with_capacity(map.len());
-                for (key, item) in map {
-                    let mut state = ColState::Unknown;
-                    state.observe(item, lists_as_columns);
-                    fields.push((key.clone(), state));
-                }
-                ColState::Struct(fields)
-            }
-            Value::Array(items) => match array_shape(value) {
-                ArrayShape::Empty => ColState::Unknown, // decide when data arrives
-                ArrayShape::Objects => ColState::ChildTable,
-                ArrayShape::Scalars => {
-                    if lists_as_columns {
-                        let mut item_state = ScalarState::default();
-                        for item in items {
-                            item_state.observe(item);
-                        }
-                        ColState::ScalarList(item_state)
-                    } else {
-                        ColState::ChildTable
-                    }
-                }
-                ArrayShape::Mixed => ColState::Json,
-            },
-            scalar => {
-                let mut state = ScalarState::default();
-                state.observe(scalar);
-                ColState::Scalar(state)
-            }
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolve to a schema column type; `None` for positions that are not columns
     /// (child tables) or never got data.
     pub(crate) fn resolve(&self) -> Option<ColumnType> {
         match self {
             ColState::Unknown | ColState::ChildTable => None,
             ColState::Json => Some(ColumnType::scalar(LogicalType::Json)),
