--- crates/rdlt-engine/src/shred/infer.rs
+++ replace ColState::fresh -> Self with Default::default()
@@ -156,49 +156,17 @@
                 ) {
                     *self = ColState::Json;
                 }
             }
         }
     }
 
     fn fresh<'a, V: JsonView<'a>>(value: V, lists_as_columns: bool) -> Self {
-        match value.kind() {
-            Kind::Null => ColState::Unknown,
-            Kind::Object => {
-                let mut fields = Vec::new();
-                for (key, item) in value.obj_entries() {
-                    let mut state = ColState::Unknown;
-                    state.observe(item, lists_as_columns);
-                    fields.push((key.to_owned(), state));
-                }
-                ColState::Struct(fields)
-            }
-            Kind::Array => match array_shape(value) {
-                ArrayShape::Empty => ColState::Unknown, // decide when data arrives
-                ArrayShape::Objects => ColState::ChildTable,
-                ArrayShape::Scalars => {
-                    if lists_as_columns {
-                        let mut item_state = ScalarState::default();
-                        for item in value.arr_items() {
-                            item_state.observe(item);
-                        }
-                        ColState::ScalarList(item_state)
-                    } else {
-                        ColState::ChildTable
-                    }
-                }
-                ArrayShape::Mixed => ColState::Json,
-            },
-            _ => {
-                let mut state = ScalarState::default();
-                state.observe(value);
-                ColState::Scalar(state)
-            }
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolve to a schema column type; `None` for positions that are not columns
     /// (child tables) or never got data.
     pub(crate) fn resolve(&self) -> Option<ColumnType> {
         match self {
             ColState::Unknown | ColState::ChildTable => None,
             ColState::Json => Some(ColumnType::scalar(LogicalType::Json)),
