--- crates/rdlt-engine/src/shred/infer.rs
+++ delete match arm Kind::Object in ColState::fresh
@@ -158,25 +158,17 @@
                 }
             }
         }
     }
 
     fn fresh<'a, V: JsonView<'a>>(value: V, lists_as_columns: bool) -> Self {
         match value.kind() {
             Kind::Null => ColState::Unknown,
-            Kind::Object => {
-                let mut fields = Vec::new();
-                for (key, item) in value.obj_entries() {
-                    let mut state = ColState::Unknown;
-                    state.observe(item, lists_as_columns);
-                    fields.push((key.to_owned(), state));
-                }
-                ColState::Struct(fields)
-            }
+             /* ~ changed by cargo-mutants ~ */
             Kind::Array => match array_shape(value) {
                 ArrayShape::Empty => ColState::Unknown, // decide when data arrives
                 ArrayShape::Objects => ColState::ChildTable,
                 ArrayShape::Scalars => {
                     if lists_as_columns {
                         let mut item_state = ScalarState::default();
                         for item in value.arr_items() {
                             item_state.observe(item);
