--- crates/rdlt-engine/src/shred/infer.rs
+++ delete match arm Kind::Array in ColState::fresh
@@ -167,32 +167,17 @@
                 let mut fields = Vec::new();
                 for (key, item) in value.obj_entries() {
                     let mut state = ColState::Unknown;
                     state.observe(item, lists_as_columns);
                     fields.push((key.to_owned(), state));
                 }
                 ColState::Struct(fields)
             }
-            Kind::Array => match array_shape(value) {
-                ArrayShape::Empty => ColState::Unknown, // decide when data arrives
-                ArrayShape::Objects => ColState::ChildTable,
-                ArrayShape::Scalars => {
-                    if lists_as_columns {
-                        let mut item_state = ScalarState::default();
-                        for item in value.arr_items() {
-                            item_state.observe(item);
-                        }
-                        ColState::ScalarList(item_state)
-                    } else {
-                        ColState::ChildTable
-                    }
-                }
-                ArrayShape::Mixed => ColState::Json,
-            },
+             /* ~ changed by cargo-mutants ~ */
             _ => {
                 let mut state = ScalarState::default();
                 state.observe(value);
                 ColState::Scalar(state)
             }
         }
     }
 
