--- crates/rdlt-engine/src/shred/infer.rs
+++ replace array_shape -> ArrayShape with Default::default()
@@ -236,39 +236,17 @@
 pub(crate) enum ArrayShape {
     Empty,
     Objects,
     Scalars,
     Mixed,
 }
 
 pub(crate) fn array_shape<'a, V: JsonView<'a>>(value: V) -> ArrayShape {
-    if !value.is_array() {
-        return ArrayShape::Mixed;
-    }
-    let mut objects = 0usize;
-    let mut non_null = 0usize;
-    for item in value.arr_items() {
-        if item.is_null() {
-            continue;
-        }
-        non_null += 1;
-        if item.is_object() {
-            objects += 1;
-        }
-    }
-    if non_null == 0 {
-        ArrayShape::Empty
-    } else if objects == non_null {
-        ArrayShape::Objects
-    } else if objects == 0 {
-        ArrayShape::Scalars
-    } else {
-        ArrayShape::Mixed
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use serde_json::{Value, json};
 
     fn observe_all(values: &[Value]) -> ColState {
