--- crates/rdlt-engine/src/shred/infer.rs
+++ delete ! in array_shape
@@ -236,17 +236,17 @@
 pub(crate) enum ArrayShape {
     Empty,
     Objects,
     Scalars,
     Mixed,
 }
 
 pub(crate) fn array_shape<'a, V: JsonView<'a>>(value: V) -> ArrayShape {
-    if !value.is_array() {
+    if  /* ~ changed by cargo-mutants ~ */value.is_array() {
         return ArrayShape::Mixed;
     }
     let mut objects = 0usize;
     let mut non_null = 0usize;
     for item in value.arr_items() {
         if item.is_null() {
             continue;
         }
