--- crates/rdlt-engine/src/shred/infer.rs
+++ replace == with != in array_shape
@@ -241,17 +241,17 @@
     let Value::Array(items) = value else {
         return ArrayShape::Mixed;
     };
     let non_null: Vec<&Value> = items.iter().filter(|v| !v.is_null()).collect();
     if non_null.is_empty() {
         return ArrayShape::Empty;
     }
     let objects = non_null.iter().filter(|v| v.is_object()).count();
-    if objects == non_null.len() {
+    if objects != /* ~ changed by cargo-mutants ~ */ non_null.len() {
         ArrayShape::Objects
     } else if objects == 0 {
         ArrayShape::Scalars
     } else {
         ArrayShape::Mixed
     }
 }
 
