--- crates/rdlt-engine/src/shred/infer.rs
+++ replace += with -= in array_shape
@@ -245,17 +245,17 @@
         return ArrayShape::Mixed;
     }
     let mut objects = 0usize;
     let mut non_null = 0usize;
     for item in value.arr_items() {
         if item.is_null() {
             continue;
         }
-        non_null += 1;
+        non_null -= /* ~ changed by cargo-mutants ~ */ 1;
         if item.is_object() {
             objects += 1;
         }
     }
     if non_null == 0 {
         ArrayShape::Empty
     } else if objects == non_null {
         ArrayShape::Objects
