--- crates/rdlt-engine/src/shred/infer.rs
+++ replace += with -= in array_shape
@@ -247,17 +247,17 @@
     let mut objects = 0usize;
     let mut non_null = 0usize;
     for item in value.arr_items() {
         if item.is_null() {
             continue;
         }
         non_null += 1;
         if item.is_object() {
-            objects += 1;
+            objects -= /* ~ changed by cargo-mutants ~ */ 1;
         }
     }
     if non_null == 0 {
         ArrayShape::Empty
     } else if objects == non_null {
         ArrayShape::Objects
     } else if objects == 0 {
         ArrayShape::Scalars
