--- crates/rdlt-engine/src/shred/infer.rs
+++ replace == with != in array_shape
@@ -250,17 +250,17 @@
         if item.is_null() {
             continue;
         }
         non_null += 1;
         if item.is_object() {
             objects += 1;
         }
     }
-    if non_null == 0 {
+    if non_null != /* ~ changed by cargo-mutants ~ */ 0 {
         ArrayShape::Empty
     } else if objects == non_null {
         ArrayShape::Objects
     } else if objects == 0 {
         ArrayShape::Scalars
     } else {
         ArrayShape::Mixed
     }
