--- crates/rdlt-engine/src/shred/infer.rs
+++ replace == with != in array_shape
@@ -252,17 +252,17 @@
         }
         non_null += 1;
         if item.is_object() {
             objects += 1;
         }
     }
     if non_null == 0 {
         ArrayShape::Empty
-    } else if objects == non_null {
+    } else if objects != /* ~ changed by cargo-mutants ~ */ non_null {
         ArrayShape::Objects
     } else if objects == 0 {
         ArrayShape::Scalars
     } else {
         ArrayShape::Mixed
     }
 }
 
