--- crates/rdlt-engine/src/shred/infer.rs
+++ replace == with != in array_shape
@@ -254,17 +254,17 @@
         if item.is_object() {
             objects += 1;
         }
     }
     if non_null == 0 {
         ArrayShape::Empty
     } else if objects == non_null {
         ArrayShape::Objects
-    } else if objects == 0 {
+    } else if objects != /* ~ changed by cargo-mutants ~ */ 0 {
         ArrayShape::Scalars
     } else {
         ArrayShape::Mixed
     }
 }
 
 #[cfg(test)]
 mod tests {
