--- crates/rdlt-engine/src/shred/infer.rs
+++ delete field ty from struct Self expression in ScalarState::pinned
@@ -22,17 +22,17 @@
     pinned: bool,
     saw_inexact_int: bool,
     saw_float: bool,
 }
 
 impl ScalarState {
     pub(crate) fn pinned(ty: LogicalType) -> Self {
         Self {
-            ty: Some(ty),
+             /* ~ changed by cargo-mutants ~ */
             pinned: true,
             ..Self::default()
         }
     }
 
     pub(crate) fn observe<'a, V: JsonView<'a>>(&mut self, value: V) {
         if self.pinned {
             return;
