--- crates/rdlt-engine/src/shred/infer.rs
+++ replace ScalarState::observe with ()
@@ -26,58 +26,17 @@
         Self {
             ty: Some(ty),
             pinned: true,
             ..Self::default()
         }
     }
 
     pub(crate) fn observe(&mut self, value: &Value) {
-        if self.pinned {
-            return;
-        }
-        let observed = match value {
-            Value::Null => return,
-            Value::Bool(_) => LogicalType::Bool,
-            Value::Number(n) => {
-                if let Some(i) = n.as_i64() {
-                    if !int64_fits_in_f64(i) {
-                        self.saw_inexact_int = true;
-                    }
-                    LogicalType::Int64
-                } else if n.as_u64().is_some() {
-                    // u64 beyond i64::MAX: definitely not exactly representable paths
-                    // we track; treat as inexact-int territory.
-                    self.saw_inexact_int = true;
-                    LogicalType::Int64
-                } else {
-                    self.saw_float = true;
-                    LogicalType::Float64
-                }
-            }
-            Value::String(s) => {
-                if parse_timestamp_tz(s).is_some() {
-                    LogicalType::TimestampTz
-                } else {
-                    LogicalType::Utf8
-                }
-            }
-            // Non-scalars reaching a scalar position are a shape conflict → Json.
-            Value::Object(_) | Value::Array(_) => LogicalType::Json,
-        };
-        let joined = match self.ty {
-            None => observed,
-            Some(current) => widen(current, observed),
-        };
-        // Value-checked escalation: Float64 cannot exactly hold every observed Int64.
-        self.ty = Some(if joined == LogicalType::Float64 && self.saw_inexact_int {
-            LogicalType::Utf8
-        } else {
-            joined
-        });
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolved type; `Utf8` for never-observed (all-null) positions.
     pub(crate) fn resolve(&self) -> LogicalType {
         self.ty.unwrap_or(LogicalType::Utf8)
     }
 }
 
