--- crates/rdlt-engine/src/shred/infer.rs
+++ delete ! in ScalarState::observe
@@ -36,17 +36,17 @@
     pub(crate) fn observe<'a, V: JsonView<'a>>(&mut self, value: V) {
         if self.pinned {
             return;
         }
         let observed = match value.kind() {
             Kind::Null => return,
             Kind::Bool(_) => LogicalType::Bool,
             Kind::Int(i) => {
-                if !int64_fits_in_f64(i) {
+                if  /* ~ changed by cargo-mutants ~ */int64_fits_in_f64(i) {
                     self.saw_inexact_int = true;
                 }
                 LogicalType::Int64
             }
             Kind::UInt(_) => {
                 // u64 beyond i64::MAX: definitely not exactly representable paths
                 // we track; treat as inexact-int territory.
                 self.saw_inexact_int = true;
