--- crates/rdlt-engine/src/shred/infer.rs
+++ replace && with || in ScalarState::observe
@@ -66,17 +66,17 @@
             // Non-scalars reaching a scalar position are a shape conflict → Json.
             Kind::Object | Kind::Array => LogicalType::Json,
         };
         let joined = match self.ty {
             None => observed,
             Some(current) => widen(current, observed),
         };
         // Value-checked escalation: Float64 cannot exactly hold every observed Int64.
-        self.ty = Some(if joined == LogicalType::Float64 && self.saw_inexact_int {
+        self.ty = Some(if joined == LogicalType::Float64 || /* ~ changed by cargo-mutants ~ */ self.saw_inexact_int {
             LogicalType::Utf8
         } else {
             joined
         });
     }
 
     /// Resolved type; `Utf8` for never-observed (all-null) positions.
     pub(crate) fn resolve(&self) -> LogicalType {
