--- crates/rdlt-engine/src/shred/mod.rs
+++ replace drain_tables -> Result<Vec<LoadItem>, RdltError> with Ok(vec![Default::default()])
@@ -106,132 +106,17 @@
     tables: &mut [TableBuffer],
     rows: &mut [Vec<DrainRow<V>>],
     pre_batch: &[Vec<(String, ColState)>],
     registry: &mut SchemaRegistry,
     load_id: &LoadId,
     mode: &WriteMode,
     policy: &SchemaPolicy,
 ) -> Result<Vec<LoadItem>, RdltError> {
-    let mut items = Vec::new();
-    // Rows discarded in earlier (parent) tables cascade into their descendants.
-    let mut discarded_ids: BTreeSet<RowId> = BTreeSet::new();
-
-    for idx in 0..tables.len() {
-        // Cascade: drop rows whose parent or root was discarded upstream. A
-        // cascade-dropped row's OWN id joins the set, so its descendants at any
-        // depth cascade too (parent-first table order makes one pass complete);
-        // cascade drops are counted — never silent (review finding #6).
-        if !discarded_ids.is_empty() {
-            let table_rows = &mut rows[idx];
-            let mut cascade_dropped = 0u64;
-            let mut kept = Vec::with_capacity(table_rows.len());
-            for row in table_rows.drain(..) {
-                let doomed = row
-                    .parent_id
-                    .as_ref()
-                    .is_some_and(|p| discarded_ids.contains(p))
-                    || row
-                        .root_id
-                        .as_ref()
-                        .is_some_and(|r| discarded_ids.contains(r));
-                if doomed {
-                    discarded_ids.insert(row.id);
-                    cascade_dropped += 1;
-                } else {
-                    kept.push(row);
-                }
-            }
-            *table_rows = kept;
-            if cascade_dropped > 0 {
-                items.push(LoadItem::Discarded {
-                    table: tables[idx].table.clone(),
-                    rows: cascade_dropped,
-                    values: 0,
-                });
-            }
-        }
-
-        let has_rows = !rows[idx].is_empty();
-        let observed = nest::resolve_schema(&mut tables[idx]);
-        let table = observed.table.clone();
-        if !has_rows && registry.get(&table).is_none() {
-            continue;
-        }
-
-        let changes = registry.diff(&observed);
-
-        // ---- Policy resolution per change ----
-        let mut discard: Vec<(SchemaChange, PolicyAction)> = Vec::new();
-        let mut kept: Vec<SchemaChange> = Vec::new();
-        for change in changes {
-            // Table creation is the first version, not evolution — always allowed.
-            let action = if matches!(change, SchemaChange::CreateTable { .. }) {
-                PolicyAction::Evolve
-            } else {
-                policy.action_for(&table, change_column(&change))
-            };
-            match action {
-                PolicyAction::Evolve => kept.push(change),
-                PolicyAction::Freeze => {
-                    // Nothing of this batch has been emitted: fail before any row
-                    // of the violating batch is written (spec FR-010).
-                    return Err(RdltError::Schema(violation_for(&table, &change)));
-                }
-                PolicyAction::DiscardRow | PolicyAction::DiscardValue => {
-                    discard.push((change, action));
-                }
-            }
-        }
-
-        let (observed, kept) = if discard.is_empty() {
-            (observed, kept)
-        } else {
-            enforce_discards(
-                &mut tables[idx],
-                &mut rows[idx],
-                pre_batch.get(idx).map(Vec::as_slice),
-                &discard,
-                &mut discarded_ids,
-                &mut items,
-            );
-            // Re-resolve after rollback + filtering; everything left is approved.
-            let observed = nest::resolve_schema(&mut tables[idx]);
-            let changes = registry.diff(&observed);
-            (observed, changes)
-        };
-
-        if let Some(delta) = registry.apply(observed, kept) {
-            let current = registry
-                .get(&delta.table)
-                .expect("apply() just stored this schema")
-                .clone();
-            items.push(LoadItem::Delta {
-                schema: current,
-                delta,
-                mode: mode.clone(),
-            });
-        }
-
-        if !rows[idx].is_empty() {
-            let buffer = &tables[idx];
-            let schema = registry
-                .get(&buffer.table)
-                .expect("schema registered before building")
-                .clone();
-            let batch = build::build_batch(&schema, buffer.name_map(), &rows[idx], load_id)
-                .map_err(|e| RdltError::config(format!("arrow build: {e}")))?;
-            rows[idx].clear();
-            items.push(LoadItem::Batch {
-                table: buffer.table.clone(),
-                batch,
-            });
-        }
-    }
-    Ok(items)
+    Ok(vec![Default::default()]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Apply Discard* actions for one table: roll offending columns back to their
 /// pre-batch states, then drop rows / null values (via the overlay) that
 /// required the refused changes. Counts are emitted as a `LoadItem::Discarded`
 /// (never silent).
 fn enforce_discards<'v, V: JsonView<'v>>(
     buffer: &mut TableBuffer,
