--- crates/rdlt-engine/src/shred/mod.rs
+++ delete ! in drain_tables
@@ -115,17 +115,17 @@
     // Rows discarded in earlier (parent) tables cascade into their descendants.
     let mut discarded_ids: BTreeSet<RowId> = BTreeSet::new();
 
     for idx in 0..tables.len() {
         // Cascade: drop rows whose parent or root was discarded upstream. A
         // cascade-dropped row's OWN id joins the set, so its descendants at any
         // depth cascade too (parent-first table order makes one pass complete);
         // cascade drops are counted — never silent (review finding #6).
-        if !discarded_ids.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */discarded_ids.is_empty() {
             let table_rows = &mut rows[idx];
             let mut cascade_dropped = 0u64;
             let mut kept = Vec::with_capacity(table_rows.len());
             for row in table_rows.drain(..) {
                 let doomed = row
                     .parent_id
                     .as_ref()
                     .is_some_and(|p| discarded_ids.contains(p))
