--- crates/rdlt-engine/src/shred/mod.rs
+++ delete ! in drain_tables
@@ -145,17 +145,17 @@
                 items.push(LoadItem::Discarded {
                     table: tables[idx].table.clone(),
                     rows: cascade_dropped,
                     values: 0,
                 });
             }
         }
 
-        let has_rows = !rows[idx].is_empty();
+        let has_rows =  /* ~ changed by cargo-mutants ~ */rows[idx].is_empty();
         let observed = nest::resolve_schema(&mut tables[idx]);
         let table = observed.table.clone();
         if !has_rows && registry.get(&table).is_none() {
             continue;
         }
 
         let changes = registry.diff(&observed);
 
