--- crates/rdlt-engine/src/shred/mod.rs
+++ replace enforce_discards with ()
@@ -236,78 +236,10 @@
 fn enforce_discards<'v, V: JsonView<'v>>(
     buffer: &mut TableBuffer,
     rows: &mut Vec<DrainRow<V>>,
     snapshot: Option<&[(String, ColState)]>,
     discard: &[(SchemaChange, PolicyAction)],
     discarded_ids: &mut BTreeSet<RowId>,
     items: &mut Vec<LoadItem>,
 ) {
-    let table_name = buffer.table.clone();
-
-    // Resolve, per offending change: (source key, offense test input).
-    struct Offense {
-        source_key: String,
-        /// `None` = new column (any non-null value offends);
-        /// `Some(ty)` = must fit this (the pre-change) type.
-        must_fit: Option<rdlt_core::ColumnType>,
-        action: PolicyAction,
-    }
-    let mut offenses: Vec<Offense> = Vec::new();
-    for (change, action) in discard {
-        let Some(normalized) = change_column(change) else {
-            continue;
-        };
-        let source_key = buffer
-            .source_key_for(normalized)
-            .unwrap_or(normalized)
-            .to_owned();
-        buffer.revert_column(&source_key, snapshot);
-        let must_fit = match change {
-            SchemaChange::WidenColumn { from, .. } => Some(from.clone()),
-            _ => None,
-        };
-        offenses.push(Offense {
-            source_key,
-            must_fit,
-            action: *action,
-        });
-    }
-
-    let mut dropped_rows = 0u64;
-    let mut nulled_values = 0u64;
-    rows.retain_mut(|row| {
-        let mut keep = true;
-        for offense in &offenses {
-            let value = row.get_top(&offense.source_key);
-            let offends = match (&value, &offense.must_fit) {
-                (None, _) => false,
-                (Some(v), None) => !v.is_null(),
-                (Some(v), Some(ty)) => !value_fits(*v, ty),
-            };
-            if !offends {
-                continue;
-            }
-            match offense.action {
-                PolicyAction::DiscardRow => {
-                    dropped_rows += 1;
-                    discarded_ids.insert(row.id);
-                    keep = false;
-                    break;
-                }
-                PolicyAction::DiscardValue => {
-                    row.nulled.push(offense.source_key.clone());
-                    nulled_values += 1;
-                }
-                PolicyAction::Evolve | PolicyAction::Freeze => unreachable!("filtered above"),
-            }
-        }
-        keep
-    });
-
-    if dropped_rows > 0 || nulled_values > 0 {
-        items.push(LoadItem::Discarded {
-            table: table_name,
-            rows: dropped_rows,
-            values: nulled_values,
-        });
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
