--- crates/rdlt-engine/src/shred/mod.rs
+++ delete ! in enforce_discards
@@ -275,17 +275,17 @@
     let mut dropped_rows = 0u64;
     let mut nulled_values = 0u64;
     rows.retain_mut(|row| {
         let mut keep = true;
         for offense in &offenses {
             let value = row.get_top(&offense.source_key);
             let offends = match (&value, &offense.must_fit) {
                 (None, _) => false,
-                (Some(v), None) => !v.is_null(),
+                (Some(v), None) =>  /* ~ changed by cargo-mutants ~ */v.is_null(),
                 (Some(v), Some(ty)) => !value_fits(*v, ty),
             };
             if !offends {
                 continue;
             }
             match offense.action {
                 PolicyAction::DiscardRow => {
                     dropped_rows += 1;
