--- crates/rdlt-engine/src/shred/mod.rs
+++ replace += with -= in enforce_discards
@@ -290,17 +290,17 @@
                 PolicyAction::DiscardRow => {
                     dropped_rows += 1;
                     discarded_ids.insert(row.id);
                     keep = false;
                     break;
                 }
                 PolicyAction::DiscardValue => {
                     row.nulled.push(offense.source_key.clone());
-                    nulled_values += 1;
+                    nulled_values -= /* ~ changed by cargo-mutants ~ */ 1;
                 }
                 PolicyAction::Evolve | PolicyAction::Freeze => unreachable!("filtered above"),
             }
         }
         keep
     });
 
     if dropped_rows > 0 || nulled_values > 0 {
