--- crates/rdlt-engine/src/shred/mod.rs
+++ replace || with && in StreamShredder::drain_batch
@@ -40,17 +40,17 @@
                 let buffer = &mut self.tables[idx];
                 let mut cascade_dropped = 0u64;
                 let mut kept = Vec::with_capacity(buffer.rows.len());
                 for row in buffer.rows.drain(..) {
                     let doomed = row
                         .parent_id
                         .as_ref()
                         .is_some_and(|p| discarded_ids.contains(p))
-                        || row
+                        && /* ~ changed by cargo-mutants ~ */ row
                             .root_id
                             .as_ref()
                             .is_some_and(|r| discarded_ids.contains(r));
                     if doomed {
                         discarded_ids.insert(row.id);
                         cascade_dropped += 1;
                     } else {
                         kept.push(row);
