--- crates/rdlt-engine/src/shred/mod.rs
+++ delete ! in StreamShredder::drain_batch
@@ -61,17 +61,17 @@
                     items.push(LoadItem::Discarded {
                         table: buffer.table.clone(),
                         rows: cascade_dropped,
                         values: 0,
                     });
                 }
             }
 
-            let has_rows = !self.tables[idx].rows.is_empty();
+            let has_rows =  /* ~ changed by cargo-mutants ~ */self.tables[idx].rows.is_empty();
             let observed = nest::resolve_schema(&mut self.tables[idx]);
             let table = observed.table.clone();
             if !has_rows && registry.get(&table).is_none() {
                 continue;
             }
 
             let changes = registry.diff(&observed);
 
