--- crates/rdlt-engine/src/shred/mod.rs
+++ replace TreeShredder::drain_batch -> Result<Vec<LoadItem>, RdltError> with Ok(vec![])
@@ -66,42 +66,17 @@
     pub(crate) fn drain_batch(
         &mut self,
         registry: &mut SchemaRegistry,
         load_id: &LoadId,
         mode: &WriteMode,
         policy: &SchemaPolicy,
     ) -> Result<Vec<LoadItem>, RdltError> {
         // Take ownership of the buffered rows; the drain works on borrowed views.
-        let owned: Vec<Vec<nest::OwnedRow>> = self.rows.iter_mut().map(std::mem::take).collect();
-        let mut rows: Vec<Vec<DrainRow<&serde_json::Value>>> = owned
-            .iter()
-            .map(|table_rows| {
-                table_rows
-                    .iter()
-                    .map(|row| DrainRow {
-                        value: &row.value,
-                        id: row.id,
-                        parent_id: row.parent_id,
-                        root_id: row.root_id,
-                        pos: row.pos,
-                        nulled: Vec::new(),
-                    })
-                    .collect()
-            })
-            .collect();
-        drain_tables(
-            &mut self.tables,
-            &mut rows,
-            &self.pre_batch,
-            registry,
-            load_id,
-            mode,
-            policy,
-        )
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The shared drain: cascade filtering, schema resolution, policy enforcement,
 /// registry diff/apply, Arrow building — identical for both shred paths.
 pub(crate) fn drain_tables<'v, V: JsonView<'v>>(
     tables: &mut [TableBuffer],
     rows: &mut [Vec<DrainRow<V>>],
