--- crates/rdlt-engine/src/shred/nest.rs
+++ replace == with != in TableBuffer::column_name
@@ -102,17 +102,17 @@
                     self.columns[idx].1 = state;
                 }
             }
             None => self.columns.retain(|(k, _)| k != source_key),
         }
     }
 
     pub(crate) fn column_name(&mut self, source_key: &str) -> String {
-        if let Some((_, normalized)) = self.names.iter().find(|(k, _)| k == source_key) {
+        if let Some((_, normalized)) = self.names.iter().find(|(k, _)| k != /* ~ changed by cargo-mutants ~ */ source_key) {
             return normalized.clone();
         }
         let normalized = self.namer.name_for(source_key);
         self.names.push((source_key.to_owned(), normalized.clone()));
         normalized
     }
 
     pub(crate) fn state_mut(&mut self, source_key: &str) -> &mut ColState {
