--- crates/rdlt-engine/src/shred/nest.rs
+++ replace TableBuffer::state_mut -> &mut ColState with Box::leak(Box::new(Default::default()))
@@ -104,23 +104,17 @@
             return normalized.clone();
         }
         let normalized = self.namer.name_for(source_key);
         self.names.push((source_key.to_owned(), normalized.clone()));
         normalized
     }
 
     fn state_mut(&mut self, source_key: &str) -> &mut ColState {
-        if let Some(idx) = self.columns.iter().position(|(k, _)| k == source_key) {
-            &mut self.columns[idx].1
-        } else {
-            self.columns
-                .push((source_key.to_owned(), ColState::Unknown));
-            &mut self.columns.last_mut().expect("just pushed").1
-        }
+        Box::leak(Box::new(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(crate) struct StreamShredder {
     spec: StreamSpec,
     caps: DestCapabilities,
     /// Root first, children after, in first-seen order.
     pub(crate) tables: Vec<TableBuffer>,
