--- crates/rdlt-engine/src/shred/nest.rs
+++ replace == with != in TableBuffer::state_mut
@@ -111,17 +111,17 @@
             return normalized.clone();
         }
         let normalized = self.namer.name_for(source_key);
         self.names.push((source_key.to_owned(), normalized.clone()));
         normalized
     }
 
     pub(crate) fn state_mut(&mut self, source_key: &str) -> &mut ColState {
-        if let Some(idx) = self.columns.iter().position(|(k, _)| k == source_key) {
+        if let Some(idx) = self.columns.iter().position(|(k, _)| k != /* ~ changed by cargo-mutants ~ */ source_key) {
             &mut self.columns[idx].1
         } else {
             self.columns
                 .push((source_key.to_owned(), ColState::Unknown));
             &mut self.columns.last_mut().expect("just pushed").1
         }
     }
 }
