--- crates/rdlt-engine/src/shred/nest.rs
+++ replace TreeShredder::push_bytes -> Result<(), serde_json::Error> with Ok(())
@@ -154,22 +154,17 @@
         }
     }
 
     /// Shred one raw-JSON push (NDJSON, a JSON array, or a single document) into
     /// buffered rows across the stream's table family.
     pub(crate) fn push_bytes(&mut self, bytes: &[u8]) -> Result<(), serde_json::Error> {
         // Snapshot observation states: Discard* enforcement rolls offending columns
         // back to exactly this point.
-        self.pre_batch = self.tables.iter().map(|t| t.columns.clone()).collect();
-        let rows = parse_rows(bytes)?;
-        for row in rows {
-            self.push_row(row);
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn push_row(&mut self, row: Value) {
         // Non-object rows (a bare scalar/array in the feed) wrap into {"value": …} so
         // every table is uniformly an object relation.
         let row = match row {
             Value::Object(_) => row,
             other => {
