--- crates/rdlt-engine/src/shred/nest.rs
+++ replace StreamShredder::push_row with ()
@@ -155,104 +155,17 @@
             self.push_row(row);
         }
         Ok(())
     }
 
     fn push_row(&mut self, row: Value) {
         // Non-object rows (a bare scalar/array in the feed) wrap into {"value": …} so
         // every table is uniformly an object relation.
-        let row = match row {
-            Value::Object(_) => row,
-            other => {
-                let mut map = serde_json::Map::new();
-                map.insert("value".to_owned(), other);
-                Value::Object(map)
-            }
-        };
-
-        let root_id = self.row_identity(&row);
-        // Breadth-first traversal; every queued entry carries the ORIGINAL root row's
-        // id so `_rdlt_root_id` is correct at any nesting depth without parent-chain
-        // walks (design doc §5.4).
-        struct Queued {
-            table_idx: usize,
-            row: Value,
-            id: RowId,
-            parent_id: Option<RowId>,
-            root_id: RowId,
-            pos: Option<u64>,
-        }
-        let mut queue: VecDeque<Queued> = VecDeque::new();
-        queue.push_back(Queued {
-            table_idx: 0,
-            row,
-            id: root_id,
-            parent_id: None,
-            root_id,
-            pos: None,
-        });
-
-        while let Some(entry) = queue.pop_front() {
-            let lists_as_columns = self.caps.scalar_lists;
-            let is_root = entry.table_idx == 0;
-
-            // Observe every field; discover child tables.
-            let obj = entry
-                .row
-                .as_object()
-                .expect("rows are objects by construction");
-            let mut child_lists: Vec<(String, Vec<Value>)> = Vec::new();
-            for (key, value) in obj {
-                let state = self.tables[entry.table_idx].state_mut(key);
-                state.observe(value, lists_as_columns);
-                if state.is_child_table()
-                    && let Value::Array(items) = value
-                {
-                    child_lists.push((key.clone(), items.clone()));
-                }
-            }
-
-            // Enqueue child rows.
-            for (key, items) in child_lists {
-                let child_idx = self.child_table_idx(entry.table_idx, &key);
-                for (i, item) in items.into_iter().enumerate() {
-                    if item.is_null() {
-                        continue;
-                    }
-                    // Scalar list items in a child table become {"value": …} rows.
-                    let child_row = match item {
-                        Value::Object(_) => item,
-                        other => {
-                            let mut map = serde_json::Map::new();
-                            map.insert("value".to_owned(), other);
-                            Value::Object(map)
-                        }
-                    };
-                    let content = content_hash(&child_row);
-                    let child_id = child_row_id(&entry.id, i as u64, &content);
-                    queue.push_back(Queued {
-                        table_idx: child_idx,
-                        row: child_row,
-                        id: child_id,
-                        parent_id: Some(entry.id),
-                        root_id: entry.root_id,
-                        pos: Some(i as u64),
-                    });
-                }
-            }
-
-            self.tables[entry.table_idx].rows.push(BufferedRow {
-                value: entry.row,
-                id: entry.id,
-                parent_id: entry.parent_id,
-                root_id: if is_root { None } else { Some(entry.root_id) },
-                pos: entry.pos,
-            });
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn child_table_idx(&mut self, parent_idx: usize, source_key: &str) -> usize {
         let parent_table = self.tables[parent_idx].table.clone();
         let parent_depth = self.tables[parent_idx]
             .parent
             .as_ref()
             .map_or(0, |p| p.depth);
