--- crates/rdlt-engine/src/shred/nest.rs
+++ replace == with != in TreeShredder::push_row
@@ -199,17 +199,17 @@
             id: root_id,
             parent_id: None,
             root_id,
             pos: None,
         });
 
         while let Some(entry) = queue.pop_front() {
             let lists_as_columns = self.caps.scalar_lists;
-            let is_root = entry.table_idx == 0;
+            let is_root = entry.table_idx != /* ~ changed by cargo-mutants ~ */ 0;
 
             // Observe every field; discover child tables.
             let obj = entry
                 .row
                 .as_object()
                 .expect("rows are objects by construction");
             let mut child_lists: Vec<(String, Vec<Value>)> = Vec::new();
             for (key, value) in obj {
