--- crates/rdlt-engine/src/shred/nest.rs
+++ replace TreeShredder::child_table_idx -> usize with 0
@@ -257,36 +257,17 @@
                 parent_id: entry.parent_id,
                 root_id: if is_root { None } else { Some(entry.root_id) },
                 pos: entry.pos,
             });
         }
     }
 
     fn child_table_idx(&mut self, parent_idx: usize, source_key: &str) -> usize {
-        let parent_table = self.tables[parent_idx].table.clone();
-        let parent_depth = self.tables[parent_idx]
-            .parent
-            .as_ref()
-            .map_or(0, |p| p.depth);
-        let name = child_table_name(parent_table.as_str(), source_key, self.caps.ident_rules);
-        let table = TableName::new(name);
-        if let Some(idx) = self.tables.iter().position(|t| t.table == table) {
-            return idx;
-        }
-        self.tables.push(TableBuffer::new(
-            table,
-            Some(ParentLink {
-                parent: parent_table,
-                depth: parent_depth + 1,
-            }),
-            self.caps.ident_rules,
-        ));
-        self.rows.push(Vec::new());
-        self.tables.len() - 1
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// `_rdlt_id` for a root row: key hash when the stream declares a primary key,
     /// content hash otherwise (design doc §5.4).
     fn row_identity(&self, row: &Value) -> RowId {
         row_identity(self.spec.primary_key.as_deref(), row)
     }
 }
