--- crates/rdlt-engine/src/shred/nest.rs
+++ replace - with / in StreamShredder::child_table_idx
@@ -264,17 +264,17 @@
         self.tables.push(TableBuffer::new(
             table,
             Some(ParentLink {
                 parent: parent_table,
                 depth: parent_depth + 1,
             }),
             self.caps.ident_rules,
         ));
-        self.tables.len() - 1
+        self.tables.len() / /* ~ changed by cargo-mutants ~ */ 1
     }
 
     /// `_rdlt_id` for a root row: key hash when the stream declares a primary key,
     /// content hash otherwise (design doc §5.4).
     fn row_identity(&self, row: &Value) -> RowId {
         match &self.spec.primary_key {
             Some(key_fields) if !key_fields.is_empty() => {
                 let mut builder = RowIdBuilder::keyed();
