--- crates/rdlt-engine/src/shred/nest.rs
+++ replace TreeShredder::row_identity -> RowId with Default::default()
@@ -282,17 +282,17 @@
         ));
         self.rows.push(Vec::new());
         self.tables.len() - 1
     }
 
     /// `_rdlt_id` for a root row: key hash when the stream declares a primary key,
     /// content hash otherwise (design doc §5.4).
     fn row_identity(&self, row: &Value) -> RowId {
-        row_identity(self.spec.primary_key.as_deref(), row)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// `_rdlt_id` for a root row, shared by both shred paths.
 pub(crate) fn row_identity<'a, V: JsonView<'a>>(primary_key: Option<&[String]>, row: V) -> RowId {
     match primary_key {
         Some(key_fields) if !key_fields.is_empty() => {
             let mut builder = RowIdBuilder::keyed();
