--- crates/rdlt-engine/src/shred/nest.rs
+++ replace row_identity -> RowId with Default::default()
@@ -288,30 +288,17 @@
     /// content hash otherwise (design doc §5.4).
     fn row_identity(&self, row: &Value) -> RowId {
         row_identity(self.spec.primary_key.as_deref(), row)
     }
 }
 
 /// `_rdlt_id` for a root row, shared by both shred paths.
 pub(crate) fn row_identity<'a, V: JsonView<'a>>(primary_key: Option<&[String]>, row: V) -> RowId {
-    match primary_key {
-        Some(key_fields) if !key_fields.is_empty() => {
-            let mut builder = RowIdBuilder::keyed();
-            for field in key_fields {
-                let rendered = row.obj_get(field).and_then(render_scalar);
-                match &rendered {
-                    Some(text) => builder.field(field, FieldValue::Bytes(text.as_bytes())),
-                    None => builder.field(field, FieldValue::Null),
-                };
-            }
-            builder.finish()
-        }
-        _ => content_hash(row),
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn content_hash<'a, V: JsonView<'a>>(row: V) -> RowId {
     let mut scratch = Vec::new();
     content_hash_with(row, &mut scratch)
 }
 
 /// `content_hash` with a caller-owned scratch buffer — traversals hash every
