--- crates/rdlt-engine/src/shred/nest.rs
+++ replace content_hash -> RowId with Default::default()
@@ -305,18 +305,17 @@
             }
             builder.finish()
         }
         _ => content_hash(row),
     }
 }
 
 pub(crate) fn content_hash<'a, V: JsonView<'a>>(row: V) -> RowId {
-    let mut scratch = Vec::new();
-    content_hash_with(row, &mut scratch)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// `content_hash` with a caller-owned scratch buffer — traversals hash every
 /// row and child, and per-call Vec churn was visible in the shred profile.
 pub(crate) fn content_hash_with<'a, V: JsonView<'a>>(row: V, scratch: &mut Vec<u8>) -> RowId {
     scratch.clear();
     canonical_json_bytes(row, scratch);
     let mut builder = RowIdBuilder::keyless();
