--- crates/rdlt-engine/src/shred/nest.rs
+++ replace content_hash_with -> RowId with Default::default()
@@ -312,21 +312,17 @@
 pub(crate) fn content_hash<'a, V: JsonView<'a>>(row: V) -> RowId {
     let mut scratch = Vec::new();
     content_hash_with(row, &mut scratch)
 }
 
 /// `content_hash` with a caller-owned scratch buffer — traversals hash every
 /// row and child, and per-call Vec churn was visible in the shred profile.
 pub(crate) fn content_hash_with<'a, V: JsonView<'a>>(row: V, scratch: &mut Vec<u8>) -> RowId {
-    scratch.clear();
-    canonical_json_bytes(row, scratch);
-    let mut builder = RowIdBuilder::keyless();
-    builder.field("", FieldValue::Bytes(scratch));
-    builder.finish()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse a raw-JSON push: NDJSON, a top-level array, or a single document.
 pub(crate) fn parse_rows(bytes: &[u8]) -> Result<Vec<Value>, serde_json::Error> {
     let mut rows = Vec::new();
     let stream = serde_json::Deserializer::from_slice(bytes).into_iter::<Value>();
     for doc in stream {
         match doc? {
