--- crates/rdlt-engine/src/shred/nest.rs
+++ replace resolve_schema -> TableSchema with Default::default()
@@ -335,55 +335,10 @@
         }
     }
     Ok(rows)
 }
 
 /// Resolve one table's observation state into schema columns: system/lineage
 /// columns first, then source columns in first-seen order.
 pub(crate) fn resolve_schema(buffer: &mut TableBuffer) -> TableSchema {
-    let mut columns: Vec<ColumnDef> = Vec::new();
-    let system = |name: &str, ty| ColumnDef {
-        name: name.to_owned(),
-        ty: rdlt_core::ColumnType::scalar(ty),
-        nullable: false,
-        provenance: Provenance::System,
-    };
-    columns.push(system(
-        system_columns::LOAD_ID,
-        rdlt_core::LogicalType::Utf8,
-    ));
-    columns.push(system(system_columns::ID, rdlt_core::LogicalType::Utf8));
-    if buffer.parent.is_some() {
-        columns.push(system(
-            system_columns::PARENT_ID,
-            rdlt_core::LogicalType::Utf8,
-        ));
-        columns.push(system(system_columns::POS, rdlt_core::LogicalType::Int64));
-        columns.push(system(
-            system_columns::ROOT_ID,
-            rdlt_core::LogicalType::Utf8,
-        ));
-    }
-
-    let sources: Vec<(String, Option<rdlt_core::ColumnType>)> = buffer
-        .columns
-        .iter()
-        .map(|(key, state)| (key.clone(), state.resolve()))
-        .collect();
-    for (source_key, resolved) in sources {
-        if let Some(ty) = resolved {
-            let name = buffer.column_name(&source_key);
-            columns.push(ColumnDef {
-                name,
-                ty,
-                nullable: true,
-                provenance: Provenance::Inferred,
-            });
-        }
-    }
-
-    TableSchema {
-        table: buffer.table.clone(),
-        parent: buffer.parent.clone(),
-        columns,
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
