--- crates/rdlt-engine/src/shred/nest.rs
+++ replace TableBuffer::source_key_for -> Option<&str> with None
@@ -65,20 +65,17 @@
 
     /// Source key → normalized column name pairs accumulated so far.
     pub(crate) fn name_map(&self) -> &[(String, String)] {
         &self.names
     }
 
     /// Reverse lookup: normalized column name → source key.
     pub(crate) fn source_key_for(&self, normalized: &str) -> Option<&str> {
-        self.names
-            .iter()
-            .find(|(_, n)| n == normalized)
-            .map(|(source, _)| source.as_str())
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Policy enforcement: revert one column's observation state to its pre-batch
     /// snapshot (or remove it if the column first appeared this batch).
     pub(crate) fn revert_column(
         &mut self,
         source_key: &str,
         snapshot: Option<&[(String, ColState)]>,
