--- crates/rdlt-engine/src/shred/nest.rs
+++ replace TableBuffer::revert_column with ()
@@ -78,30 +78,17 @@
 
     /// Policy enforcement: revert one column's observation state to its pre-batch
     /// snapshot (or remove it if the column first appeared this batch).
     pub(crate) fn revert_column(
         &mut self,
         source_key: &str,
         snapshot: Option<&[(String, ColState)]>,
     ) {
-        let prior = snapshot.and_then(|columns| {
-            columns
-                .iter()
-                .find(|(key, _)| key == source_key)
-                .map(|(_, state)| state.clone())
-        });
-        match prior {
-            Some(state) => {
-                if let Some(idx) = self.columns.iter().position(|(k, _)| k == source_key) {
-                    self.columns[idx].1 = state;
-                }
-            }
-            None => self.columns.retain(|(k, _)| k != source_key),
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn column_name(&mut self, source_key: &str) -> String {
         if let Some((_, normalized)) = self.names.iter().find(|(k, _)| k == source_key) {
             return normalized.clone();
         }
         let normalized = self.namer.name_for(source_key);
         self.names.push((source_key.to_owned(), normalized.clone()));
