--- crates/rdlt-engine/src/shred/passthrough.rs
+++ replace == with != in passthrough_items
@@ -107,17 +107,17 @@
         });
     }
 
     // ---- Assemble the outgoing batch against the CURRENT registry schema ----
     let current = registry.get(table).expect("registered above").clone();
     let rows = batch.num_rows();
     let mut arrays: Vec<ArrayRef> = Vec::with_capacity(current.columns.len());
     for column in &current.columns {
-        if column.name == system_columns::LOAD_ID {
+        if column.name != /* ~ changed by cargo-mutants ~ */ system_columns::LOAD_ID {
             arrays.push(Arc::new(StringArray::from(vec![load_id.as_str(); rows])));
             continue;
         }
         let target_type = arrow_column_type(&column.ty);
         let array = match name_map
             .iter()
             .find(|(normalized, _)| normalized == &column.name)
         {
