--- crates/rdlt-engine/src/shred/passthrough.rs
+++ replace column_type_from_arrow -> Result<ColumnType, String> with Ok(Default::default())
@@ -191,56 +191,10 @@
             parent: None,
             columns,
         },
         name_map,
     ))
 }
 
 pub(crate) fn column_type_from_arrow(dt: &DataType) -> Result<ColumnType, String> {
-    use LogicalType::*;
-    let scalar = |t| Ok(ColumnType::scalar(t));
-    match dt {
-        DataType::Boolean => scalar(Bool),
-        DataType::Int8
-        | DataType::Int16
-        | DataType::Int32
-        | DataType::Int64
-        | DataType::UInt8
-        | DataType::UInt16
-        | DataType::UInt32 => scalar(Int64),
-        DataType::UInt64 => Err("UInt64 can exceed Int64; re-encode upstream".into()),
-        DataType::Float16 | DataType::Float32 | DataType::Float64 => scalar(Float64),
-        DataType::Utf8 | DataType::LargeUtf8 => scalar(Utf8),
-        DataType::Binary | DataType::LargeBinary => scalar(Binary),
-        DataType::Timestamp(_, Some(_)) => scalar(TimestampTz),
-        DataType::Timestamp(_, None) => scalar(TimestampNaive),
-        DataType::Date32 | DataType::Date64 => scalar(Date),
-        DataType::Time32(_) | DataType::Time64(TimeUnit::Microsecond | TimeUnit::Nanosecond) => {
-            scalar(Time)
-        }
-        DataType::Decimal128(precision, scale) if *scale >= 0 => Ok(ColumnType::scalar(Decimal {
-            precision: *precision,
-            scale: *scale as u8,
-        })),
-        DataType::Struct(fields) => {
-            let mapped: Result<Vec<ColumnDef>, String> = fields
-                .iter()
-                .map(|f| {
-                    Ok(ColumnDef {
-                        name: f.name().clone(),
-                        ty: column_type_from_arrow(f.data_type())?,
-                        nullable: true,
-                        provenance: Provenance::Inferred,
-                    })
-                })
-                .collect();
-            Ok(ColumnType::Struct { fields: mapped? })
-        }
-        DataType::List(item) | DataType::LargeList(item) => {
-            match column_type_from_arrow(item.data_type())? {
-                ColumnType::Scalar { scalar } => Ok(ColumnType::ScalarList { item: scalar }),
-                _ => Err("nested lists / lists of structs are not supported in v1".into()),
-            }
-        }
-        other => Err(format!("no logical mapping for {other}")),
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
