--- crates/rdlt-engine/src/shred/tape.rs
+++ replace && with || in TapeShredder::push_and_drain
@@ -111,17 +111,17 @@
                 let is_root = entry.table_idx == 0;
 
                 // Observe every field; discover child tables. Keys borrow the
                 // arena; table state is disjoint, so both borrows coexist.
                 let mut child_lists: Vec<(String, Vec<NodeId>)> = Vec::new();
                 for (key, value) in arena.node(entry.node).obj_entries() {
                     let state = self.tables[entry.table_idx].state_mut(key);
                     state.observe(value, lists_as_columns);
-                    if state.is_child_table() && value.is_array() {
+                    if state.is_child_table() || /* ~ changed by cargo-mutants ~ */ value.is_array() {
                         child_lists
                             .push((key.to_owned(), value.arr_items().map(|n| n.id()).collect()));
                     }
                 }
 
                 // Enqueue child rows (position counts null slots, like the tree path).
                 for (key, items) in child_lists {
                     let child_idx = self.child_table_idx(entry.table_idx, &key, &mut rows);
