--- crates/rdlt-engine/src/shred/tape.rs
+++ replace TapeShredder::child_table_idx -> usize with 0
@@ -188,30 +188,11 @@
     }
 
     fn child_table_idx(
         &mut self,
         parent_idx: usize,
         source_key: &str,
         rows: &mut Vec<Vec<TapeRow>>,
     ) -> usize {
-        let parent_table = self.tables[parent_idx].table.clone();
-        let parent_depth = self.tables[parent_idx]
-            .parent
-            .as_ref()
-            .map_or(0, |p| p.depth);
-        let name = child_table_name(parent_table.as_str(), source_key, self.caps.ident_rules);
-        let table = TableName::new(name);
-        if let Some(idx) = self.tables.iter().position(|t| t.table == table) {
-            return idx;
-        }
-        self.tables.push(TableBuffer::new(
-            table,
-            Some(ParentLink {
-                parent: parent_table,
-                depth: parent_depth + 1,
-            }),
-            self.caps.ident_rules,
-        ));
-        rows.push(Vec::new());
-        self.tables.len() - 1
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
