--- crates/rdlt-engine/src/shred/tape.rs
+++ replace + with * in TapeShredder::child_table_idx
@@ -202,16 +202,16 @@
         let table = TableName::new(name);
         if let Some(idx) = self.tables.iter().position(|t| t.table == table) {
             return idx;
         }
         self.tables.push(TableBuffer::new(
             table,
             Some(ParentLink {
                 parent: parent_table,
-                depth: parent_depth + 1,
+                depth: parent_depth * /* ~ changed by cargo-mutants ~ */ 1,
             }),
             self.caps.ident_rules,
         ));
         rows.push(Vec::new());
         self.tables.len() - 1
     }
 }
