--- crates/rdlt-engine/src/shred/tape.rs
+++ replace - with + in TapeShredder::child_table_idx
@@ -207,11 +207,11 @@
             table,
             Some(ParentLink {
                 parent: parent_table,
                 depth: parent_depth + 1,
             }),
             self.caps.ident_rules,
         ));
         rows.push(Vec::new());
-        self.tables.len() - 1
+        self.tables.len() + /* ~ changed by cargo-mutants ~ */ 1
     }
 }
