--- crates/rdlt-engine/src/shred/view.rs
+++ replace <impl Iterator for ValueObjIter<'a>>::next -> Option<Self::Item> with None
@@ -107,11 +107,11 @@
 static EMPTY_MAP: std::sync::LazyLock<serde_json::Map<String, Value>> =
     std::sync::LazyLock::new(serde_json::Map::new);
 
 pub(crate) struct ValueObjIter<'a>(serde_json::map::Iter<'a>);
 
 impl<'a> Iterator for ValueObjIter<'a> {
     type Item = (&'a str, &'a Value);
     fn next(&mut self) -> Option<Self::Item> {
-        self.0.next().map(|(k, v)| (k.as_str(), v))
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
