--- crates/rdlt-engine/src/shred/view.rs
+++ replace JsonView::is_null -> bool with true
@@ -45,17 +45,17 @@
     fn kind(self) -> Kind<'a>;
     /// Entries in sorted-key, last-duplicate-wins order (see view contract).
     fn obj_entries(self) -> Self::ObjIter;
     fn arr_items(self) -> Self::ArrIter;
     /// Top-level object lookup (last duplicate wins); `None` off objects.
     fn obj_get(self, key: &str) -> Option<Self>;
 
     fn is_null(self) -> bool {
-        matches!(self.kind(), Kind::Null)
+        true /* ~ changed by cargo-mutants ~ */
     }
     fn is_object(self) -> bool {
         matches!(self.kind(), Kind::Object)
     }
     fn is_array(self) -> bool {
         matches!(self.kind(), Kind::Array)
     }
 }
