--- crates/rdlt-engine/src/shred/view.rs
+++ replace JsonView::is_object -> bool with false
@@ -48,17 +48,17 @@
     fn arr_items(self) -> Self::ArrIter;
     /// Top-level object lookup (last duplicate wins); `None` off objects.
     fn obj_get(self, key: &str) -> Option<Self>;
 
     fn is_null(self) -> bool {
         matches!(self.kind(), Kind::Null)
     }
     fn is_object(self) -> bool {
-        matches!(self.kind(), Kind::Object)
+        false /* ~ changed by cargo-mutants ~ */
     }
     fn is_array(self) -> bool {
         matches!(self.kind(), Kind::Array)
     }
 }
 
 // ---- the tree view: `&serde_json::Value` ----
 
