--- crates/rdlt-engine/src/shred/view.rs
+++ replace <impl JsonView<'a> for &'a Value>::obj_entries -> Self::ObjIter with Default::default()
@@ -81,20 +81,17 @@
             }
             Value::String(s) => Kind::Str(s),
             Value::Object(_) => Kind::Object,
             Value::Array(_) => Kind::Array,
         }
     }
 
     fn obj_entries(self) -> Self::ObjIter {
-        match self {
-            Value::Object(map) => ValueObjIter(map.iter()),
-            _ => ValueObjIter(EMPTY_MAP.iter()),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn arr_items(self) -> Self::ArrIter {
         match self {
             Value::Array(items) => items.iter(),
             _ => [].iter(),
         }
     }
