--- crates/rdlt-engine/src/shred/view.rs
+++ replace <impl JsonView<'a> for &'a Value>::arr_items -> Self::ArrIter with Default::default()
@@ -88,20 +88,17 @@
     fn obj_entries(self) -> Self::ObjIter {
         match self {
             Value::Object(map) => ValueObjIter(map.iter()),
             _ => ValueObjIter(EMPTY_MAP.iter()),
         }
     }
 
     fn arr_items(self) -> Self::ArrIter {
-        match self {
-            Value::Array(items) => items.iter(),
-            _ => [].iter(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn obj_get(self, key: &str) -> Option<Self> {
         self.get(key)
     }
 }
 
 static EMPTY_MAP: std::sync::LazyLock<serde_json::Map<String, Value>> =
