--- crates/rdlt-engine/src/wal/mod.rs
+++ replace Wal::mark_committed -> Result<(), RdltError> with Ok(())
@@ -178,22 +178,17 @@
         self.manifest
             .sync_all()
             .map_err(|e| wal_err("fsync manifest", e))?;
         Ok(())
     }
 
     /// Step (3): the destination acknowledged `commit_seq` — mark and reclaim.
     pub(crate) fn mark_committed(&mut self, commit_seq: u64) -> Result<(), RdltError> {
-        self.append(&WalRecord::Committed { commit_seq })?;
-        for path in self.pending_gc.drain(..) {
-            // Best-effort: a survivor just gets replay-skipped via the Committed record.
-            let _ = std::fs::remove_file(path);
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn append(&mut self, record: &WalRecord) -> Result<(), RdltError> {
         crash_point!(
             "wal.manifest.append",
             Err(wal_err(
                 "append manifest",
                 std::io::Error::other("injected crash"),
