--- crates/rdlt-engine/src/wal/mod.rs
+++ replace write_segment -> Result<(), RdltError> with Ok(())
@@ -203,22 +203,15 @@
         line.push(b'\n');
         self.manifest
             .write_all(&line)
             .map_err(|e| wal_err("append manifest", e))
     }
 }
 
 fn write_segment(path: &Path, batch: &RecordBatch) -> Result<(), RdltError> {
-    let file = File::create(path).map_err(|e| wal_err("create segment", e))?;
-    let mut writer = ArrowWriter::try_new(file, Arc::clone(&batch.schema()), None)
-        .map_err(|e| wal_err("open segment writer", e))?;
-    writer
-        .write(batch)
-        .map_err(|e| wal_err("write segment", e))?;
-    writer.close().map_err(|e| wal_err("close segment", e))?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Remove the whole WAL directory (clean finish, or fresh start after full recovery).
 pub(crate) fn clear(dir: &Path) {
     let _ = std::fs::remove_dir_all(dir);
 }
