--- crates/rdlt-engine/src/wal/mod.rs
+++ replace wal_err -> RdltError with Default::default()
@@ -73,17 +73,17 @@
     segment_seq: u64,
     /// Segment files written since the last fsync barrier.
     pending_sync: Vec<PathBuf>,
     /// Segment files of the current uncommitted span (GC'd after receipt).
     pending_gc: Vec<PathBuf>,
 }
 
 fn wal_err(context: &str, e: impl std::fmt::Display) -> RdltError {
-    RdltError::wal(format!("{context}: {e}"))
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 impl Wal {
     /// Open (creating if needed) the WAL for a new run and append its `Run` header.
     pub(crate) fn open(
         dir: PathBuf,
         pipeline: &PipelineId,
         load_id: &LoadId,
