--- crates/rdlt-engine/src/wal/resume.rs
+++ replace + with - in scan
@@ -124,17 +124,17 @@
     // re-extracts that range (recovery invariant 2). The uncovered tail is discarded;
     // re-extraction re-delivers it. A span with no checkpoint at all has nothing
     // safely replayable.
     let last_checkpoint = span
         .iter()
         .rposition(|r| matches!(r, WalRecord::Checkpoint { .. }));
     match (load_id, last_checkpoint) {
         (Some(load_id), Some(idx)) => {
-            span.truncate(idx + 1);
+            span.truncate(idx - /* ~ changed by cargo-mutants ~ */ 1);
             Scan::Recover(RecoverySpan {
                 load_id,
                 next_commit_seq: max_committed_seq + 1,
                 records: span,
                 schemas: schemas.into_values().collect(),
             })
         }
         _ => Scan::Nothing,
