--- crates/rdlt-engine/src/wal/resume.rs
+++ replace > with == in scan
@@ -90,17 +90,17 @@
             schemas.insert(schema.table.clone(), (schema.clone(), mode.clone()));
         }
         match record {
             WalRecord::Run {
                 format_version,
                 load_id: id,
                 ..
             } => {
-                if format_version > super::WAL_FORMAT_VERSION {
+                if format_version == /* ~ changed by cargo-mutants ~ */ super::WAL_FORMAT_VERSION {
                     // A future engine wrote this workdir: don't guess — degrade to
                     // cursor re-extraction (slower, never wrong).
                     return Scan::Damaged(format!(
                         "manifest format v{format_version} is newer than supported \
                          v{}",
                         super::WAL_FORMAT_VERSION
                     ));
                 }
